#pragma once
#include "common.h"
namespace SDK
{


    struct FJoinabilitySettings //ScriptStruct CoreUObject.JoinabilitySettings
    {
    //Children Prop Count (Fields): 7
    public:

        struct FName SessionName; // 0x0
        bool bPublicSearchable; // 0x8
        bool bAllowInvites; // 0x9
        bool bJoinViaPresence; // 0xa
        bool bJoinViaPresenceFriendsOnly; // 0xb
        int32_t MaxPlayers; // 0xc
        int32_t MaxPartySize; // 0x10

    };

    struct FDefault__ScriptStruct //ScriptStruct CoreUObject.Default__ScriptStruct
    {
    public:


    };

    struct FUniqueNetIdWrapper //ScriptStruct CoreUObject.UniqueNetIdWrapper
    {
    public:


    };

    struct FGuid //ScriptStruct CoreUObject.Guid
    {
    //Children Prop Count (Fields): 4
    public:

        int32_t A; // 0x0
        int32_t B; // 0x4
        int32_t C; // 0x8
        int32_t D; // 0xc

    };

    struct FVector //ScriptStruct CoreUObject.Vector
    {
    //Children Prop Count (Fields): 3
    public:

        float X; // 0x0
        float Y; // 0x4
        float Z; // 0x8

    };

    struct FVector4 //ScriptStruct CoreUObject.Vector4
    {
    //Children Prop Count (Fields): 4
    public:

        float X; // 0x0
        float Y; // 0x4
        float Z; // 0x8
        float W; // 0xc

    };

    struct FVector2D //ScriptStruct CoreUObject.Vector2D
    {
    //Children Prop Count (Fields): 2
    public:

        float X; // 0x0
        float Y; // 0x4

    };

    struct FTwoVectors //ScriptStruct CoreUObject.TwoVectors
    {
    //Children Prop Count (Fields): 2
    public:

        struct FVector v1; // 0x0
        struct FVector v2; // 0xc

    };

    struct FPlane : FVector //ScriptStruct CoreUObject.Plane
    {
    //Children Prop Count (Fields): 1
    public:

        float W; // 0xc

    };

    struct FRotator //ScriptStruct CoreUObject.Rotator
    {
    //Children Prop Count (Fields): 3
    public:

        float Pitch; // 0x0
        float Yaw; // 0x4
        float Roll; // 0x8

    };

    struct FQuat //ScriptStruct CoreUObject.Quat
    {
    //Children Prop Count (Fields): 4
    public:

        float X; // 0x0
        float Y; // 0x4
        float Z; // 0x8
        float W; // 0xc

    };

    struct FPackedNormal //ScriptStruct CoreUObject.PackedNormal
    {
    //Children Prop Count (Fields): 4
    public:

        char X; // 0x0
        char Y; // 0x1
        char Z; // 0x2
        char W; // 0x3

    };

    struct FPackedRGB10A2N //ScriptStruct CoreUObject.PackedRGB10A2N
    {
    //Children Prop Count (Fields): 1
    public:

        int32_t Packed; // 0x0

    };

    struct FPackedRGBA16N //ScriptStruct CoreUObject.PackedRGBA16N
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t XY; // 0x0
        int32_t ZW; // 0x4

    };

    struct FIntPoint //ScriptStruct CoreUObject.IntPoint
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t X; // 0x0
        int32_t Y; // 0x4

    };

    struct FIntVector //ScriptStruct CoreUObject.IntVector
    {
    //Children Prop Count (Fields): 3
    public:

        int32_t X; // 0x0
        int32_t Y; // 0x4
        int32_t Z; // 0x8

    };

    struct FColor //ScriptStruct CoreUObject.Color
    {
    //Children Prop Count (Fields): 4
    public:

        char B; // 0x0
        char G; // 0x1
        char R; // 0x2
        char A; // 0x3

    };

    struct FLinearColor //ScriptStruct CoreUObject.LinearColor
    {
    //Children Prop Count (Fields): 4
    public:

        float R; // 0x0
        float G; // 0x4
        float B; // 0x8
        float A; // 0xc

    };

    struct FBox //ScriptStruct CoreUObject.Box
    {
    //Children Prop Count (Fields): 3
    public:

        struct FVector Min; // 0x0
        struct FVector Max; // 0xc
        char IsValid; // 0x18

    };

    struct FBox2D //ScriptStruct CoreUObject.Box2D
    {
    //Children Prop Count (Fields): 3
    public:

        struct FVector2D Min; // 0x0
        struct FVector2D Max; // 0x8
        char bIsValid; // 0x10

    };

    struct FBoxSphereBounds //ScriptStruct CoreUObject.BoxSphereBounds
    {
    //Children Prop Count (Fields): 3
    public:

        struct FVector Origin; // 0x0
        struct FVector BoxExtent; // 0xc
        float SphereRadius; // 0x18

    };

    struct FOrientedBox //ScriptStruct CoreUObject.OrientedBox
    {
    //Children Prop Count (Fields): 7
    public:

        struct FVector Center; // 0x0
        struct FVector AxisX; // 0xc
        struct FVector AxisY; // 0x18
        struct FVector AxisZ; // 0x24
        float ExtentX; // 0x30
        float ExtentY; // 0x34
        float ExtentZ; // 0x38

    };

    struct FMatrix //ScriptStruct CoreUObject.Matrix
    {
    //Children Prop Count (Fields): 4
    public:

        struct FPlane XPlane; // 0x0
        struct FPlane YPlane; // 0x10
        struct FPlane ZPlane; // 0x20
        struct FPlane WPlane; // 0x30

    };

    struct FInterpCurvePointFloat //ScriptStruct CoreUObject.InterpCurvePointFloat
    {
    //Children Prop Count (Fields): 5
    public:

        float InVal; // 0x0
        float OutVal; // 0x4
        float ArriveTangent; // 0x8
        float LeaveTangent; // 0xc
        enum class EInterpCurveMode InterpMode; // 0x10

    };

    struct FInterpCurveFloat //ScriptStruct CoreUObject.InterpCurveFloat
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<struct FInterpCurvePointFloat> Points; // 0x0
        bool bIsLooped; // 0x10
        float LoopKeyOffset; // 0x14

    };

    struct FInterpCurvePointVector2D //ScriptStruct CoreUObject.InterpCurvePointVector2D
    {
    //Children Prop Count (Fields): 5
    public:

        float InVal; // 0x0
        struct FVector2D OutVal; // 0x4
        struct FVector2D ArriveTangent; // 0xc
        struct FVector2D LeaveTangent; // 0x14
        enum class EInterpCurveMode InterpMode; // 0x1c

    };

    struct FInterpCurveVector2D //ScriptStruct CoreUObject.InterpCurveVector2D
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<struct FInterpCurvePointVector2D> Points; // 0x0
        bool bIsLooped; // 0x10
        float LoopKeyOffset; // 0x14

    };

    struct FInterpCurvePointVector //ScriptStruct CoreUObject.InterpCurvePointVector
    {
    //Children Prop Count (Fields): 5
    public:

        float InVal; // 0x0
        struct FVector OutVal; // 0x4
        struct FVector ArriveTangent; // 0x10
        struct FVector LeaveTangent; // 0x1c
        enum class EInterpCurveMode InterpMode; // 0x28

    };

    struct FInterpCurveVector //ScriptStruct CoreUObject.InterpCurveVector
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<struct FInterpCurvePointVector> Points; // 0x0
        bool bIsLooped; // 0x10
        float LoopKeyOffset; // 0x14

    };

    struct FInterpCurvePointQuat //ScriptStruct CoreUObject.InterpCurvePointQuat
    {
    //Children Prop Count (Fields): 5
    public:

        float InVal; // 0x0
        struct FQuat OutVal; // 0x10
        struct FQuat ArriveTangent; // 0x20
        struct FQuat LeaveTangent; // 0x30
        enum class EInterpCurveMode InterpMode; // 0x40

    };

    struct FInterpCurveQuat //ScriptStruct CoreUObject.InterpCurveQuat
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<struct FInterpCurvePointQuat> Points; // 0x0
        bool bIsLooped; // 0x10
        float LoopKeyOffset; // 0x14

    };

    struct FInterpCurvePointTwoVectors //ScriptStruct CoreUObject.InterpCurvePointTwoVectors
    {
    //Children Prop Count (Fields): 5
    public:

        float InVal; // 0x0
        struct FTwoVectors OutVal; // 0x4
        struct FTwoVectors ArriveTangent; // 0x1c
        struct FTwoVectors LeaveTangent; // 0x34
        enum class EInterpCurveMode InterpMode; // 0x4c

    };

    struct FInterpCurveTwoVectors //ScriptStruct CoreUObject.InterpCurveTwoVectors
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<struct FInterpCurvePointTwoVectors> Points; // 0x0
        bool bIsLooped; // 0x10
        float LoopKeyOffset; // 0x14

    };

    struct FInterpCurvePointLinearColor //ScriptStruct CoreUObject.InterpCurvePointLinearColor
    {
    //Children Prop Count (Fields): 5
    public:

        float InVal; // 0x0
        struct FLinearColor OutVal; // 0x4
        struct FLinearColor ArriveTangent; // 0x14
        struct FLinearColor LeaveTangent; // 0x24
        enum class EInterpCurveMode InterpMode; // 0x34

    };

    struct FInterpCurveLinearColor //ScriptStruct CoreUObject.InterpCurveLinearColor
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<struct FInterpCurvePointLinearColor> Points; // 0x0
        bool bIsLooped; // 0x10
        float LoopKeyOffset; // 0x14

    };

    struct FTransform //ScriptStruct CoreUObject.Transform
    {
    //Children Prop Count (Fields): 3
    public:

        struct FQuat Rotation; // 0x0
        struct FVector Translation; // 0x10
        struct FVector Scale3D; // 0x20

    };

    struct FRandomStream //ScriptStruct CoreUObject.RandomStream
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t InitialSeed; // 0x0
        int32_t Seed; // 0x4

    };

    struct FDateTime //ScriptStruct CoreUObject.DateTime
    {
    public:


    };

    struct FFrameNumber //ScriptStruct CoreUObject.FrameNumber
    {
    //Children Prop Count (Fields): 1
    public:

        int32_t Value; // 0x0

    };

    struct FFrameRate //ScriptStruct CoreUObject.FrameRate
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t Numerator; // 0x0
        int32_t Denominator; // 0x4

    };

    struct FFrameTime //ScriptStruct CoreUObject.FrameTime
    {
    //Children Prop Count (Fields): 2
    public:

        struct FFrameNumber FrameNumber; // 0x0
        float SubFrame; // 0x4

    };

    struct FQualifiedFrameTime //ScriptStruct CoreUObject.QualifiedFrameTime
    {
    //Children Prop Count (Fields): 2
    public:

        struct FFrameTime Time; // 0x0
        struct FFrameRate Rate; // 0x8

    };

    struct FTimecode //ScriptStruct CoreUObject.Timecode
    {
    //Children Prop Count (Fields): 5
    public:

        int32_t Hours; // 0x0
        int32_t Minutes; // 0x4
        int32_t Seconds; // 0x8
        int32_t Frames; // 0xc
        bool bDropFrameFormat; // 0x10

    };

    struct FTimespan //ScriptStruct CoreUObject.Timespan
    {
    public:


    };

    struct FSoftObjectPath //ScriptStruct CoreUObject.SoftObjectPath
    {
    //Children Prop Count (Fields): 2
    public:

        struct FName AssetPathName; // 0x0
        struct FString SubPathString; // 0x8

    };

    struct FSoftClassPath : FSoftObjectPath //ScriptStruct CoreUObject.SoftClassPath
    {
    public:


    };

    struct FPrimaryAssetType //ScriptStruct CoreUObject.PrimaryAssetType
    {
    //Children Prop Count (Fields): 1
    public:

        struct FName Name; // 0x0

    };

    struct FPrimaryAssetId //ScriptStruct CoreUObject.PrimaryAssetId
    {
    //Children Prop Count (Fields): 2
    public:

        struct FPrimaryAssetType PrimaryAssetType; // 0x0
        struct FName PrimaryAssetName; // 0x8

    };

    struct FFallbackStruct //ScriptStruct CoreUObject.FallbackStruct
    {
    public:


    };

    struct FFloatRangeBound //ScriptStruct CoreUObject.FloatRangeBound
    {
    //Children Prop Count (Fields): 2
    public:

        enum class ERangeBoundTypes Type; // 0x0
        float Value; // 0x4

    };

    struct FFloatRange //ScriptStruct CoreUObject.FloatRange
    {
    //Children Prop Count (Fields): 2
    public:

        struct FFloatRangeBound LowerBound; // 0x0
        struct FFloatRangeBound UpperBound; // 0x8

    };

    struct FInt32RangeBound //ScriptStruct CoreUObject.Int32RangeBound
    {
    //Children Prop Count (Fields): 2
    public:

        enum class ERangeBoundTypes Type; // 0x0
        int32_t Value; // 0x4

    };

    struct FInt32Range //ScriptStruct CoreUObject.Int32Range
    {
    //Children Prop Count (Fields): 2
    public:

        struct FInt32RangeBound LowerBound; // 0x0
        struct FInt32RangeBound UpperBound; // 0x8

    };

    struct FFloatInterval //ScriptStruct CoreUObject.FloatInterval
    {
    //Children Prop Count (Fields): 2
    public:

        float Min; // 0x0
        float Max; // 0x4

    };

    struct FInt32Interval //ScriptStruct CoreUObject.Int32Interval
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t Min; // 0x0
        int32_t Max; // 0x4

    };

    struct FPolyglotTextData //ScriptStruct CoreUObject.PolyglotTextData
    {
    //Children Prop Count (Fields): 8
    public:

        enum class ELocalizedTextSourceCategory Category; // 0x0
        struct FString NativeCulture; // 0x8
        struct FString Namespace; // 0x18
        struct FString Key; // 0x28
        struct FString NativeString; // 0x38
        struct TMap<struct FString, struct FString> LocalizedStrings; // 0x48
        bool bIsMinimalPatch; // 0x98
        struct FText CachedText; // 0xa0

    };

    struct FAutomationEvent //ScriptStruct CoreUObject.AutomationEvent
    {
    //Children Prop Count (Fields): 4
    public:

        enum class EAutomationEventType Type; // 0x0
        struct FString Message; // 0x8
        struct FString Context; // 0x18
        struct FGuid Artifact; // 0x28

    };

    struct FAutomationExecutionEntry //ScriptStruct CoreUObject.AutomationExecutionEntry
    {
    //Children Prop Count (Fields): 4
    public:

        struct FAutomationEvent Event; // 0x0
        struct FString Filename; // 0x38
        int32_t LineNumber; // 0x48
        struct FDateTime Timestamp; // 0x50

    };

    struct FBlueprintSessionResult //ScriptStruct OnlineSubsystemUtils.BlueprintSessionResult
    {
    public:


    };

    struct FInAppPurchaseProductInfo //ScriptStruct OnlineSubsystem.InAppPurchaseProductInfo
    {
    //Children Prop Count (Fields): 11
    public:

        struct FString Identifier; // 0x0
        struct FString TransactionIdentifier; // 0x10
        struct FString DisplayName; // 0x20
        struct FString DisplayDescription; // 0x30
        struct FString DisplayPrice; // 0x40
        float RawPrice; // 0x50
        struct FString CurrencyCode; // 0x58
        struct FString CurrencySymbol; // 0x68
        struct FString DecimalSeparator; // 0x78
        struct FString GroupingSeparator; // 0x88
        struct FString ReceiptData; // 0x98

    };

    struct FInAppPurchaseReceiptInfo2 //ScriptStruct OnlineSubsystemUtils.InAppPurchaseReceiptInfo2
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString ItemName; // 0x0
        struct FString ItemId; // 0x10
        struct FString ValidationInfo; // 0x20

    };

    struct FOnlineProxyStoreOffer //ScriptStruct OnlineSubsystemUtils.OnlineProxyStoreOffer
    {
    //Children Prop Count (Fields): 13
    public:

        struct FString OfferId; // 0x0
        struct FText Title; // 0x10
        struct FText Description; // 0x28
        struct FText LongDescription; // 0x40
        struct FText RegularPriceText; // 0x58
        int32_t RegularPrice; // 0x70
        struct FText PriceText; // 0x78
        int32_t NumericPrice; // 0x90
        struct FString CurrencyCode; // 0x98
        struct FDateTime ReleaseDate; // 0xa8
        struct FDateTime ExpirationDate; // 0xb0
        enum class EOnlineProxyStoreOfferDiscountType DiscountType; // 0xb8
        struct TMap<struct FString, struct FString> DynamicFields; // 0xc0

    };

    struct FInAppPurchaseRestoreInfo //ScriptStruct OnlineSubsystem.InAppPurchaseRestoreInfo
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString Identifier; // 0x0
        struct FString ReceiptData; // 0x10
        struct FString TransactionIdentifier; // 0x20

    };

    struct FInAppPurchaseRestoreInfo2 //ScriptStruct OnlineSubsystemUtils.InAppPurchaseRestoreInfo2
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString ItemName; // 0x0
        struct FString ItemId; // 0x10
        struct FString ValidationInfo; // 0x20

    };

    struct FAKWaapiJsonObject //ScriptStruct AkAudio.AKWaapiJsonObject
    {
    public:


    };

    struct FAkWaapiSubscriptionId //ScriptStruct AkAudio.AkWaapiSubscriptionId
    {
    public:


    };

    struct FDistributionLookupTable //ScriptStruct Engine.DistributionLookupTable
    {
    //Children Prop Count (Fields): 8
    public:

        float TimeScale; // 0x0
        float TimeBias; // 0x4
        struct TArray<float> Values; // 0x8
        char Op; // 0x18
        char EntryCount; // 0x19
        char EntryStride; // 0x1a
        char SubEntryStride; // 0x1b
        char LockFlag; // 0x1c

    };

    struct FRawDistribution //ScriptStruct Engine.RawDistribution
    {
    //Children Prop Count (Fields): 1
    public:

        struct FDistributionLookupTable Table; // 0x0

    };

    struct FFloatDistribution //ScriptStruct Engine.FloatDistribution
    {
    //Children Prop Count (Fields): 1
    public:

        struct FDistributionLookupTable Table; // 0x0

    };

    struct FVectorDistribution //ScriptStruct Engine.VectorDistribution
    {
    //Children Prop Count (Fields): 1
    public:

        struct FDistributionLookupTable Table; // 0x0

    };

    struct FVector4Distribution //ScriptStruct Engine.Vector4Distribution
    {
    //Children Prop Count (Fields): 1
    public:

        struct FDistributionLookupTable Table; // 0x0

    };

    struct FFloatRK4SpringInterpolator //ScriptStruct Engine.FloatRK4SpringInterpolator
    {
    //Children Prop Count (Fields): 2
    public:

        float StiffnessConstant; // 0x0
        float DampeningRatio; // 0x4

    };

    struct FVectorRK4SpringInterpolator //ScriptStruct Engine.VectorRK4SpringInterpolator
    {
    //Children Prop Count (Fields): 2
    public:

        float StiffnessConstant; // 0x0
        float DampeningRatio; // 0x4

    };

    struct FFormatArgumentData //ScriptStruct Engine.FormatArgumentData
    {
    //Children Prop Count (Fields): 6
    public:

        struct FString ArgumentName; // 0x0
        enum class EFormatArgumentType ArgumentValueType; // 0x10
        struct FText ArgumentValue; // 0x18
        int32_t ArgumentValueInt; // 0x30
        float ArgumentValueFloat; // 0x34
        enum class ETextGender ArgumentValueGender; // 0x38

    };

    struct FExpressionInput //ScriptStruct Engine.ExpressionInput
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t OutputIndex; // 0x0
        struct FName ExpressionName; // 0x4

    };

    struct FMaterialAttributesInput : FExpressionInput //ScriptStruct Engine.MaterialAttributesInput
    {
    //Children Prop Count (Fields): 1
    public:

        int32_t PropertyConnectedBitmask; // 0xc

    };

    struct FExpressionOutput //ScriptStruct Engine.ExpressionOutput
    {
    //Children Prop Count (Fields): 1
    public:

        struct FName OutputName; // 0x0

    };

    struct FMaterialInput //ScriptStruct Engine.MaterialInput
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t OutputIndex; // 0x0
        struct FName ExpressionName; // 0x4

    };

    struct FColorMaterialInput : FMaterialInput //ScriptStruct Engine.ColorMaterialInput
    {
    public:


    };

    struct FScalarMaterialInput : FMaterialInput //ScriptStruct Engine.ScalarMaterialInput
    {
    public:


    };

    struct FShadingModelMaterialInput : FMaterialInput //ScriptStruct Engine.ShadingModelMaterialInput
    {
    public:


    };

    struct FVectorMaterialInput : FMaterialInput //ScriptStruct Engine.VectorMaterialInput
    {
    public:


    };

    struct FVector2MaterialInput : FMaterialInput //ScriptStruct Engine.Vector2MaterialInput
    {
    public:


    };

    struct FHitResult //ScriptStruct Engine.HitResult
    {
    //Children Prop Count (Fields): 18
    public:

        char bBlockingHit; // 0x0
        char bStartPenetrating; // 0x0
        int32_t FaceIndex; // 0x4
        float Time; // 0x8
        float Distance; // 0xc
        struct FVector_NetQuantize Location; // 0x10
        struct FVector_NetQuantize ImpactPoint; // 0x1c
        struct FVector_NetQuantizeNormal Normal; // 0x28
        struct FVector_NetQuantizeNormal ImpactNormal; // 0x34
        struct FVector_NetQuantize TraceStart; // 0x40
        struct FVector_NetQuantize TraceEnd; // 0x4c
        float PenetrationDepth; // 0x58
        int32_t Item; // 0x5c
        struct TWeakObjectPtr<struct UPhysicalMaterial> PhysMaterial; // 0x60
        struct TWeakObjectPtr<struct AActor> Actor; // 0x68
        struct TWeakObjectPtr<struct UPrimitiveComponent> Component; // 0x70
        struct FName BoneName; // 0x78
        struct FName MyBoneName; // 0x80

    };

    struct FVector_NetQuantize : FVector //ScriptStruct Engine.Vector_NetQuantize
    {
    public:


    };

    struct FVector_NetQuantizeNormal : FVector //ScriptStruct Engine.Vector_NetQuantizeNormal
    {
    public:


    };

    struct FKey //ScriptStruct InputCore.Key
    {
    //Children Prop Count (Fields): 1
    public:

        struct FName KeyName; // 0x0

    };

    struct FBranchingPointNotifyPayload //ScriptStruct Engine.BranchingPointNotifyPayload
    {
    public:


    };

    struct FSimpleMemberReference //ScriptStruct Engine.SimpleMemberReference
    {
    //Children Prop Count (Fields): 3
    public:

        class UObject* MemberParent; // 0x0
        struct FName MemberName; // 0x8
        struct FGuid MemberGuid; // 0x10

    };

    struct FTickFunction //ScriptStruct Engine.TickFunction
    {
    //Children Prop Count (Fields): 7
    public:

        enum class ETickingGroup TickGroup; // 0x8
        enum class ETickingGroup EndTickGroup; // 0x9
        char bTickEvenWhenPaused; // 0xa
        char bCanEverTick; // 0xa
        char bStartWithTickEnabled; // 0xa
        char bAllowTickOnDedicatedServer; // 0xa
        float TickInterval; // 0xc

    };

    struct FActorComponentTickFunction : FTickFunction //ScriptStruct Engine.ActorComponentTickFunction
    {
    public:


    };

    struct FSubtitleCue //ScriptStruct Engine.SubtitleCue
    {
    //Children Prop Count (Fields): 2
    public:

        struct FText Text; // 0x0
        float Time; // 0x18

    };

    struct FInterpControlPoint //ScriptStruct Engine.InterpControlPoint
    {
    //Children Prop Count (Fields): 2
    public:

        struct FVector PositionControlPoint; // 0x0
        bool bPositionIsRelative; // 0xc

    };

    struct FPlatformInterfaceDelegateResult //ScriptStruct Engine.PlatformInterfaceDelegateResult
    {
    //Children Prop Count (Fields): 2
    public:

        bool bSuccessful; // 0x0
        struct FPlatformInterfaceData Data; // 0x8

    };

    struct FPlatformInterfaceData //ScriptStruct Engine.PlatformInterfaceData
    {
    //Children Prop Count (Fields): 6
    public:

        struct FName DataName; // 0x0
        enum class EPlatformInterfaceDataType Type; // 0x8
        int32_t IntValue; // 0xc
        float FloatValue; // 0x10
        struct FString StringValue; // 0x18
        class UObject* ObjectValue; // 0x28

    };

    struct FDebugFloatHistory //ScriptStruct Engine.DebugFloatHistory
    {
    //Children Prop Count (Fields): 5
    public:

        struct TArray<float> Samples; // 0x0
        float MaxSamples; // 0x10
        float MinValue; // 0x14
        float MaxValue; // 0x18
        bool bAutoAdjustMinMax; // 0x1c

    };

    struct FLatentActionInfo //ScriptStruct Engine.LatentActionInfo
    {
    //Children Prop Count (Fields): 4
    public:

        int32_t Linkage; // 0x0
        int32_t UUID; // 0x4
        struct FName ExecutionFunction; // 0x8
        class UObject* CallbackTarget; // 0x10

    };

    struct FTimerHandle //ScriptStruct Engine.TimerHandle
    {
    //Children Prop Count (Fields): 1
    public:

        uint64_t Handle; // 0x0

    };

    struct FCollisionProfileName //ScriptStruct Engine.CollisionProfileName
    {
    //Children Prop Count (Fields): 1
    public:

        struct FName Name; // 0x0

    };

    struct FGenericStruct //ScriptStruct Engine.GenericStruct
    {
    //Children Prop Count (Fields): 1
    public:

        int32_t Data; // 0x0

    };

    struct FUserActivity //ScriptStruct Engine.UserActivity
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString ActionName; // 0x0

    };

    struct FMagicLeapARPinState //ScriptStruct MagicLeapARPin.MagicLeapARPinState
    {
    //Children Prop Count (Fields): 4
    public:

        float Confidence; // 0x0
        float ValidRadius; // 0x4
        float RotationError; // 0x8
        float TranslationError; // 0xc

    };

    struct FPurchaseItemDetails //ScriptStruct MagicLeap.PurchaseItemDetails
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString Price; // 0x10
        struct FString Name; // 0x20
        enum class PurchaseType Type; // 0x30

    };

    struct FPurchaseConfirmation //ScriptStruct MagicLeap.PurchaseConfirmation
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString PackageName; // 0x10
        enum class PurchaseType Type; // 0x48

    };

    struct FMagicLeapMeshBlockRequest //ScriptStruct MagicLeap.MagicLeapMeshBlockRequest
    {
    //Children Prop Count (Fields): 2
    public:

        struct FGuid BlockID; // 0x0
        enum class EMagicLeapMeshLOD LevelOfDetail; // 0x10

    };

    struct FMagicLeapTrackingMeshInfo //ScriptStruct MagicLeap.MagicLeapTrackingMeshInfo
    {
    //Children Prop Count (Fields): 2
    public:

        struct FTimespan Timestamp; // 0x0
        struct TArray<struct FMagicLeapMeshBlockInfo> BlockData; // 0x8

    };

    struct FMagicLeapMeshBlockInfo //ScriptStruct MagicLeap.MagicLeapMeshBlockInfo
    {
    //Children Prop Count (Fields): 6
    public:

        struct FGuid BlockID; // 0x0
        struct FVector BlockPosition; // 0x10
        struct FRotator BlockOrientation; // 0x1c
        struct FVector BlockDimensions; // 0x28
        struct FTimespan Timestamp; // 0x38
        enum class EMagicLeapMeshState BlockState; // 0x40

    };

    struct FMagicLeapRaycastHitResult //ScriptStruct MagicLeap.MagicLeapRaycastHitResult
    {
    //Children Prop Count (Fields): 5
    public:

        enum class EMagicLeapRaycastResultState HitState; // 0x0
        struct FVector HitPoint; // 0x4
        struct FVector Normal; // 0x10
        float Confidence; // 0x1c
        int32_t UserData; // 0x20

    };

    struct FMagicLeapRaycastQueryParams //ScriptStruct MagicLeap.MagicLeapRaycastQueryParams
    {
    //Children Prop Count (Fields): 8
    public:

        struct FVector Position; // 0x0
        struct FVector Direction; // 0xc
        struct FVector UpVector; // 0x18
        int32_t Width; // 0x24
        int32_t Height; // 0x28
        float HorizontalFovDegrees; // 0x2c
        bool CollideWithUnobserved; // 0x30
        int32_t UserData; // 0x34

    };

    struct FMagicLeapTouchpadGesture //ScriptStruct MagicLeapController.MagicLeapTouchpadGesture
    {
    //Children Prop Count (Fields): 10
    public:

        enum class EControllerHand Hand; // 0x0
        struct FName MotionSource; // 0x4
        enum class EMagicLeapTouchpadGestureType Type; // 0xc
        enum class EMagicLeapTouchpadGestureDirection Direction; // 0xd
        struct FVector PositionAndForce; // 0x10
        float Speed; // 0x1c
        float Distance; // 0x20
        float FingerGap; // 0x24
        float Radius; // 0x28
        float Angle; // 0x2c

    };

    struct FMagicLeapIdentityAttribute //ScriptStruct MagicLeapIdentity.MagicLeapIdentityAttribute
    {
    //Children Prop Count (Fields): 2
    public:

        enum class EMagicLeapIdentityKey Attribute; // 0x0
        struct FString Value; // 0x8

    };

    struct FMagicLeapPlaneBoundaries //ScriptStruct MagicLeapPlanes.MagicLeapPlaneBoundaries
    {
    //Children Prop Count (Fields): 2
    public:

        struct FGuid ID; // 0x0
        struct TArray<struct FMagicLeapPlaneBoundary> Boundaries; // 0x10

    };

    struct FMagicLeapPlaneBoundary //ScriptStruct MagicLeapPlanes.MagicLeapPlaneBoundary
    {
    //Children Prop Count (Fields): 2
    public:

        struct FMagicLeapPolygon Polygon; // 0x0
        struct TArray<struct FMagicLeapPolygon> Holes; // 0x10

    };

    struct FMagicLeapPolygon //ScriptStruct MagicLeapPlanes.MagicLeapPolygon
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<struct FVector> Vertices; // 0x0

    };

    struct FMagicLeapPlaneResult //ScriptStruct MagicLeapPlanes.MagicLeapPlaneResult
    {
    //Children Prop Count (Fields): 7
    public:

        struct FVector PlanePosition; // 0x0
        struct FRotator PlaneOrientation; // 0xc
        struct FRotator ContentOrientation; // 0x18
        struct FVector2D PlaneDimensions; // 0x24
        struct TArray<enum class EMagicLeapPlaneQueryFlags> PlaneFlags; // 0x30
        struct FGuid ID; // 0x40
        struct FGuid InnerID; // 0x50

    };

    struct FAppleImageUtilsImageConversionResult //ScriptStruct AppleImageUtils.AppleImageUtilsImageConversionResult
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString Error; // 0x0
        struct TArray<char> ImageData; // 0x10

    };

    struct FLocationServicesData //ScriptStruct LocationServicesBPLibrary.LocationServicesData
    {
    //Children Prop Count (Fields): 6
    public:

        float Timestamp; // 0x0
        float Longitude; // 0x4
        float Latitude; // 0x8
        float HorizontalAccuracy; // 0xc
        float VerticalAccuracy; // 0x10
        float Altitude; // 0x14

    };

    struct FEnvSetting //ScriptStruct VeiledExperts.EnvSetting
    {
    //Children Prop Count (Fields): 19
    public:

        char bApplyLightIntensity; // 0x0
        float SkyLightIntensity; // 0x4
        float DirectionalLightIntensity; // 0x8
        struct FColor SkyLightColor; // 0xc
        struct FColor DirectionalLightColor; // 0x10
        char bUseFogSetting; // 0x14
        struct FLinearColor FogInscatteringColor; // 0x18
        float FogMaxOpacity; // 0x28
        float FogDensity; // 0x2c
        float FogHeightFalloff; // 0x30
        float FogStartDistance; // 0x34
        float FogDensity2; // 0x38
        float FogHeightFalloff2; // 0x3c
        float FogHeightOffset2; // 0x40
        struct FColor VolumetricFogAlbedo; // 0x44
        float VolumetricFogScatteringDistribution; // 0x48
        float VolumetricFogExtinctionScale; // 0x4c
        float VolumetricFogDistance; // 0x50
        struct FVector MovingObjectPosition; // 0x54

    };

    struct FGeometry //ScriptStruct SlateCore.Geometry
    {
    public:


    };

    struct FSlateBrush //ScriptStruct SlateCore.SlateBrush
    {
    //Children Prop Count (Fields): 12
    public:

        struct FVector2D ImageSize; // 0x8
        struct FMargin Margin; // 0x10
        struct FSlateColor TintColor; // 0x20
        class UObject* ResourceObject; // 0x48
        struct FName ResourceName; // 0x50
        struct FBox2D UVRegion; // 0x58
        enum class ESlateBrushDrawType DrawAs; // 0x6c
        enum class ESlateBrushTileType tiling; // 0x6d
        enum class ESlateBrushMirrorType Mirroring; // 0x6e
        enum class ESlateBrushImageType ImageType; // 0x6f
        char bIsDynamicallyLoaded; // 0x80
        char bHasUObject; // 0x80

    };

    struct FSlateColor //ScriptStruct SlateCore.SlateColor
    {
    //Children Prop Count (Fields): 2
    public:

        struct FLinearColor SpecifiedColor; // 0x0
        enum class ESlateColorStylingMode ColorUseRule; // 0x10

    };

    struct FMargin //ScriptStruct SlateCore.Margin
    {
    //Children Prop Count (Fields): 4
    public:

        float Left; // 0x0
        float Top; // 0x4
        float Right; // 0x8
        float Bottom; // 0xc

    };

    struct FEventReply //ScriptStruct UMG.EventReply
    {
    public:


    };

    struct FInputEvent //ScriptStruct SlateCore.InputEvent
    {
    public:


    };

    struct FPointerEvent : FInputEvent //ScriptStruct SlateCore.PointerEvent
    {
    public:


    };

    struct FWidgetTransform //ScriptStruct UMG.WidgetTransform
    {
    //Children Prop Count (Fields): 4
    public:

        struct FVector2D Translation; // 0x0
        struct FVector2D Scale; // 0x8
        struct FVector2D Shear; // 0x10
        float Angle; // 0x18

    };

    struct FPaintContext //ScriptStruct UMG.PaintContext
    {
    public:


    };

    struct FCharacterEvent : FInputEvent //ScriptStruct SlateCore.CharacterEvent
    {
    public:


    };

    struct FKeyEvent : FInputEvent //ScriptStruct SlateCore.KeyEvent
    {
    public:


    };

    struct FNavigationEvent : FInputEvent //ScriptStruct SlateCore.NavigationEvent
    {
    public:


    };

    struct FAnalogInputEvent : FKeyEvent //ScriptStruct SlateCore.AnalogInputEvent
    {
    public:


    };

    struct FSlateFontInfo //ScriptStruct SlateCore.SlateFontInfo
    {
    //Children Prop Count (Fields): 5
    public:

        class UObject* FontObject; // 0x0
        class UObject* FontMaterial; // 0x8
        struct FFontOutlineSettings OutlineSettings; // 0x10
        struct FName TypefaceFontName; // 0x40
        int32_t Size; // 0x48

    };

    struct FFontOutlineSettings //ScriptStruct SlateCore.FontOutlineSettings
    {
    //Children Prop Count (Fields): 5
    public:

        int32_t OutlineSize; // 0x0
        bool bSeparateFillAlpha; // 0x4
        bool bApplyOutlineToDropShadows; // 0x5
        class UObject* OutlineMaterial; // 0x8
        struct FLinearColor OutlineColor; // 0x10

    };

    struct FSlateWidgetStyle //ScriptStruct SlateCore.SlateWidgetStyle
    {
    public:


    };

    struct FTableRowStyle : FSlateWidgetStyle //ScriptStruct SlateCore.TableRowStyle
    {
    //Children Prop Count (Fields): 16
    public:

        struct FSlateBrush SelectorFocusedBrush; // 0x8
        struct FSlateBrush ActiveHoveredBrush; // 0x90
        struct FSlateBrush ActiveBrush; // 0x118
        struct FSlateBrush InactiveHoveredBrush; // 0x1a0
        struct FSlateBrush InactiveBrush; // 0x228
        struct FSlateBrush EvenRowBackgroundHoveredBrush; // 0x2b0
        struct FSlateBrush EvenRowBackgroundBrush; // 0x338
        struct FSlateBrush OddRowBackgroundHoveredBrush; // 0x3c0
        struct FSlateBrush OddRowBackgroundBrush; // 0x448
        struct FSlateColor TextColor; // 0x4d0
        struct FSlateColor SelectedTextColor; // 0x4f8
        struct FSlateBrush DropIndicator_Above; // 0x520
        struct FSlateBrush DropIndicator_Onto; // 0x5a8
        struct FSlateBrush DropIndicator_Below; // 0x630
        struct FSlateBrush ActiveHighlightedBrush; // 0x6b8
        struct FSlateBrush InactiveHighlightedBrush; // 0x740

    };

    struct FComboBoxStyle : FSlateWidgetStyle //ScriptStruct SlateCore.ComboBoxStyle
    {
    //Children Prop Count (Fields): 3
    public:

        struct FComboButtonStyle ComboButtonStyle; // 0x8
        struct FSlateSound PressedSlateSound; // 0x3c0
        struct FSlateSound SelectionChangeSlateSound; // 0x3d8

    };

    struct FSlateSound //ScriptStruct SlateCore.SlateSound
    {
    //Children Prop Count (Fields): 1
    public:

        class UObject* ResourceObject; // 0x0

    };

    struct FComboButtonStyle : FSlateWidgetStyle //ScriptStruct SlateCore.ComboButtonStyle
    {
    //Children Prop Count (Fields): 6
    public:

        struct FButtonStyle ButtonStyle; // 0x8
        struct FSlateBrush DownArrowImage; // 0x280
        struct FVector2D ShadowOffset; // 0x308
        struct FLinearColor ShadowColorAndOpacity; // 0x310
        struct FSlateBrush MenuBorderBrush; // 0x320
        struct FMargin MenuBorderPadding; // 0x3a8

    };

    struct FButtonStyle : FSlateWidgetStyle //ScriptStruct SlateCore.ButtonStyle
    {
    //Children Prop Count (Fields): 8
    public:

        struct FSlateBrush Normal; // 0x8
        struct FSlateBrush Hovered; // 0x90
        struct FSlateBrush Pressed; // 0x118
        struct FSlateBrush Disabled; // 0x1a0
        struct FMargin NormalPadding; // 0x228
        struct FMargin PressedPadding; // 0x238
        struct FSlateSound PressedSlateSound; // 0x248
        struct FSlateSound HoveredSlateSound; // 0x260

    };

    struct FShapedTextOptions //ScriptStruct UMG.ShapedTextOptions
    {
    //Children Prop Count (Fields): 4
    public:

        char bOverride_TextShapingMethod; // 0x0
        char bOverride_TextFlowDirection; // 0x0
        enum class ETextShapingMethod TextShapingMethod; // 0x1
        enum class ETextFlowDirection TextFlowDirection; // 0x2

    };

    struct FVirtualKeyboardOptions //ScriptStruct Slate.VirtualKeyboardOptions
    {
    //Children Prop Count (Fields): 1
    public:

        bool bEnableAutocorrect; // 0x0

    };

    struct FEditableTextStyle : FSlateWidgetStyle //ScriptStruct SlateCore.EditableTextStyle
    {
    //Children Prop Count (Fields): 5
    public:

        struct FSlateFontInfo Font; // 0x8
        struct FSlateColor ColorAndOpacity; // 0x58
        struct FSlateBrush BackgroundImageSelected; // 0x80
        struct FSlateBrush BackgroundImageComposing; // 0x108
        struct FSlateBrush CaretImage; // 0x190

    };

    struct FEditableTextBoxStyle : FSlateWidgetStyle //ScriptStruct SlateCore.EditableTextBoxStyle
    {
    //Children Prop Count (Fields): 12
    public:

        struct FSlateBrush BackgroundImageNormal; // 0x8
        struct FSlateBrush BackgroundImageHovered; // 0x90
        struct FSlateBrush BackgroundImageFocused; // 0x118
        struct FSlateBrush BackgroundImageReadOnly; // 0x1a0
        struct FMargin Padding; // 0x228
        struct FSlateFontInfo Font; // 0x238
        struct FSlateColor ForegroundColor; // 0x288
        struct FSlateColor BackgroundColor; // 0x2b0
        struct FSlateColor ReadOnlyForegroundColor; // 0x2d8
        struct FMargin HScrollBarPadding; // 0x300
        struct FMargin VScrollBarPadding; // 0x310
        struct FScrollBarStyle ScrollBarStyle; // 0x320

    };

    struct FScrollBarStyle : FSlateWidgetStyle //ScriptStruct SlateCore.ScrollBarStyle
    {
    //Children Prop Count (Fields): 9
    public:

        struct FSlateBrush HorizontalBackgroundImage; // 0x8
        struct FSlateBrush VerticalBackgroundImage; // 0x90
        struct FSlateBrush VerticalTopSlotImage; // 0x118
        struct FSlateBrush HorizontalTopSlotImage; // 0x1a0
        struct FSlateBrush VerticalBottomSlotImage; // 0x228
        struct FSlateBrush HorizontalBottomSlotImage; // 0x2b0
        struct FSlateBrush NormalThumbImage; // 0x338
        struct FSlateBrush HoveredThumbImage; // 0x3c0
        struct FSlateBrush DraggedThumbImage; // 0x448

    };

    struct FInputChord //ScriptStruct Slate.InputChord
    {
    //Children Prop Count (Fields): 5
    public:

        struct FKey Key; // 0x0
        char bShift; // 0x18
        char bCtrl; // 0x18
        char bAlt; // 0x18
        char bCmd; // 0x18

    };

    struct FTextBlockStyle : FSlateWidgetStyle //ScriptStruct SlateCore.TextBlockStyle
    {
    //Children Prop Count (Fields): 9
    public:

        struct FSlateFontInfo Font; // 0x8
        struct FSlateColor ColorAndOpacity; // 0x58
        struct FVector2D ShadowOffset; // 0x80
        struct FLinearColor ShadowColorAndOpacity; // 0x88
        struct FSlateColor SelectedBackgroundColor; // 0x98
        struct FLinearColor HighlightColor; // 0xc0
        struct FSlateBrush HighlightShape; // 0xd0
        struct FSlateBrush StrikeBrush; // 0x158
        struct FSlateBrush UnderlineBrush; // 0x1e0

    };

    struct FSpinBoxStyle : FSlateWidgetStyle //ScriptStruct SlateCore.SpinBoxStyle
    {
    //Children Prop Count (Fields): 7
    public:

        struct FSlateBrush BackgroundBrush; // 0x8
        struct FSlateBrush HoveredBackgroundBrush; // 0x90
        struct FSlateBrush ActiveFillBrush; // 0x118
        struct FSlateBrush InactiveFillBrush; // 0x1a0
        struct FSlateBrush ArrowsImage; // 0x228
        struct FSlateColor ForegroundColor; // 0x2b0
        struct FMargin TextPadding; // 0x2d8

    };

    struct FGameplayResourceSet //ScriptStruct GameplayTasks.GameplayResourceSet
    {
    public:


    };

    struct FAIRequestID //ScriptStruct AIModule.AIRequestID
    {
    //Children Prop Count (Fields): 1
    public:

        uint32_t RequestID; // 0x0

    };

    struct FAIStimulus //ScriptStruct AIModule.AIStimulus
    {
    //Children Prop Count (Fields): 7
    public:

        float Age; // 0x0
        float ExpirationAge; // 0x4
        float Strength; // 0x8
        struct FVector StimulusLocation; // 0xc
        struct FVector ReceiverLocation; // 0x18
        struct FName Tag; // 0x24
        char bSuccessfullySensed; // 0x38

    };

    struct FChaosPhysicsCollisionInfo //ScriptStruct ChaosSolverEngine.ChaosPhysicsCollisionInfo
    {
    //Children Prop Count (Fields): 11
    public:

        class UPrimitiveComponent* Component; // 0x0
        class UPrimitiveComponent* OtherComponent; // 0x8
        struct FVector Location; // 0x10
        struct FVector Normal; // 0x1c
        struct FVector AccumulatedImpulse; // 0x28
        struct FVector Velocity; // 0x34
        struct FVector OtherVelocity; // 0x40
        struct FVector AngularVelocity; // 0x4c
        struct FVector OtherAngularVelocity; // 0x58
        float Mass; // 0x64
        float OtherMass; // 0x68

    };

    struct FChaosBreakEvent //ScriptStruct ChaosSolverEngine.ChaosBreakEvent
    {
    //Children Prop Count (Fields): 5
    public:

        class UPrimitiveComponent* Component; // 0x0
        struct FVector Location; // 0x8
        struct FVector Velocity; // 0x14
        struct FVector AngularVelocity; // 0x20
        float Mass; // 0x2c

    };

    struct FWalkableSlopeOverride //ScriptStruct Engine.WalkableSlopeOverride
    {
    //Children Prop Count (Fields): 2
    public:

        enum class EWalkableSlopeBehavior WalkableSlopeBehavior; // 0x0
        float WalkableSlopeAngle; // 0x4

    };

    struct FBodyInstance //ScriptStruct Engine.BodyInstance
    {
    //Children Prop Count (Fields): 44
    public:

        enum class ECollisionChannel ObjectType; // 0x6
        enum class ECollisionEnabled CollisionEnabled; // 0x8
        enum class ESleepFamily SleepFamily; // 0xa
        enum class EDOFMode DOFMode; // 0xb
        char bUseCCD; // 0xc
        char bIgnoreAnalyticCollisions; // 0xc
        char bNotifyRigidBodyCollision; // 0xc
        char bSimulatePhysics; // 0xc
        char bOverrideMass; // 0xc
        char bEnableGravity; // 0xc
        char bAutoWeld; // 0xc
        char bStartAwake; // 0xd
        char bGenerateWakeEvents; // 0xd
        char bUpdateMassWhenScaleChanges; // 0xd
        char bLockTranslation; // 0xd
        char bLockRotation; // 0xd
        char bLockXTranslation; // 0xd
        char bLockYTranslation; // 0xd
        char bLockZTranslation; // 0xd
        char bLockXRotation; // 0xe
        char bLockYRotation; // 0xe
        char bLockZRotation; // 0xe
        char bOverrideMaxAngularVelocity; // 0xe
        char bOverrideMaxDepenetrationVelocity; // 0xe
        char bOverrideWalkableSlopeOnInstance; // 0xe
        char bInterpolateWhenSubStepping; // 0xf
        struct FName CollisionProfileName; // 0x1c
        char PositionSolverIterationCount; // 0x24
        char VelocitySolverIterationCount; // 0x25
        struct FCollisionResponse CollisionResponses; // 0x28
        float MaxDepenetrationVelocity; // 0x58
        float MassInKgOverride; // 0x5c
        float LinearDamping; // 0x68
        float AngularDamping; // 0x6c
        struct FVector CustomDOFPlaneNormal; // 0x70
        struct FVector COMNudge; // 0x7c
        float MassScale; // 0x88
        struct FVector InertiaTensorScale; // 0x8c
        struct FWalkableSlopeOverride WalkableSlopeOverride; // 0xa8
        class UPhysicalMaterial* PhysMaterialOverride; // 0xb8
        float MaxAngularVelocity; // 0xc0
        float CustomSleepThresholdMultiplier; // 0xc4
        float StabilizationThresholdMultiplier; // 0xc8
        float PhysicsBlendWeight; // 0xcc

    };

    struct FCollisionResponse //ScriptStruct Engine.CollisionResponse
    {
    //Children Prop Count (Fields): 2
    public:

        struct FCollisionResponseContainer ResponseToChannels; // 0x0
        struct TArray<struct FResponseChannel> ResponseArray; // 0x20

    };

    struct FResponseChannel //ScriptStruct Engine.ResponseChannel
    {
    //Children Prop Count (Fields): 2
    public:

        struct FName Channel; // 0x0
        enum class ECollisionResponse Response; // 0x8

    };

    struct FCollisionResponseContainer //ScriptStruct Engine.CollisionResponseContainer
    {
    //Children Prop Count (Fields): 32
    public:

        enum class ECollisionResponse WorldStatic; // 0x0
        enum class ECollisionResponse WorldDynamic; // 0x1
        enum class ECollisionResponse Pawn; // 0x2
        enum class ECollisionResponse Visibility; // 0x3
        enum class ECollisionResponse Camera; // 0x4
        enum class ECollisionResponse PhysicsBody; // 0x5
        enum class ECollisionResponse Vehicle; // 0x6
        enum class ECollisionResponse Destructible; // 0x7
        enum class ECollisionResponse EngineTraceChannel1; // 0x8
        enum class ECollisionResponse EngineTraceChannel2; // 0x9
        enum class ECollisionResponse EngineTraceChannel3; // 0xa
        enum class ECollisionResponse EngineTraceChannel4; // 0xb
        enum class ECollisionResponse EngineTraceChannel5; // 0xc
        enum class ECollisionResponse EngineTraceChannel6; // 0xd
        enum class ECollisionResponse GameTraceChannel1; // 0xe
        enum class ECollisionResponse GameTraceChannel2; // 0xf
        enum class ECollisionResponse GameTraceChannel3; // 0x10
        enum class ECollisionResponse GameTraceChannel4; // 0x11
        enum class ECollisionResponse GameTraceChannel5; // 0x12
        enum class ECollisionResponse GameTraceChannel6; // 0x13
        enum class ECollisionResponse GameTraceChannel7; // 0x14
        enum class ECollisionResponse GameTraceChannel8; // 0x15
        enum class ECollisionResponse GameTraceChannel9; // 0x16
        enum class ECollisionResponse GameTraceChannel10; // 0x17
        enum class ECollisionResponse GameTraceChannel11; // 0x18
        enum class ECollisionResponse GameTraceChannel12; // 0x19
        enum class ECollisionResponse GameTraceChannel13; // 0x1a
        enum class ECollisionResponse GameTraceChannel14; // 0x1b
        enum class ECollisionResponse GameTraceChannel15; // 0x1c
        enum class ECollisionResponse GameTraceChannel16; // 0x1d
        enum class ECollisionResponse GameTraceChannel17; // 0x1e
        enum class ECollisionResponse GameTraceChannel18; // 0x1f

    };

    struct FCustomPrimitiveData //ScriptStruct Engine.CustomPrimitiveData
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<float> Data; // 0x0

    };

    struct FLightingChannels //ScriptStruct Engine.LightingChannels
    {
    //Children Prop Count (Fields): 3
    public:

        char bChannel0; // 0x0
        char bChannel1; // 0x0
        char bChannel2; // 0x0

    };

    struct FGeomComponentCacheParameters //ScriptStruct GeometryCollectionEngine.GeomComponentCacheParameters
    {
    //Children Prop Count (Fields): 20
    public:

        enum class EGeometryCollectionCacheType CacheMode; // 0x0
        class UGeometryCollectionCache* TargetCache; // 0x8
        float ReverseCacheBeginTime; // 0x10
        bool SaveCollisionData; // 0x14
        bool DoGenerateCollisionData; // 0x15
        int32_t CollisionDataSizeMax; // 0x18
        bool DoCollisionDataSpatialHash; // 0x1c
        float CollisionDataSpatialHashRadius; // 0x20
        int32_t MaxCollisionPerCell; // 0x24
        bool SaveBreakingData; // 0x28
        bool DoGenerateBreakingData; // 0x29
        int32_t BreakingDataSizeMax; // 0x2c
        bool DoBreakingDataSpatialHash; // 0x30
        float BreakingDataSpatialHashRadius; // 0x34
        int32_t MaxBreakingPerCell; // 0x38
        bool SaveTrailingData; // 0x3c
        bool DoGenerateTrailingData; // 0x3d
        int32_t TrailingDataSizeMax; // 0x40
        float TrailingMinSpeedThreshold; // 0x44
        float TrailingMinVolumeThreshold; // 0x48

    };

    struct FChaosCollisionEventData //ScriptStruct GeometryCollectionEngine.ChaosCollisionEventData
    {
    //Children Prop Count (Fields): 7
    public:

        struct FVector Location; // 0x0
        struct FVector Normal; // 0xc
        struct FVector Velocity1; // 0x18
        struct FVector Velocity2; // 0x24
        float Mass1; // 0x30
        float Mass2; // 0x34
        struct FVector Impulse; // 0x38

    };

    struct FChaosBreakingEventData //ScriptStruct GeometryCollectionEngine.ChaosBreakingEventData
    {
    //Children Prop Count (Fields): 3
    public:

        struct FVector Location; // 0x0
        struct FVector Velocity; // 0xc
        float Mass; // 0x18

    };

    struct FChaosTrailingEventData //ScriptStruct GeometryCollectionEngine.ChaosTrailingEventData
    {
    //Children Prop Count (Fields): 5
    public:

        struct FVector Location; // 0x0
        struct FVector Velocity; // 0xc
        struct FVector AngularVelocity; // 0x18
        float Mass; // 0x24
        int32_t ParticleIndex; // 0x28

    };

    struct FSubstanceInstanceDesc //ScriptStruct SubstanceCore.SubstanceInstanceDesc
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString Name; // 0x0
        struct TArray<struct FSubstanceInputDesc> Inputs; // 0x10

    };

    struct FSubstanceInputDesc //ScriptStruct SubstanceCore.SubstanceInputDesc
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString Name; // 0x0
        enum class ESubstanceInputType Type; // 0x10

    };

    struct FSubstanceFloatInputDesc : FSubstanceInputDesc //ScriptStruct SubstanceCore.SubstanceFloatInputDesc
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<float> Min; // 0x18
        struct TArray<float> Max; // 0x28
        struct TArray<float> Default; // 0x38

    };

    struct FSubstanceIntInputDesc : FSubstanceInputDesc //ScriptStruct SubstanceCore.SubstanceIntInputDesc
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<int32_t> Min; // 0x18
        struct TArray<int32_t> Max; // 0x28
        struct TArray<int32_t> Default; // 0x38

    };

    struct FSubstanceConnection //ScriptStruct SubstanceCore.SubstanceConnection
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString OutputIdentifier; // 0x0
        struct FString InputImageIdentifier; // 0x10

    };

    struct FPrefabricatorAssetCollectionItem //ScriptStruct PrefabricatorRuntime.PrefabricatorAssetCollectionItem
    {
    //Children Prop Count (Fields): 2
    public:

        struct TSoftObjectPtr<UPrefabricatorAsset> PrefabAsset; // 0x0
        float Weight; // 0x28

    };

    struct FPrefabricatorActorData //ScriptStruct PrefabricatorRuntime.PrefabricatorActorData
    {
    //Children Prop Count (Fields): 6
    public:

        struct FGuid PrefabItemID; // 0x0
        struct FTransform RelativeTransform; // 0x10
        struct FString ClassPath; // 0x40
        struct FSoftClassPath ClassPathRef; // 0x50
        struct TArray<class UPrefabricatorProperty*> Properties; // 0x68
        struct TArray<struct FPrefabricatorComponentData> Components; // 0x78

    };

    struct FPrefabricatorComponentData //ScriptStruct PrefabricatorRuntime.PrefabricatorComponentData
    {
    //Children Prop Count (Fields): 3
    public:

        struct FTransform RelativeTransform; // 0x0
        struct FString ComponentName; // 0x30
        struct TArray<class UPrefabricatorProperty*> Properties; // 0x40

    };

    struct FPrefabricatorPropertyAssetMapping //ScriptStruct PrefabricatorRuntime.PrefabricatorPropertyAssetMapping
    {
    //Children Prop Count (Fields): 4
    public:

        struct FSoftObjectPath AssetReference; // 0x0
        struct FString AssetClassName; // 0x18
        struct FName AssetObjectPath; // 0x28
        bool bUseQuotes; // 0x30

    };

    struct FConstructionSystemSavePlayerInfo //ScriptStruct ConstructionSystemRuntime.ConstructionSystemSavePlayerInfo
    {
    //Children Prop Count (Fields): 3
    public:

        bool bRestorePlayerInfo; // 0x0
        struct FTransform Transform; // 0x10
        struct FRotator ControlRotation; // 0x40

    };

    struct FConstructionSystemSaveConstructedItem //ScriptStruct ConstructionSystemRuntime.ConstructionSystemSaveConstructedItem
    {
    //Children Prop Count (Fields): 3
    public:

        class UPrefabricatorAssetInterface* PrefabAsset; // 0x0
        int32_t Seed; // 0x8
        struct FTransform Transform; // 0x10

    };

    struct FPCSnapConstraintWall //ScriptStruct ConstructionSystemRuntime.PCSnapConstraintWall
    {
    //Children Prop Count (Fields): 4
    public:

        bool AttachTop; // 0x0
        bool AttachBottom; // 0x1
        bool AttachLeft; // 0x2
        bool AttachRight; // 0x3

    };

    struct FPCSnapConstraintFloor //ScriptStruct ConstructionSystemRuntime.PCSnapConstraintFloor
    {
    //Children Prop Count (Fields): 6
    public:

        bool AttachX; // 0x0
        bool AttachXNegative; // 0x1
        bool AttachY; // 0x2
        bool AttachYNegative; // 0x3
        bool AttachZ; // 0x4
        bool AttachZNegative; // 0x5

    };

    struct FConstructionSystemUICategory //ScriptStruct ConstructionSystemRuntime.ConstructionSystemUICategory
    {
    //Children Prop Count (Fields): 3
    public:

        struct FText DisplayName; // 0x0
        class UTexture2D* Icon; // 0x18
        struct TArray<struct FConstructionSystemUIPrefabEntry> PrefabEntries; // 0x20

    };

    struct FConstructionSystemUIPrefabEntry //ScriptStruct ConstructionSystemRuntime.ConstructionSystemUIPrefabEntry
    {
    //Children Prop Count (Fields): 4
    public:

        struct FText DisplayName; // 0x0
        struct FText Tooltip; // 0x18
        class UTexture2D* Icon; // 0x30
        class UPrefabricatorAssetInterface* Prefab; // 0x38

    };

    struct FDestructibleChunkParameters //ScriptStruct ApexDestruction.DestructibleChunkParameters
    {
    //Children Prop Count (Fields): 4
    public:

        bool bIsSupportChunk; // 0x0
        bool bDoNotFracture; // 0x1
        bool bDoNotDamage; // 0x2
        bool bDoNotCrumble; // 0x3

    };

    struct FFractureMaterial //ScriptStruct ApexDestruction.FractureMaterial
    {
    //Children Prop Count (Fields): 5
    public:

        struct FVector2D UVScale; // 0x0
        struct FVector2D UVOffset; // 0x8
        struct FVector Tangent; // 0x10
        float UAngle; // 0x1c
        int32_t InteriorElementIndex; // 0x20

    };

    struct FDestructibleParameters //ScriptStruct ApexDestruction.DestructibleParameters
    {
    //Children Prop Count (Fields): 6
    public:

        struct FDestructibleDamageParameters DamageParameters; // 0x0
        struct FDestructibleDebrisParameters DebrisParameters; // 0x1c
        struct FDestructibleAdvancedParameters AdvancedParameters; // 0x48
        struct FDestructibleSpecialHierarchyDepths SpecialHierarchyDepths; // 0x58
        struct TArray<struct FDestructibleDepthParameters> DepthParameters; // 0x70
        struct FDestructibleParametersFlag Flags; // 0x80

    };

    struct FDestructibleParametersFlag //ScriptStruct ApexDestruction.DestructibleParametersFlag
    {
    //Children Prop Count (Fields): 9
    public:

        char bAccumulateDamage; // 0x0
        char bAssetDefinedSupport; // 0x0
        char bWorldSupport; // 0x0
        char bDebrisTimeout; // 0x0
        char bDebrisMaxSeparation; // 0x0
        char bCrumbleSmallestChunks; // 0x0
        char bAccurateRaycasts; // 0x0
        char bUseValidBounds; // 0x0
        char bFormExtendedStructures; // 0x1

    };

    struct FDestructibleDepthParameters //ScriptStruct ApexDestruction.DestructibleDepthParameters
    {
    //Children Prop Count (Fields): 1
    public:

        enum class EImpactDamageOverride ImpactDamageOverride; // 0x0

    };

    struct FDestructibleSpecialHierarchyDepths //ScriptStruct ApexDestruction.DestructibleSpecialHierarchyDepths
    {
    //Children Prop Count (Fields): 5
    public:

        int32_t SupportDepth; // 0x0
        int32_t MinimumFractureDepth; // 0x4
        bool bEnableDebris; // 0x8
        int32_t DebrisDepth; // 0xc
        int32_t EssentialDepth; // 0x10

    };

    struct FDestructibleAdvancedParameters //ScriptStruct ApexDestruction.DestructibleAdvancedParameters
    {
    //Children Prop Count (Fields): 4
    public:

        float DamageCap; // 0x0
        float ImpactVelocityThreshold; // 0x4
        float MaxChunkSpeed; // 0x8
        float FractureImpulseScale; // 0xc

    };

    struct FDestructibleDebrisParameters //ScriptStruct ApexDestruction.DestructibleDebrisParameters
    {
    //Children Prop Count (Fields): 5
    public:

        float DebrisLifetimeMin; // 0x0
        float DebrisLifetimeMax; // 0x4
        float DebrisMaxSeparationMin; // 0x8
        float DebrisMaxSeparationMax; // 0xc
        struct FBox ValidBounds; // 0x10

    };

    struct FDestructibleDamageParameters //ScriptStruct ApexDestruction.DestructibleDamageParameters
    {
    //Children Prop Count (Fields): 7
    public:

        float DamageThreshold; // 0x0
        float DamageSpread; // 0x4
        bool bEnableImpactDamage; // 0x8
        float ImpactDamage; // 0xc
        int32_t DefaultImpactDamageDepth; // 0x10
        bool bCustomImpactResistance; // 0x14
        float ImpactResistance; // 0x18

    };

    struct FProcMeshSection //ScriptStruct ProceduralMeshComponent.ProcMeshSection
    {
    //Children Prop Count (Fields): 5
    public:

        struct TArray<struct FProcMeshVertex> ProcVertexBuffer; // 0x0
        struct TArray<uint32_t> ProcIndexBuffer; // 0x10
        struct FBox SectionLocalBox; // 0x20
        bool bEnableCollision; // 0x3c
        bool bSectionVisible; // 0x3d

    };

    struct FProcMeshVertex //ScriptStruct ProceduralMeshComponent.ProcMeshVertex
    {
    //Children Prop Count (Fields): 8
    public:

        struct FVector Position; // 0x0
        struct FVector Normal; // 0xc
        struct FProcMeshTangent Tangent; // 0x18
        struct FColor Color; // 0x28
        struct FVector2D UV0; // 0x2c
        struct FVector2D UV1; // 0x34
        struct FVector2D UV2; // 0x3c
        struct FVector2D UV3; // 0x44

    };

    struct FProcMeshTangent //ScriptStruct ProceduralMeshComponent.ProcMeshTangent
    {
    //Children Prop Count (Fields): 2
    public:

        struct FVector TangentX; // 0x0
        bool bFlipTangentY; // 0xc

    };

    struct FAnimNode_Base //ScriptStruct Engine.AnimNode_Base
    {
    public:


    };

    struct FAnimNode_Mirror : FAnimNode_Base //ScriptStruct MirrorAnimationSystem.AnimNode_Mirror
    {
    //Children Prop Count (Fields): 2
    public:

        struct FPoseLink BasePose; // 0x10
        class UMirrorTable* MirrorTable; // 0x20

    };

    struct FPoseLinkBase //ScriptStruct Engine.PoseLinkBase
    {
    //Children Prop Count (Fields): 1
    public:

        int32_t LinkID; // 0x0

    };

    struct FPoseLink : FPoseLinkBase //ScriptStruct Engine.PoseLink
    {
    public:


    };

    struct FAnimNode_SkeletalControlBase : FAnimNode_Base //ScriptStruct AnimGraphRuntime.AnimNode_SkeletalControlBase
    {
    //Children Prop Count (Fields): 10
    public:

        struct FComponentSpacePoseLink ComponentPose; // 0x10
        int32_t LODThreshold; // 0x20
        float ActualAlpha; // 0x24
        enum class EAnimAlphaInputType AlphaInputType; // 0x28
        bool bAlphaBoolEnabled; // 0x29
        float Alpha; // 0x2c
        struct FInputScaleBias AlphaScaleBias; // 0x30
        struct FInputAlphaBoolBlend AlphaBoolBlend; // 0x38
        struct FName AlphaCurveName; // 0x80
        struct FInputScaleBiasClamp AlphaScaleBiasClamp; // 0x88

    };

    struct FInputScaleBiasClamp //ScriptStruct Engine.InputScaleBiasClamp
    {
    //Children Prop Count (Fields): 11
    public:

        bool bMapRange; // 0x0
        bool bClampResult; // 0x1
        bool bInterpResult; // 0x2
        struct FInputRange InRange; // 0x4
        struct FInputRange OutRange; // 0xc
        float Scale; // 0x14
        float Bias; // 0x18
        float ClampMin; // 0x1c
        float ClampMax; // 0x20
        float InterpSpeedIncreasing; // 0x24
        float InterpSpeedDecreasing; // 0x28

    };

    struct FInputRange //ScriptStruct Engine.InputRange
    {
    //Children Prop Count (Fields): 2
    public:

        float Min; // 0x0
        float Max; // 0x4

    };

    struct FInputAlphaBoolBlend //ScriptStruct Engine.InputAlphaBoolBlend
    {
    //Children Prop Count (Fields): 6
    public:

        float BlendInTime; // 0x0
        float BlendOutTime; // 0x4
        enum class EAlphaBlendOption BlendOption; // 0x8
        bool bInitialized; // 0x9
        class UCurveFloat* CustomCurve; // 0x10
        struct FAlphaBlend AlphaBlend; // 0x18

    };

    struct FAlphaBlend //ScriptStruct Engine.AlphaBlend
    {
    //Children Prop Count (Fields): 3
    public:

        class UCurveFloat* CustomCurve; // 0x0
        float BlendTime; // 0x8
        enum class EAlphaBlendOption BlendOption; // 0x24

    };

    struct FInputScaleBias //ScriptStruct Engine.InputScaleBias
    {
    //Children Prop Count (Fields): 2
    public:

        float Scale; // 0x0
        float Bias; // 0x4

    };

    struct FComponentSpacePoseLink : FPoseLinkBase //ScriptStruct Engine.ComponentSpacePoseLink
    {
    public:


    };

    struct FAnimNode_MirrorCS : FAnimNode_SkeletalControlBase //ScriptStruct MirrorAnimationSystem.AnimNode_MirrorCS
    {
    //Children Prop Count (Fields): 4
    public:

        enum class EAxis MirrorAxis; // 0xc8
        bool CompletlySymmetrical; // 0xc9
        struct FString Substring_A; // 0xd0
        struct FString Substring_B; // 0xe0

    };

    struct FMirrorBone //ScriptStruct MirrorAnimationSystem.MirrorBone
    {
    //Children Prop Count (Fields): 10
    public:

        struct FName BoneName; // 0x0
        enum class EAxis MirrorAxis; // 0x8
        enum class EAxis FlipAxis; // 0x9
        bool IsTwinBone; // 0xa
        struct FName TwinBoneName; // 0xc
        bool MirrorTranslation; // 0x14
        struct FRotator RotationOffset; // 0x18
        bool InvertTwinRotationX; // 0x24
        bool InvertTwinRotationY; // 0x25
        bool InvertTwinRotationZ; // 0x26

    };

    struct FTableRowBase //ScriptStruct Engine.TableRowBase
    {
    public:


    };

    struct FVtaAsset : FTableRowBase //ScriptStruct VaTexAtlasPlugin.VtaAsset
    {
    //Children Prop Count (Fields): 2
    public:

        struct TSoftObjectPtr<UMaterialInstanceConstant> Material; // 0x8
        struct TSoftObjectPtr<UVtaSlateTexture> SlateTexture; // 0x30

    };

    struct FNamedInterfaceDef //ScriptStruct OnlineSubsystem.NamedInterfaceDef
    {
    //Children Prop Count (Fields): 2
    public:

        struct FName InterfaceName; // 0x0
        struct FString InterfaceClassName; // 0x8

    };

    struct FNamedInterface //ScriptStruct OnlineSubsystem.NamedInterface
    {
    //Children Prop Count (Fields): 2
    public:

        struct FName InterfaceName; // 0x0
        class UObject* InterfaceObject; // 0x8

    };

    struct FInAppPurchaseProductRequest //ScriptStruct OnlineSubsystem.InAppPurchaseProductRequest
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString ProductIdentifier; // 0x0
        bool bIsConsumable; // 0x10

    };

    struct FInAppPurchaseReceiptInfo //ScriptStruct OnlineSubsystemUtils.InAppPurchaseReceiptInfo
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString ItemName; // 0x0
        struct FString ItemId; // 0x10
        struct FString ValidationInfo; // 0x20

    };

    struct FInAppPurchaseProductInfo2 //ScriptStruct OnlineSubsystemUtils.InAppPurchaseProductInfo2
    {
    //Children Prop Count (Fields): 12
    public:

        struct FString Identifier; // 0x0
        struct FString TransactionIdentifier; // 0x10
        struct FString DisplayName; // 0x20
        struct FString DisplayDescription; // 0x30
        struct FString DisplayPrice; // 0x40
        float RawPrice; // 0x50
        struct FString CurrencyCode; // 0x58
        struct FString CurrencySymbol; // 0x68
        struct FString DecimalSeparator; // 0x78
        struct FString GroupingSeparator; // 0x88
        struct FString ReceiptData; // 0x98
        struct TMap<struct FString, struct FString> DynamicFields; // 0xa8

    };

    struct FInAppPurchaseProductRequest2 //ScriptStruct OnlineSubsystemUtils.InAppPurchaseProductRequest2
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString ProductIdentifier; // 0x0
        bool bIsConsumable; // 0x10

    };

    struct FPlayerReservation //ScriptStruct OnlineSubsystemUtils.PlayerReservation
    {
    //Children Prop Count (Fields): 5
    public:

        struct FUniqueNetIdRepl UniqueId; // 0x0
        struct FString ValidationStr; // 0x28
        struct FString Platform; // 0x38
        bool bAllowCrossplay; // 0x48
        float ElapsedTime; // 0x4c

    };

    struct FUniqueNetIdRepl : FUniqueNetIdWrapper //ScriptStruct Engine.UniqueNetIdRepl
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<char> ReplicationBytes; // 0x18

    };

    struct FPIELoginSettingsInternal //ScriptStruct OnlineSubsystemUtils.PIELoginSettingsInternal
    {
    //Children Prop Count (Fields): 4
    public:

        struct FString ID; // 0x0
        struct FString Token; // 0x10
        struct FString Type; // 0x20
        struct TArray<char> TokenBytes; // 0x30

    };

    struct FPartyReservation //ScriptStruct OnlineSubsystemUtils.PartyReservation
    {
    //Children Prop Count (Fields): 4
    public:

        int32_t TeamNum; // 0x0
        struct FUniqueNetIdRepl PartyLeader; // 0x8
        struct TArray<struct FPlayerReservation> PartyMembers; // 0x30
        struct TArray<struct FPlayerReservation> RemovedPartyMembers; // 0x40

    };

    struct FSpectatorReservation //ScriptStruct OnlineSubsystemUtils.SpectatorReservation
    {
    //Children Prop Count (Fields): 2
    public:

        struct FUniqueNetIdRepl SpectatorId; // 0x0
        struct FPlayerReservation Spectator; // 0x28

    };

    struct FEditPivotTarget //ScriptStruct MeshModelingTools.EditPivotTarget
    {
    //Children Prop Count (Fields): 2
    public:

        class UTransformProxy* TransformProxy; // 0x0
        class UTransformGizmo* TransformGizmo; // 0x8

    };

    struct FTransformMeshesTarget //ScriptStruct MeshModelingTools.TransformMeshesTarget
    {
    //Children Prop Count (Fields): 2
    public:

        class UTransformProxy* TransformProxy; // 0x0
        class UTransformGizmo* TransformGizmo; // 0x8

    };

    struct FAkAdvancedInitializationSettings //ScriptStruct AkAudio.AkAdvancedInitializationSettings
    {
    //Children Prop Count (Fields): 11
    public:

        uint32_t IO_MemorySize; // 0x0
        uint32_t IO_Granularity; // 0x4
        float TargetAutoStreamBufferLength; // 0x8
        bool UseStreamCache; // 0xc
        uint32_t MaximumPinnedBytesInCache; // 0x10
        bool EnableGameSyncPreparation; // 0x14
        uint32_t ContinuousPlaybackLookAhead; // 0x18
        uint32_t MonitorQueuePoolSize; // 0x1c
        uint32_t MaximumHardwareTimeoutMs; // 0x20
        bool DebugOutOfRangeCheckEnabled; // 0x24
        float DebugOutOfRangeLimit; // 0x28

    };

    struct FAkAdvancedInitializationSettingsWithMultiCoreRendering : FAkAdvancedInitializationSettings //ScriptStruct AkAudio.AkAdvancedInitializationSettingsWithMultiCoreRendering
    {
    //Children Prop Count (Fields): 1
    public:

        bool EnableMultiCoreRendering; // 0x2c

    };

    struct FAkAndroidAdvancedInitializationSettings : FAkAdvancedInitializationSettingsWithMultiCoreRendering //ScriptStruct AkAudio.AkAndroidAdvancedInitializationSettings
    {
    //Children Prop Count (Fields): 2
    public:

        uint32_t AudioAPI; // 0x30
        bool RoundFrameSizeToHardwareSize; // 0x34

    };

    struct FAkAudioSession //ScriptStruct AkAudio.AkAudioSession
    {
    //Children Prop Count (Fields): 3
    public:

        enum class EAkAudioSessionCategory AudioSessionCategory; // 0x0
        uint32_t AudioSessionCategoryOptions; // 0x4
        enum class EAkAudioSessionMode AudioSessionMode; // 0x8

    };

    struct FAkExternalSourceInfo //ScriptStruct AkAudio.AkExternalSourceInfo
    {
    //Children Prop Count (Fields): 5
    public:

        struct FString ExternalSrcName; // 0x0
        enum class AkCodecId CodecID; // 0x10
        struct FString Filename; // 0x18
        class UAkExternalMediaAsset* ExternalSourceAsset; // 0x28
        bool IsStreamed; // 0x30

    };

    struct FAkSegmentInfo //ScriptStruct AkAudio.AkSegmentInfo
    {
    //Children Prop Count (Fields): 9
    public:

        int32_t CurrentPosition; // 0x0
        int32_t PreEntryDuration; // 0x4
        int32_t ActiveDuration; // 0x8
        int32_t PostExitDuration; // 0xc
        int32_t RemainingLookAheadTime; // 0x10
        float BeatDuration; // 0x14
        float BarDuration; // 0x18
        float GridDuration; // 0x1c
        float GridOffset; // 0x20

    };

    struct FAkMidiEventBase //ScriptStruct AkAudio.AkMidiEventBase
    {
    //Children Prop Count (Fields): 2
    public:

        enum class EAkMidiEventType Type; // 0x0
        char Chan; // 0x1

    };

    struct FAkMidiProgramChange : FAkMidiEventBase //ScriptStruct AkAudio.AkMidiProgramChange
    {
    //Children Prop Count (Fields): 1
    public:

        char ProgramNum; // 0x2

    };

    struct FAkMidiChannelAftertouch : FAkMidiEventBase //ScriptStruct AkAudio.AkMidiChannelAftertouch
    {
    //Children Prop Count (Fields): 1
    public:

        char Value; // 0x2

    };

    struct FAkMidiNoteAftertouch : FAkMidiEventBase //ScriptStruct AkAudio.AkMidiNoteAftertouch
    {
    //Children Prop Count (Fields): 2
    public:

        char Note; // 0x2
        char Value; // 0x3

    };

    struct FAkMidiPitchBend : FAkMidiEventBase //ScriptStruct AkAudio.AkMidiPitchBend
    {
    //Children Prop Count (Fields): 3
    public:

        char ValueLsb; // 0x2
        char ValueMsb; // 0x3
        int32_t FullValue; // 0x4

    };

    struct FAkMidiCc : FAkMidiEventBase //ScriptStruct AkAudio.AkMidiCc
    {
    //Children Prop Count (Fields): 2
    public:

        enum class EAkMidiCcValues Cc; // 0x2
        char Value; // 0x3

    };

    struct FAkMidiNoteOnOff : FAkMidiEventBase //ScriptStruct AkAudio.AkMidiNoteOnOff
    {
    //Children Prop Count (Fields): 2
    public:

        char Note; // 0x2
        char Velocity; // 0x3

    };

    struct FAkMidiGeneric : FAkMidiEventBase //ScriptStruct AkAudio.AkMidiGeneric
    {
    //Children Prop Count (Fields): 2
    public:

        char Param1; // 0x2
        char Param2; // 0x3

    };

    struct FAkChannelMask //ScriptStruct AkAudio.AkChannelMask
    {
    //Children Prop Count (Fields): 1
    public:

        int32_t ChannelMask; // 0x0

    };

    struct FAkGeometrySurfaceOverride //ScriptStruct AkAudio.AkGeometrySurfaceOverride
    {
    //Children Prop Count (Fields): 4
    public:

        class UAkAcousticTexture* AcousticTexture; // 0x0
        char bEnableOcclusionOverride; // 0x8
        float OcclusionValue; // 0xc
        float SurfaceArea; // 0x10

    };

    struct FAkGeometryData //ScriptStruct AkAudio.AkGeometryData
    {
    //Children Prop Count (Fields): 5
    public:

        struct TArray<struct FVector> Vertices; // 0x0
        struct TArray<struct FAkAcousticSurface> Surfaces; // 0x10
        struct TArray<struct FAkTriangle> Triangles; // 0x20
        struct TArray<class UPhysicalMaterial*> ToOverrideAcousticTexture; // 0x30
        struct TArray<class UPhysicalMaterial*> ToOverrideOcclusion; // 0x40

    };

    struct FAkTriangle //ScriptStruct AkAudio.AkTriangle
    {
    //Children Prop Count (Fields): 4
    public:

        uint16_t Point0; // 0x0
        uint16_t Point1; // 0x2
        uint16_t Point2; // 0x4
        uint16_t Surface; // 0x6

    };

    struct FAkAcousticSurface //ScriptStruct AkAudio.AkAcousticSurface
    {
    //Children Prop Count (Fields): 3
    public:

        uint32_t Texture; // 0x0
        float Occlusion; // 0x4
        struct FString Name; // 0x8

    };

    struct FAkHololensAdvancedInitializationSettings : FAkAdvancedInitializationSettingsWithMultiCoreRendering //ScriptStruct AkAudio.AkHololensAdvancedInitializationSettings
    {
    //Children Prop Count (Fields): 1
    public:

        bool UseHeadMountedDisplayAudioDevice; // 0x30

    };

    struct FAkPluginInfo //ScriptStruct AkAudio.AkPluginInfo
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString Name; // 0x0
        uint32_t PluginID; // 0x10
        struct FString dll; // 0x18

    };

    struct FAkCommonInitializationSettings //ScriptStruct AkAudio.AkCommonInitializationSettings
    {
    //Children Prop Count (Fields): 8
    public:

        uint32_t MaximumNumberOfMemoryPools; // 0x0
        uint32_t MaximumNumberOfPositioningPaths; // 0x4
        uint32_t CommandQueueSize; // 0x8
        uint32_t SamplesPerFrame; // 0xc
        struct FAkMainOutputSettings MainOutputSettings; // 0x10
        float StreamingLookAheadRatio; // 0x38
        uint16_t NumberOfRefillsInVoice; // 0x3c
        struct FAkSpatialAudioSettings SpatialAudioSettings; // 0x40

    };

    struct FAkSpatialAudioSettings //ScriptStruct AkAudio.AkSpatialAudioSettings
    {
    //Children Prop Count (Fields): 11
    public:

        uint32_t MaxSoundPropagationDepth; // 0x0
        float MovementThreshold; // 0x4
        uint32_t NumberOfPrimaryRays; // 0x8
        uint32_t ReflectionOrder; // 0xc
        float MaximumPathLength; // 0x10
        float CPULimitPercentage; // 0x14
        bool EnableDiffractionOnReflections; // 0x18
        bool EnableGeometricDiffractionAndTransmission; // 0x19
        bool CalcEmitterVirtualPosition; // 0x1a
        bool UseObstruction; // 0x1b
        bool UseOcclusion; // 0x1c

    };

    struct FAkMainOutputSettings //ScriptStruct AkAudio.AkMainOutputSettings
    {
    //Children Prop Count (Fields): 6
    public:

        struct FString AudioDeviceShareset; // 0x0
        uint32_t DeviceID; // 0x10
        enum class EAkPanningRule PanningRule; // 0x14
        enum class EAkChannelConfigType ChannelConfigType; // 0x18
        uint32_t ChannelMask; // 0x1c
        uint32_t NumberOfChannels; // 0x20

    };

    struct FAkCommonInitializationSettingsWithSampleRate : FAkCommonInitializationSettings //ScriptStruct AkAudio.AkCommonInitializationSettingsWithSampleRate
    {
    //Children Prop Count (Fields): 1
    public:

        uint32_t SampleRate; // 0x60

    };

    struct FAkCommunicationSettings //ScriptStruct AkAudio.AkCommunicationSettings
    {
    //Children Prop Count (Fields): 5
    public:

        uint32_t PoolSize; // 0x0
        uint16_t DiscoveryBroadcastPort; // 0x4
        uint16_t CommandPort; // 0x6
        uint16_t NotificationPort; // 0x8
        struct FString NetworkName; // 0x10

    };

    struct FAkCommunicationSettingsWithCommSelection : FAkCommunicationSettings //ScriptStruct AkAudio.AkCommunicationSettingsWithCommSelection
    {
    //Children Prop Count (Fields): 1
    public:

        enum class EAkCommSystem CommunicationSystem; // 0x20

    };

    struct FAkCommunicationSettingsWithSystemInitialization : FAkCommunicationSettings //ScriptStruct AkAudio.AkCommunicationSettingsWithSystemInitialization
    {
    //Children Prop Count (Fields): 1
    public:

        bool InitializeSystemComms; // 0x20

    };

    struct FAkBoolPropertyToControl //ScriptStruct AkAudio.AkBoolPropertyToControl
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString ItemProperty; // 0x0

    };

    struct FAkPropertyToControl //ScriptStruct AkAudio.AkPropertyToControl
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString ItemProperty; // 0x0

    };

    struct FAkPS4AdvancedInitializationSettings : FAkAdvancedInitializationSettingsWithMultiCoreRendering //ScriptStruct AkAudio.AkPS4AdvancedInitializationSettings
    {
    //Children Prop Count (Fields): 2
    public:

        uint32_t ACPBatchBufferSize; // 0x30
        bool UseHardwareCodecLowLatencyMode; // 0x34

    };

    struct FAkReverbDescriptor //ScriptStruct AkAudio.AkReverbDescriptor
    {
    public:


    };

    struct FAkAcousticTextureParams //ScriptStruct AkAudio.AkAcousticTextureParams
    {
    //Children Prop Count (Fields): 1
    public:

        struct FVector4 AbsorptionValues; // 0x0

    };

    struct FAkGeometrySurfacePropertiesToMap //ScriptStruct AkAudio.AkGeometrySurfacePropertiesToMap
    {
    //Children Prop Count (Fields): 2
    public:

        struct TSoftObjectPtr<UAkAcousticTexture> AcousticTexture; // 0x0
        float OcclusionValue; // 0x28

    };

    struct FAkWwiseItemToControl //ScriptStruct AkAudio.AkWwiseItemToControl
    {
    //Children Prop Count (Fields): 2
    public:

        struct FAkWwiseObjectDetails ItemPicked; // 0x0
        struct FString ItemPath; // 0x30

    };

    struct FAkWwiseObjectDetails //ScriptStruct AkAudio.AkWwiseObjectDetails
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString ItemName; // 0x0
        struct FString ItemPath; // 0x10
        struct FString ItemId; // 0x20

    };

    struct FAkSurfaceProperties //ScriptStruct AkAudio.AkSurfaceProperties
    {
    public:


    };

    struct FAkEdgeInfo //ScriptStruct AkAudio.AkEdgeInfo
    {
    public:


    };

    struct FAkPoly //ScriptStruct AkAudio.AkPoly
    {
    //Children Prop Count (Fields): 4
    public:

        class UAkAcousticTexture* Texture; // 0x0
        float Occlusion; // 0x8
        bool EnableSurface; // 0xc
        float SurfaceArea; // 0x10

    };

    struct FAkWaapiFieldNames //ScriptStruct AkAudio.AkWaapiFieldNames
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString FieldName; // 0x0

    };

    struct FAkWaapiUri //ScriptStruct AkAudio.AkWaapiUri
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString Uri; // 0x0

    };

    struct FAkWindowsAdvancedInitializationSettings : FAkAdvancedInitializationSettingsWithMultiCoreRendering //ScriptStruct AkAudio.AkWindowsAdvancedInitializationSettings
    {
    //Children Prop Count (Fields): 2
    public:

        bool UseHeadMountedDisplayAudioDevice; // 0x30
        uint32_t MaxSystemAudioObjects; // 0x34

    };

    struct FAkXboxOneApuHeapInitializationSettings //ScriptStruct AkAudio.AkXboxOneApuHeapInitializationSettings
    {
    //Children Prop Count (Fields): 2
    public:

        uint32_t CachedSize; // 0x0
        uint32_t NonCachedSize; // 0x4

    };

    struct FAkXboxOneAdvancedInitializationSettings : FAkAdvancedInitializationSettingsWithMultiCoreRendering //ScriptStruct AkAudio.AkXboxOneAdvancedInitializationSettings
    {
    //Children Prop Count (Fields): 2
    public:

        uint16_t MaximumNumberOfXMAVoices; // 0x30
        bool UseHardwareCodecLowLatencyMode; // 0x32

    };

    struct FAkAudioEventTrackKey //ScriptStruct AkAudio.AkAudioEventTrackKey
    {
    //Children Prop Count (Fields): 3
    public:

        float Time; // 0x0
        class UAkAudioEvent* AkAudioEvent; // 0x8
        struct FString EventName; // 0x10

    };

    struct FMovieSceneEvalTemplateBase //ScriptStruct MovieScene.MovieSceneEvalTemplateBase
    {
    public:


    };

    struct FMovieSceneEvalTemplate : FMovieSceneEvalTemplateBase //ScriptStruct MovieScene.MovieSceneEvalTemplate
    {
    //Children Prop Count (Fields): 2
    public:

        enum class EMovieSceneCompletionMode CompletionMode; // 0x10
        struct TWeakObjectPtr<struct UMovieSceneSection> SourceSectionPtr; // 0x14

    };

    struct FMovieSceneAkAudioEventTemplate : FMovieSceneEvalTemplate //ScriptStruct AkAudio.MovieSceneAkAudioEventTemplate
    {
    //Children Prop Count (Fields): 1
    public:

        class UMovieSceneAkAudioEventSection* Section; // 0x20

    };

    struct FMovieSceneAkAudioRTPCTemplate : FMovieSceneEvalTemplate //ScriptStruct AkAudio.MovieSceneAkAudioRTPCTemplate
    {
    //Children Prop Count (Fields): 1
    public:

        class UMovieSceneAkAudioRTPCSection* Section; // 0x20

    };

    struct FMovieSceneFloatChannelSerializationHelper //ScriptStruct AkAudio.MovieSceneFloatChannelSerializationHelper
    {
    //Children Prop Count (Fields): 6
    public:

        enum class ERichCurveExtrapolation PreInfinityExtrap; // 0x0
        enum class ERichCurveExtrapolation PostInfinityExtrap; // 0x1
        struct TArray<int32_t> Times; // 0x8
        struct TArray<struct FMovieSceneFloatValueSerializationHelper> Values; // 0x18
        float DefaultValue; // 0x28
        bool bHasDefaultValue; // 0x2c

    };

    struct FMovieSceneFloatValueSerializationHelper //ScriptStruct AkAudio.MovieSceneFloatValueSerializationHelper
    {
    //Children Prop Count (Fields): 4
    public:

        float Value; // 0x0
        enum class ERichCurveInterpMode InterpMode; // 0x4
        enum class ERichCurveTangentMode TangentMode; // 0x5
        struct FMovieSceneTangentDataSerializationHelper Tangent; // 0x8

    };

    struct FMovieSceneTangentDataSerializationHelper //ScriptStruct AkAudio.MovieSceneTangentDataSerializationHelper
    {
    //Children Prop Count (Fields): 5
    public:

        float ArriveTangent; // 0x0
        float LeaveTangent; // 0x4
        enum class ERichCurveTangentWeightMode TangentWeightMode; // 0x8
        float ArriveTangentWeight; // 0xc
        float LeaveTangentWeight; // 0x10

    };

    struct FIntMargin //ScriptStruct Paper2D.IntMargin
    {
    //Children Prop Count (Fields): 4
    public:

        int32_t Left; // 0x0
        int32_t Top; // 0x4
        int32_t Right; // 0x8
        int32_t Bottom; // 0xc

    };

    struct FPaperFlipbookKeyFrame //ScriptStruct Paper2D.PaperFlipbookKeyFrame
    {
    //Children Prop Count (Fields): 2
    public:

        class UPaperSprite* Sprite; // 0x0
        int32_t FrameRun; // 0x8

    };

    struct FSpriteInstanceData //ScriptStruct Paper2D.SpriteInstanceData
    {
    //Children Prop Count (Fields): 4
    public:

        struct FMatrix Transform; // 0x0
        class UPaperSprite* SourceSprite; // 0x40
        struct FColor VertexColor; // 0x48
        int32_t MaterialIndex; // 0x4c

    };

    struct FPaperSpriteSocket //ScriptStruct Paper2D.PaperSpriteSocket
    {
    //Children Prop Count (Fields): 2
    public:

        struct FTransform LocalTransform; // 0x0
        struct FName SocketName; // 0x30

    };

    struct FPaperSpriteAtlasSlot //ScriptStruct Paper2D.PaperSpriteAtlasSlot
    {
    //Children Prop Count (Fields): 6
    public:

        struct TSoftObjectPtr<UPaperSprite> SpriteRef; // 0x0
        int32_t AtlasIndex; // 0x28
        int32_t X; // 0x2c
        int32_t Y; // 0x30
        int32_t Width; // 0x34
        int32_t Height; // 0x38

    };

    struct FPaperTerrainMaterialRule //ScriptStruct Paper2D.PaperTerrainMaterialRule
    {
    //Children Prop Count (Fields): 8
    public:

        class UPaperSprite* StartCap; // 0x0
        struct TArray<class UPaperSprite*> Body; // 0x8
        class UPaperSprite* EndCap; // 0x18
        float MinimumAngle; // 0x20
        float MaximumAngle; // 0x24
        bool bEnableCollision; // 0x28
        float CollisionOffset; // 0x2c
        int32_t DrawOrder; // 0x30

    };

    struct FPaperTileInfo //ScriptStruct Paper2D.PaperTileInfo
    {
    //Children Prop Count (Fields): 2
    public:

        class UPaperTileSet* TileSet; // 0x0
        int32_t PackedTileIndex; // 0x8

    };

    struct FPaperTileSetTerrain //ScriptStruct Paper2D.PaperTileSetTerrain
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString TerrainName; // 0x0
        int32_t CenterTileIndex; // 0x10

    };

    struct FPaperTileMetadata //ScriptStruct Paper2D.PaperTileMetadata
    {
    //Children Prop Count (Fields): 3
    public:

        struct FName UserDataName; // 0x0
        struct FSpriteGeometryCollection CollisionData; // 0x8
        char TerrainMembership; // 0x38

    };

    struct FSpriteGeometryCollection //ScriptStruct Paper2D.SpriteGeometryCollection
    {
    //Children Prop Count (Fields): 8
    public:

        struct TArray<struct FSpriteGeometryShape> Shapes; // 0x0
        enum class ESpritePolygonMode GeometryType; // 0x10
        int32_t PixelsPerSubdivisionX; // 0x14
        int32_t PixelsPerSubdivisionY; // 0x18
        bool bAvoidVertexMerging; // 0x1c
        float AlphaThreshold; // 0x20
        float DetailAmount; // 0x24
        float SimplifyEpsilon; // 0x28

    };

    struct FSpriteGeometryShape //ScriptStruct Paper2D.SpriteGeometryShape
    {
    //Children Prop Count (Fields): 6
    public:

        enum class ESpriteShapeType ShapeType; // 0x0
        struct TArray<struct FVector2D> Vertices; // 0x8
        struct FVector2D BoxSize; // 0x18
        struct FVector2D BoxPosition; // 0x20
        float Rotation; // 0x28
        bool bNegativeWinding; // 0x2c

    };

    struct FSpriteDrawCallRecord //ScriptStruct Paper2D.SpriteDrawCallRecord
    {
    //Children Prop Count (Fields): 3
    public:

        struct FVector Destination; // 0x0
        class UTexture* BaseTexture; // 0x10
        struct FColor Color; // 0x48

    };

    struct FSpriteAssetInitParameters //ScriptStruct Paper2D.SpriteAssetInitParameters
    {
    public:


    };

    struct FTickAnimationSharingFunction : FTickFunction //ScriptStruct AnimationSharing.TickAnimationSharingFunction
    {
    public:


    };

    struct FAnimationSharingScalability //ScriptStruct AnimationSharing.AnimationSharingScalability
    {
    //Children Prop Count (Fields): 4
    public:

        struct FPerPlatformBool UseBlendTransitions; // 0x0
        struct FPerPlatformFloat BlendSignificanceValue; // 0x4
        struct FPerPlatformInt MaximumNumberConcurrentBlends; // 0x8
        struct FPerPlatformFloat TickSignificanceValue; // 0xc

    };

    struct FPerPlatformFloat //ScriptStruct Engine.PerPlatformFloat
    {
    //Children Prop Count (Fields): 1
    public:

        float Default; // 0x0

    };

    struct FPerPlatformInt //ScriptStruct Engine.PerPlatformInt
    {
    //Children Prop Count (Fields): 1
    public:

        int32_t Default; // 0x0

    };

    struct FPerPlatformBool //ScriptStruct Engine.PerPlatformBool
    {
    //Children Prop Count (Fields): 1
    public:

        bool Default; // 0x0

    };

    struct FPerSkeletonAnimationSharingSetup //ScriptStruct AnimationSharing.PerSkeletonAnimationSharingSetup
    {
    //Children Prop Count (Fields): 6
    public:

        class USkeleton* Skeleton; // 0x0
        class USkeletalMesh* SkeletalMesh; // 0x8
        class UAnimSharingTransitionInstance* BlendAnimBlueprint; // 0x10
        class UAnimSharingAdditiveInstance* AdditiveAnimBlueprint; // 0x18
        class UAnimationSharingStateProcessor* StateProcessorClass; // 0x20
        struct TArray<struct FAnimationStateEntry> AnimationStates; // 0x28

    };

    struct FAnimationStateEntry //ScriptStruct AnimationSharing.AnimationStateEntry
    {
    //Children Prop Count (Fields): 11
    public:

        char State; // 0x0
        struct TArray<struct FAnimationSetup> AnimationSetups; // 0x8
        bool bOnDemand; // 0x18
        bool bAdditive; // 0x19
        float BlendTime; // 0x1c
        bool bReturnToPreviousState; // 0x20
        bool bSetNextState; // 0x21
        char NextState; // 0x22
        struct FPerPlatformInt MaximumNumberOfConcurrentInstances; // 0x24
        float WiggleTimePercentage; // 0x28
        bool bRequiresCurves; // 0x2c

    };

    struct FAnimationSetup //ScriptStruct AnimationSharing.AnimationSetup
    {
    //Children Prop Count (Fields): 4
    public:

        class UAnimSequence* AnimSequence; // 0x0
        class UAnimSharingStateInstance* AnimBlueprint; // 0x8
        struct FPerPlatformInt NumRandomizedInstances; // 0x10
        struct FPerPlatformBool Enabled; // 0x14

    };

    struct FMyPluginStruct //ScriptStruct UObjectPlugin.MyPluginStruct
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString TestString; // 0x0

    };

    struct FDatasmithCameraLookatTrackingSettingsTemplate //ScriptStruct DatasmithContent.DatasmithCameraLookatTrackingSettingsTemplate
    {
    //Children Prop Count (Fields): 3
    public:

        char bEnableLookAtTracking; // 0x0
        char bAllowRoll; // 0x0
        struct TSoftObjectPtr<AActor> ActorToTrack; // 0x8

    };

    struct FDatasmithPostProcessSettingsTemplate //ScriptStruct DatasmithContent.DatasmithPostProcessSettingsTemplate
    {
    //Children Prop Count (Fields): 16
    public:

        char bOverride_WhiteTemp; // 0x0
        char bOverride_ColorSaturation; // 0x0
        char bOverride_VignetteIntensity; // 0x0
        char bOverride_FilmWhitePoint; // 0x0
        char bOverride_AutoExposureMethod; // 0x0
        char bOverride_CameraISO; // 0x0
        char bOverride_CameraShutterSpeed; // 0x0
        char bOverride_DepthOfFieldFstop; // 0x4
        float WhiteTemp; // 0x8
        float VignetteIntensity; // 0xc
        struct FLinearColor FilmWhitePoint; // 0x10
        struct FVector4 ColorSaturation; // 0x20
        enum class EAutoExposureMethod AutoExposureMethod; // 0x30
        float CameraISO; // 0x34
        float CameraShutterSpeed; // 0x38
        float DepthOfFieldFstop; // 0x3c

    };

    struct FDatasmithCameraFocusSettingsTemplate //ScriptStruct DatasmithContent.DatasmithCameraFocusSettingsTemplate
    {
    //Children Prop Count (Fields): 2
    public:

        enum class ECameraFocusMethod FocusMethod; // 0x0
        float ManualFocusDistance; // 0x4

    };

    struct FDatasmithCameraLensSettingsTemplate //ScriptStruct DatasmithContent.DatasmithCameraLensSettingsTemplate
    {
    //Children Prop Count (Fields): 1
    public:

        float MaxFStop; // 0x0

    };

    struct FDatasmithCameraFilmbackSettingsTemplate //ScriptStruct DatasmithContent.DatasmithCameraFilmbackSettingsTemplate
    {
    //Children Prop Count (Fields): 2
    public:

        float SensorWidth; // 0x0
        float SensorHeight; // 0x4

    };

    struct FDatasmithTessellationOptions //ScriptStruct DatasmithContent.DatasmithTessellationOptions
    {
    //Children Prop Count (Fields): 4
    public:

        float ChordTolerance; // 0x0
        float MaxEdgeLength; // 0x4
        float NormalTolerance; // 0x8
        enum class EDatasmithCADStitchingTechnique StitchingTechnique; // 0xc

    };

    struct FDatasmithImportBaseOptions //ScriptStruct DatasmithContent.DatasmithImportBaseOptions
    {
    //Children Prop Count (Fields): 8
    public:

        enum class EDatasmithImportScene SceneHandling; // 0x0
        bool bIncludeGeometry; // 0x1
        bool bIncludeMaterial; // 0x2
        bool bIncludeLight; // 0x3
        bool bIncludeCamera; // 0x4
        bool bIncludeAnimation; // 0x5
        struct FDatasmithAssetImportOptions AssetOptions; // 0x8
        struct FDatasmithStaticMeshImportOptions StaticMeshOptions; // 0x10

    };

    struct FDatasmithStaticMeshImportOptions //ScriptStruct DatasmithContent.DatasmithStaticMeshImportOptions
    {
    //Children Prop Count (Fields): 4
    public:

        enum class EDatasmithImportLightmapMin MinLightmapResolution; // 0x0
        enum class EDatasmithImportLightmapMax MaxLightmapResolution; // 0x1
        bool bGenerateLightmapUVs; // 0x2
        bool bRemoveDegenerates; // 0x3

    };

    struct FDatasmithAssetImportOptions //ScriptStruct DatasmithContent.DatasmithAssetImportOptions
    {
    //Children Prop Count (Fields): 1
    public:

        struct FName PackagePath; // 0x0

    };

    struct FDatasmithReimportOptions //ScriptStruct DatasmithContent.DatasmithReimportOptions
    {
    //Children Prop Count (Fields): 2
    public:

        bool bUpdateActors; // 0x0
        bool bRespawnDeletedActors; // 0x1

    };

    struct FDatasmithStaticParameterSetTemplate //ScriptStruct DatasmithContent.DatasmithStaticParameterSetTemplate
    {
    //Children Prop Count (Fields): 1
    public:

        struct TMap<struct FName, bool> StaticSwitchParameters; // 0x0

    };

    struct FDatasmithMeshSectionInfoMapTemplate //ScriptStruct DatasmithContent.DatasmithMeshSectionInfoMapTemplate
    {
    //Children Prop Count (Fields): 1
    public:

        struct TMap<uint32_t, struct FDatasmithMeshSectionInfoTemplate> Map; // 0x0

    };

    struct FDatasmithMeshSectionInfoTemplate //ScriptStruct DatasmithContent.DatasmithMeshSectionInfoTemplate
    {
    //Children Prop Count (Fields): 1
    public:

        int32_t MaterialIndex; // 0x0

    };

    struct FDatasmithStaticMaterialTemplate //ScriptStruct DatasmithContent.DatasmithStaticMaterialTemplate
    {
    //Children Prop Count (Fields): 2
    public:

        struct FName MaterialSlotName; // 0x0
        class UMaterialInterface* MaterialInterface; // 0x8

    };

    struct FDatasmithMeshBuildSettingsTemplate //ScriptStruct DatasmithContent.DatasmithMeshBuildSettingsTemplate
    {
    //Children Prop Count (Fields): 11
    public:

        char bUseMikkTSpace; // 0x0
        char bRecomputeNormals; // 0x0
        char bRecomputeTangents; // 0x0
        char bRemoveDegenerates; // 0x0
        char bBuildAdjacencyBuffer; // 0x0
        char bUseHighPrecisionTangentBasis; // 0x0
        char bUseFullPrecisionUVs; // 0x0
        char bGenerateLightmapUVs; // 0x0
        int32_t MinLightmapResolution; // 0x4
        int32_t SrcLightmapIndex; // 0x8
        int32_t DstLightmapIndex; // 0xc

    };

    struct FFunctionCaller //ScriptStruct VariantManagerContent.FunctionCaller
    {
    //Children Prop Count (Fields): 1
    public:

        struct FName FunctionName; // 0x0

    };

    struct FCapturedPropSegment //ScriptStruct VariantManagerContent.CapturedPropSegment
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString PropertyName; // 0x0
        int32_t PropertyIndex; // 0x10
        struct FString ComponentName; // 0x18

    };

    struct FTrackRenderData //ScriptStruct GeometryCache.TrackRenderData
    {
    public:


    };

    struct FGeometryCacheMeshData //ScriptStruct GeometryCache.GeometryCacheMeshData
    {
    public:


    };

    struct FGeometryCacheVertexInfo //ScriptStruct GeometryCache.GeometryCacheVertexInfo
    {
    public:


    };

    struct FGeometryCacheMeshBatchInfo //ScriptStruct GeometryCache.GeometryCacheMeshBatchInfo
    {
    public:


    };

    struct FMovieSceneGeometryCacheParams //ScriptStruct GeometryCacheTracks.MovieSceneGeometryCacheParams
    {
    //Children Prop Count (Fields): 9
    public:

        class UGeometryCache* GeometryCacheAsset; // 0x0
        struct FFrameNumber FirstLoopStartFrameOffset; // 0x8
        struct FFrameNumber StartFrameOffset; // 0xc
        struct FFrameNumber EndFrameOffset; // 0x10
        float PlayRate; // 0x14
        char bReverse; // 0x18
        float StartOffset; // 0x1c
        float EndOffset; // 0x20
        struct FSoftObjectPath GeometryCache; // 0x28

    };

    struct FMovieSceneGeometryCacheSectionTemplate : FMovieSceneEvalTemplate //ScriptStruct GeometryCacheTracks.MovieSceneGeometryCacheSectionTemplate
    {
    //Children Prop Count (Fields): 1
    public:

        struct FMovieSceneGeometryCacheSectionTemplateParameters Params; // 0x20

    };

    struct FMovieSceneGeometryCacheSectionTemplateParameters : FMovieSceneGeometryCacheParams //ScriptStruct GeometryCacheTracks.MovieSceneGeometryCacheSectionTemplateParameters
    {
    //Children Prop Count (Fields): 2
    public:

        struct FFrameNumber SectionStartTime; // 0x40
        struct FFrameNumber SectionEndTime; // 0x44

    };

    struct FAdaptorPolygon2Group //ScriptStruct EditableMesh.AdaptorPolygon2Group
    {
    //Children Prop Count (Fields): 3
    public:

        uint32_t RenderingSectionIndex; // 0x0
        int32_t MaterialIndex; // 0x4
        int32_t MaxTriangles; // 0x8

    };

    struct FAdaptorPolygon //ScriptStruct EditableMesh.AdaptorPolygon
    {
    //Children Prop Count (Fields): 2
    public:

        struct FPolygonGroupID PolygonGroupID; // 0x0
        struct TArray<struct FAdaptorTriangleID> TriangulatedPolygonTriangleIndices; // 0x8

    };

    struct FElementID //ScriptStruct MeshDescription.ElementID
    {
    //Children Prop Count (Fields): 1
    public:

        int32_t IDValue; // 0x0

    };

    struct FAdaptorTriangleID : FElementID //ScriptStruct EditableMesh.AdaptorTriangleID
    {
    public:


    };

    struct FPolygonGroupID : FElementID //ScriptStruct MeshDescription.PolygonGroupID
    {
    public:


    };

    struct FPolygonGroupForPolygon //ScriptStruct EditableMesh.PolygonGroupForPolygon
    {
    //Children Prop Count (Fields): 2
    public:

        struct FPolygonID PolygonID; // 0x0
        struct FPolygonGroupID PolygonGroupID; // 0x4

    };

    struct FPolygonID : FElementID //ScriptStruct MeshDescription.PolygonID
    {
    public:


    };

    struct FPolygonGroupToCreate //ScriptStruct EditableMesh.PolygonGroupToCreate
    {
    //Children Prop Count (Fields): 2
    public:

        struct FMeshElementAttributeList PolygonGroupAttributes; // 0x0
        struct FPolygonGroupID OriginalPolygonGroupID; // 0x10

    };

    struct FMeshElementAttributeList //ScriptStruct EditableMesh.MeshElementAttributeList
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<struct FMeshElementAttributeData> Attributes; // 0x0

    };

    struct FMeshElementAttributeData //ScriptStruct EditableMesh.MeshElementAttributeData
    {
    //Children Prop Count (Fields): 3
    public:

        struct FName AttributeName; // 0x0
        int32_t AttributeIndex; // 0x8
        struct FMeshElementAttributeValue AttributeValue; // 0x10

    };

    struct FMeshElementAttributeValue //ScriptStruct EditableMesh.MeshElementAttributeValue
    {
    public:


    };

    struct FVertexToMove //ScriptStruct EditableMesh.VertexToMove
    {
    //Children Prop Count (Fields): 2
    public:

        struct FVertexID VertexID; // 0x0
        struct FVector NewVertexPosition; // 0x4

    };

    struct FVertexID : FElementID //ScriptStruct MeshDescription.VertexID
    {
    public:


    };

    struct FChangeVertexInstancesForPolygon //ScriptStruct EditableMesh.ChangeVertexInstancesForPolygon
    {
    //Children Prop Count (Fields): 3
    public:

        struct FPolygonID PolygonID; // 0x0
        struct TArray<struct FVertexIndexAndInstanceID> PerimeterVertexIndicesAndInstanceIDs; // 0x8
        struct TArray<struct FVertexInstancesForPolygonHole> VertexIndicesAndInstanceIDsForEachHole; // 0x18

    };

    struct FVertexInstancesForPolygonHole //ScriptStruct EditableMesh.VertexInstancesForPolygonHole
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<struct FVertexIndexAndInstanceID> VertexIndicesAndInstanceIDs; // 0x0

    };

    struct FVertexIndexAndInstanceID //ScriptStruct EditableMesh.VertexIndexAndInstanceID
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t ContourIndex; // 0x0
        struct FVertexInstanceID VertexInstanceID; // 0x4

    };

    struct FVertexInstanceID : FElementID //ScriptStruct MeshDescription.VertexInstanceID
    {
    public:


    };

    struct FVertexAttributesForPolygon //ScriptStruct EditableMesh.VertexAttributesForPolygon
    {
    //Children Prop Count (Fields): 3
    public:

        struct FPolygonID PolygonID; // 0x0
        struct TArray<struct FMeshElementAttributeList> PerimeterVertexAttributeLists; // 0x8
        struct TArray<struct FVertexAttributesForPolygonHole> VertexAttributeListsForEachHole; // 0x18

    };

    struct FVertexAttributesForPolygonHole //ScriptStruct EditableMesh.VertexAttributesForPolygonHole
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<struct FMeshElementAttributeList> VertexAttributeList; // 0x0

    };

    struct FAttributesForEdge //ScriptStruct EditableMesh.AttributesForEdge
    {
    //Children Prop Count (Fields): 2
    public:

        struct FEdgeID EdgeID; // 0x0
        struct FMeshElementAttributeList EdgeAttributes; // 0x8

    };

    struct FEdgeID : FElementID //ScriptStruct MeshDescription.EdgeID
    {
    public:


    };

    struct FAttributesForVertexInstance //ScriptStruct EditableMesh.AttributesForVertexInstance
    {
    //Children Prop Count (Fields): 2
    public:

        struct FVertexInstanceID VertexInstanceID; // 0x0
        struct FMeshElementAttributeList VertexInstanceAttributes; // 0x8

    };

    struct FAttributesForVertex //ScriptStruct EditableMesh.AttributesForVertex
    {
    //Children Prop Count (Fields): 2
    public:

        struct FVertexID VertexID; // 0x0
        struct FMeshElementAttributeList VertexAttributes; // 0x8

    };

    struct FPolygonToSplit //ScriptStruct EditableMesh.PolygonToSplit
    {
    //Children Prop Count (Fields): 2
    public:

        struct FPolygonID PolygonID; // 0x0
        struct TArray<struct FVertexPair> VertexPairsToSplitAt; // 0x8

    };

    struct FVertexPair //ScriptStruct EditableMesh.VertexPair
    {
    //Children Prop Count (Fields): 2
    public:

        struct FVertexID VertexID0; // 0x0
        struct FVertexID VertexID1; // 0x4

    };

    struct FPolygonToCreate //ScriptStruct EditableMesh.PolygonToCreate
    {
    //Children Prop Count (Fields): 4
    public:

        struct FPolygonGroupID PolygonGroupID; // 0x0
        struct TArray<struct FVertexAndAttributes> PerimeterVertices; // 0x8
        struct FPolygonID OriginalPolygonID; // 0x18
        enum class EPolygonEdgeHardness PolygonEdgeHardness; // 0x1c

    };

    struct FVertexAndAttributes //ScriptStruct EditableMesh.VertexAndAttributes
    {
    //Children Prop Count (Fields): 3
    public:

        struct FVertexInstanceID VertexInstanceID; // 0x0
        struct FVertexID VertexID; // 0x4
        struct FMeshElementAttributeList PolygonVertexAttributes; // 0x8

    };

    struct FEdgeToCreate //ScriptStruct EditableMesh.EdgeToCreate
    {
    //Children Prop Count (Fields): 4
    public:

        struct FVertexID VertexID0; // 0x0
        struct FVertexID VertexID1; // 0x4
        struct FMeshElementAttributeList EdgeAttributes; // 0x8
        struct FEdgeID OriginalEdgeID; // 0x18

    };

    struct FVertexInstanceToCreate //ScriptStruct EditableMesh.VertexInstanceToCreate
    {
    //Children Prop Count (Fields): 3
    public:

        struct FVertexID VertexID; // 0x0
        struct FMeshElementAttributeList VertexInstanceAttributes; // 0x8
        struct FVertexInstanceID OriginalVertexInstanceID; // 0x18

    };

    struct FVertexToCreate //ScriptStruct EditableMesh.VertexToCreate
    {
    //Children Prop Count (Fields): 2
    public:

        struct FMeshElementAttributeList VertexAttributes; // 0x0
        struct FVertexID OriginalVertexID; // 0x10

    };

    struct FSubdivisionLimitData //ScriptStruct EditableMesh.SubdivisionLimitData
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<struct FVector> VertexPositions; // 0x0
        struct TArray<struct FSubdivisionLimitSection> Sections; // 0x10
        struct TArray<struct FSubdividedWireEdge> SubdividedWireEdges; // 0x20

    };

    struct FSubdividedWireEdge //ScriptStruct EditableMesh.SubdividedWireEdge
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t EdgeVertex0PositionIndex; // 0x0
        int32_t EdgeVertex1PositionIndex; // 0x4

    };

    struct FSubdivisionLimitSection //ScriptStruct EditableMesh.SubdivisionLimitSection
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<struct FSubdividedQuad> SubdividedQuads; // 0x0

    };

    struct FSubdividedQuad //ScriptStruct EditableMesh.SubdividedQuad
    {
    //Children Prop Count (Fields): 4
    public:

        struct FSubdividedQuadVertex QuadVertex0; // 0x0
        struct FSubdividedQuadVertex QuadVertex1; // 0x34
        struct FSubdividedQuadVertex QuadVertex2; // 0x68
        struct FSubdividedQuadVertex QuadVertex3; // 0x9c

    };

    struct FSubdividedQuadVertex //ScriptStruct EditableMesh.SubdividedQuadVertex
    {
    //Children Prop Count (Fields): 7
    public:

        int32_t VertexPositionIndex; // 0x0
        struct FVector2D TextureCoordinate0; // 0x4
        struct FVector2D TextureCoordinate1; // 0xc
        struct FColor VertexColor; // 0x14
        struct FVector VertexNormal; // 0x18
        struct FVector VertexTangent; // 0x24
        float VertexBinormalSign; // 0x30

    };

    struct FRenderingPolygonGroup //ScriptStruct EditableMesh.RenderingPolygonGroup
    {
    //Children Prop Count (Fields): 3
    public:

        uint32_t RenderingSectionIndex; // 0x0
        int32_t MaterialIndex; // 0x4
        int32_t MaxTriangles; // 0x8

    };

    struct FRenderingPolygon //ScriptStruct EditableMesh.RenderingPolygon
    {
    //Children Prop Count (Fields): 2
    public:

        struct FPolygonGroupID PolygonGroupID; // 0x0
        struct TArray<struct FTriangleID> TriangulatedPolygonTriangleIndices; // 0x8

    };

    struct FTriangleID : FElementID //ScriptStruct MeshDescription.TriangleID
    {
    public:


    };

    struct FMovieSceneGeometryCollectionParams //ScriptStruct GeometryCollectionTracks.MovieSceneGeometryCollectionParams
    {
    //Children Prop Count (Fields): 4
    public:

        struct FSoftObjectPath GeometryCollectionCache; // 0x8
        struct FFrameNumber StartFrameOffset; // 0x20
        struct FFrameNumber EndFrameOffset; // 0x24
        float PlayRate; // 0x28

    };

    struct FMovieSceneGeometryCollectionSectionTemplate : FMovieSceneEvalTemplate //ScriptStruct GeometryCollectionTracks.MovieSceneGeometryCollectionSectionTemplate
    {
    //Children Prop Count (Fields): 1
    public:

        struct FMovieSceneGeometryCollectionSectionTemplateParameters Params; // 0x20

    };

    struct FMovieSceneGeometryCollectionSectionTemplateParameters : FMovieSceneGeometryCollectionParams //ScriptStruct GeometryCollectionTracks.MovieSceneGeometryCollectionSectionTemplateParameters
    {
    //Children Prop Count (Fields): 2
    public:

        struct FFrameNumber SectionStartTime; // 0x30
        struct FFrameNumber SectionEndTime; // 0x34

    };

    struct FChaosDestructionEvent //ScriptStruct ChaosNiagara.ChaosDestructionEvent
    {
    //Children Prop Count (Fields): 9
    public:

        struct FVector Position; // 0x0
        struct FVector Normal; // 0xc
        struct FVector Velocity; // 0x18
        struct FVector AngularVelocity; // 0x24
        float ExtentMin; // 0x30
        float ExtentMax; // 0x34
        int32_t ParticleID; // 0x38
        float Time; // 0x3c
        int32_t Type; // 0x40

    };

    struct FNiagaraCompileHash //ScriptStruct NiagaraCore.NiagaraCompileHash
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<char> DataHash; // 0x0

    };

    struct FMovieSceneNiagaraParameterSectionTemplate : FMovieSceneEvalTemplate //ScriptStruct Niagara.MovieSceneNiagaraParameterSectionTemplate
    {
    //Children Prop Count (Fields): 1
    public:

        struct FNiagaraVariable Parameter; // 0x20

    };

    struct FNiagaraVariableBase //ScriptStruct Niagara.NiagaraVariableBase
    {
    //Children Prop Count (Fields): 2
    public:

        struct FName Name; // 0x0
        struct FNiagaraTypeDefinition TypeDef; // 0x8

    };

    struct FNiagaraTypeDefinition //ScriptStruct Niagara.NiagaraTypeDefinition
    {
    //Children Prop Count (Fields): 2
    public:

        class UObject* ClassStructOrEnum; // 0x0
        uint16_t UnderlyingType; // 0x8

    };

    struct FNiagaraVariable : FNiagaraVariableBase //ScriptStruct Niagara.NiagaraVariable
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<char> VarData; // 0x18

    };

    struct FMovieSceneNiagaraBoolParameterSectionTemplate : FMovieSceneNiagaraParameterSectionTemplate //ScriptStruct Niagara.MovieSceneNiagaraBoolParameterSectionTemplate
    {
    //Children Prop Count (Fields): 1
    public:

        struct FMovieSceneBoolChannel BoolChannel; // 0x48

    };

    struct FMovieSceneChannel //ScriptStruct MovieScene.MovieSceneChannel
    {
    public:


    };

    struct FMovieSceneBoolChannel : FMovieSceneChannel //ScriptStruct MovieScene.MovieSceneBoolChannel
    {
    //Children Prop Count (Fields): 4
    public:

        struct TArray<struct FFrameNumber> Times; // 0x8
        bool DefaultValue; // 0x18
        bool bHasDefaultValue; // 0x19
        struct TArray<bool> Values; // 0x20

    };

    struct FMovieSceneNiagaraColorParameterSectionTemplate : FMovieSceneNiagaraParameterSectionTemplate //ScriptStruct Niagara.MovieSceneNiagaraColorParameterSectionTemplate
    {
    //Children Prop Count (Fields): 4
    public:

        struct FMovieSceneFloatChannel RedChannel; // 0x48
        struct FMovieSceneFloatChannel GreenChannel; // 0xe8
        struct FMovieSceneFloatChannel BlueChannel; // 0x188
        struct FMovieSceneFloatChannel AlphaChannel; // 0x228

    };

    struct FMovieSceneFloatChannel : FMovieSceneChannel //ScriptStruct MovieScene.MovieSceneFloatChannel
    {
    //Children Prop Count (Fields): 8
    public:

        enum class ERichCurveExtrapolation PreInfinityExtrap; // 0x8
        enum class ERichCurveExtrapolation PostInfinityExtrap; // 0x9
        struct TArray<struct FFrameNumber> Times; // 0x10
        struct TArray<struct FMovieSceneFloatValue> Values; // 0x20
        float DefaultValue; // 0x30
        bool bHasDefaultValue; // 0x34
        struct FMovieSceneKeyHandleMap KeyHandles; // 0x38
        struct FFrameRate TickResolution; // 0x98

    };

    struct FKeyHandleLookupTable //ScriptStruct Engine.KeyHandleLookupTable
    {
    public:


    };

    struct FMovieSceneKeyHandleMap : FKeyHandleLookupTable //ScriptStruct MovieScene.MovieSceneKeyHandleMap
    {
    public:


    };

    struct FMovieSceneFloatValue //ScriptStruct MovieScene.MovieSceneFloatValue
    {
    //Children Prop Count (Fields): 5
    public:

        float Value; // 0x0
        struct FMovieSceneTangentData Tangent; // 0x4
        enum class ERichCurveInterpMode InterpMode; // 0x18
        enum class ERichCurveTangentMode TangentMode; // 0x19
        char PaddingByte; // 0x1a

    };

    struct FMovieSceneTangentData //ScriptStruct MovieScene.MovieSceneTangentData
    {
    //Children Prop Count (Fields): 5
    public:

        float ArriveTangent; // 0x0
        float LeaveTangent; // 0x4
        float ArriveTangentWeight; // 0x8
        float LeaveTangentWeight; // 0xc
        enum class ERichCurveTangentWeightMode TangentWeightMode; // 0x10

    };

    struct FMovieSceneNiagaraFloatParameterSectionTemplate : FMovieSceneNiagaraParameterSectionTemplate //ScriptStruct Niagara.MovieSceneNiagaraFloatParameterSectionTemplate
    {
    //Children Prop Count (Fields): 1
    public:

        struct FMovieSceneFloatChannel FloatChannel; // 0x48

    };

    struct FMovieSceneNiagaraIntegerParameterSectionTemplate : FMovieSceneNiagaraParameterSectionTemplate //ScriptStruct Niagara.MovieSceneNiagaraIntegerParameterSectionTemplate
    {
    //Children Prop Count (Fields): 1
    public:

        struct FMovieSceneIntegerChannel IntegerChannel; // 0x48

    };

    struct FMovieSceneIntegerChannel : FMovieSceneChannel //ScriptStruct MovieScene.MovieSceneIntegerChannel
    {
    //Children Prop Count (Fields): 4
    public:

        struct TArray<struct FFrameNumber> Times; // 0x8
        int32_t DefaultValue; // 0x18
        bool bHasDefaultValue; // 0x1c
        struct TArray<int32_t> Values; // 0x20

    };

    struct FMovieSceneTrackImplementation : FMovieSceneEvalTemplateBase //ScriptStruct MovieScene.MovieSceneTrackImplementation
    {
    public:


    };

    struct FMovieSceneNiagaraSystemTrackImplementation : FMovieSceneTrackImplementation //ScriptStruct Niagara.MovieSceneNiagaraSystemTrackImplementation
    {
    //Children Prop Count (Fields): 6
    public:

        struct FFrameNumber SpawnSectionStartFrame; // 0x10
        struct FFrameNumber SpawnSectionEndFrame; // 0x14
        enum class ENiagaraSystemSpawnSectionStartBehavior SpawnSectionStartBehavior; // 0x18
        enum class ENiagaraSystemSpawnSectionEvaluateBehavior SpawnSectionEvaluateBehavior; // 0x1c
        enum class ENiagaraSystemSpawnSectionEndBehavior SpawnSectionEndBehavior; // 0x20
        enum class ENiagaraAgeUpdateMode AgeUpdateMode; // 0x24

    };

    struct FMovieSceneNiagaraSystemTrackTemplate : FMovieSceneEvalTemplate //ScriptStruct Niagara.MovieSceneNiagaraSystemTrackTemplate
    {
    public:


    };

    struct FMovieSceneNiagaraVectorParameterSectionTemplate : FMovieSceneNiagaraParameterSectionTemplate //ScriptStruct Niagara.MovieSceneNiagaraVectorParameterSectionTemplate
    {
    //Children Prop Count (Fields): 2
    public:

        struct FMovieSceneFloatChannel VectorChannels; // 0x48
        int32_t ChannelsUsed; // 0x2c8

    };

    struct FNiagaraRandInfo //ScriptStruct Niagara.NiagaraRandInfo
    {
    //Children Prop Count (Fields): 3
    public:

        int32_t Seed1; // 0x0
        int32_t Seed2; // 0x4
        int32_t Seed3; // 0x8

    };

    struct FNiagaraUserParameterBinding //ScriptStruct Niagara.NiagaraUserParameterBinding
    {
    //Children Prop Count (Fields): 1
    public:

        struct FNiagaraVariable Parameter; // 0x0

    };

    struct FNiagaraScriptVariableBinding //ScriptStruct Niagara.NiagaraScriptVariableBinding
    {
    //Children Prop Count (Fields): 1
    public:

        struct FName Name; // 0x0

    };

    struct FNiagaraVariableDataInterfaceBinding //ScriptStruct Niagara.NiagaraVariableDataInterfaceBinding
    {
    //Children Prop Count (Fields): 1
    public:

        struct FNiagaraVariable BoundVariable; // 0x0

    };

    struct FNiagaraVariableAttributeBinding //ScriptStruct Niagara.NiagaraVariableAttributeBinding
    {
    //Children Prop Count (Fields): 3
    public:

        struct FNiagaraVariable BoundVariable; // 0x0
        struct FNiagaraVariable DataSetVariable; // 0x28
        struct FNiagaraVariable DefaultValueIfNonExistent; // 0x50

    };

    struct FNiagaraVariableInfo //ScriptStruct Niagara.NiagaraVariableInfo
    {
    //Children Prop Count (Fields): 3
    public:

        struct FNiagaraVariable Variable; // 0x0
        struct FText Definition; // 0x28
        class UNiagaraDataInterface* DataInterface; // 0x40

    };

    struct FNiagaraSystemUpdateContext //ScriptStruct Niagara.NiagaraSystemUpdateContext
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<class UNiagaraComponent*> ComponentsToReset; // 0x0
        struct TArray<class UNiagaraComponent*> ComponentsToReInit; // 0x10
        struct TArray<class UNiagaraSystem*> SystemSimsToDestroy; // 0x20

    };

    struct FVMExternalFunctionBindingInfo //ScriptStruct Niagara.VMExternalFunctionBindingInfo
    {
    //Children Prop Count (Fields): 5
    public:

        struct FName Name; // 0x0
        struct FName OwnerName; // 0x8
        struct TArray<bool> InputParamLocations; // 0x10
        int32_t NumOutputs; // 0x20
        struct TArray<struct FVMFunctionSpecifier> FunctionSpecifiers; // 0x28

    };

    struct FVMFunctionSpecifier //ScriptStruct Niagara.VMFunctionSpecifier
    {
    //Children Prop Count (Fields): 2
    public:

        struct FName Key; // 0x0
        struct FName Value; // 0x8

    };

    struct FNiagaraStatScope //ScriptStruct Niagara.NiagaraStatScope
    {
    //Children Prop Count (Fields): 2
    public:

        struct FName FullName; // 0x0
        struct FName FriendlyName; // 0x8

    };

    struct FNiagaraScriptDataInterfaceCompileInfo //ScriptStruct Niagara.NiagaraScriptDataInterfaceCompileInfo
    {
    //Children Prop Count (Fields): 6
    public:

        struct FName Name; // 0x0
        int32_t UserPtrIdx; // 0x8
        struct FNiagaraTypeDefinition Type; // 0x10
        struct FName RegisteredParameterMapRead; // 0x20
        struct FName RegisteredParameterMapWrite; // 0x28
        bool bIsPlaceholder; // 0x30

    };

    struct FNiagaraScriptDataInterfaceInfo //ScriptStruct Niagara.NiagaraScriptDataInterfaceInfo
    {
    //Children Prop Count (Fields): 6
    public:

        class UNiagaraDataInterface* DataInterface; // 0x0
        struct FName Name; // 0x8
        int32_t UserPtrIdx; // 0x10
        struct FNiagaraTypeDefinition Type; // 0x18
        struct FName RegisteredParameterMapRead; // 0x28
        struct FName RegisteredParameterMapWrite; // 0x30

    };

    struct FNiagaraFunctionSignature //ScriptStruct Niagara.NiagaraFunctionSignature
    {
    //Children Prop Count (Fields): 11
    public:

        struct FName Name; // 0x0
        struct TArray<struct FNiagaraVariable> Inputs; // 0x8
        struct TArray<struct FNiagaraVariable> Outputs; // 0x18
        struct FName OwnerName; // 0x28
        char bRequiresContext; // 0x30
        char bMemberFunction; // 0x30
        char bExperimental; // 0x30
        char bSupportsCPU; // 0x30
        char bSupportsGPU; // 0x30
        char bWriteFunction; // 0x30
        struct TMap<struct FName, struct FName> FunctionSpecifiers; // 0x38

    };

    struct FNiagaraScriptDataUsageInfo //ScriptStruct Niagara.NiagaraScriptDataUsageInfo
    {
    //Children Prop Count (Fields): 1
    public:

        bool bReadsAttributeData; // 0x0

    };

    struct FNiagaraDataSetProperties //ScriptStruct Niagara.NiagaraDataSetProperties
    {
    //Children Prop Count (Fields): 2
    public:

        struct FNiagaraDataSetID ID; // 0x0
        struct TArray<struct FNiagaraVariable> Variables; // 0x10

    };

    struct FNiagaraDataSetID //ScriptStruct Niagara.NiagaraDataSetID
    {
    //Children Prop Count (Fields): 2
    public:

        struct FName Name; // 0x0
        enum class ENiagaraDataSetType Type; // 0x8

    };

    struct FNCPool //ScriptStruct Niagara.NCPool
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<struct FNCPoolElement> FreeElements; // 0x0
        struct TArray<class UNiagaraComponent*> InUseComponents_Auto; // 0x10
        struct TArray<class UNiagaraComponent*> InUseComponents_Manual; // 0x20

    };

    struct FNCPoolElement //ScriptStruct Niagara.NCPoolElement
    {
    //Children Prop Count (Fields): 1
    public:

        class UNiagaraComponent* Component; // 0x0

    };

    struct FBasicParticleData //ScriptStruct Niagara.BasicParticleData
    {
    //Children Prop Count (Fields): 3
    public:

        struct FVector Position; // 0x0
        float Size; // 0xc
        struct FVector Velocity; // 0x10

    };

    struct FMeshTriCoordinate //ScriptStruct Niagara.MeshTriCoordinate
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t Tri; // 0x0
        struct FVector BaryCoord; // 0x4

    };

    struct FNDIStaticMeshSectionFilter //ScriptStruct Niagara.NDIStaticMeshSectionFilter
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<int32_t> AllowedMaterialSlots; // 0x0

    };

    struct FNiagaraDataSetCompiledData //ScriptStruct Niagara.NiagaraDataSetCompiledData
    {
    //Children Prop Count (Fields): 7
    public:

        struct TArray<struct FNiagaraVariable> Variables; // 0x0
        struct TArray<struct FNiagaraVariableLayoutInfo> VariableLayouts; // 0x10
        uint32_t TotalFloatComponents; // 0x20
        uint32_t TotalInt32Components; // 0x24
        char bRequiresPersistentIDs; // 0x28
        struct FNiagaraDataSetID ID; // 0x2c
        enum class ENiagaraSimTarget SimTarget; // 0x38

    };

    struct FNiagaraVariableLayoutInfo //ScriptStruct Niagara.NiagaraVariableLayoutInfo
    {
    //Children Prop Count (Fields): 3
    public:

        uint32_t FloatComponentStart; // 0x0
        uint32_t Int32ComponentStart; // 0x4
        struct FNiagaraTypeLayoutInfo LayoutInfo; // 0x8

    };

    struct FNiagaraTypeLayoutInfo //ScriptStruct Niagara.NiagaraTypeLayoutInfo
    {
    //Children Prop Count (Fields): 4
    public:

        struct TArray<uint32_t> FloatComponentByteOffsets; // 0x0
        struct TArray<uint32_t> FloatComponentRegisterOffsets; // 0x10
        struct TArray<uint32_t> Int32ComponentByteOffsets; // 0x20
        struct TArray<uint32_t> Int32ComponentRegisterOffsets; // 0x30

    };

    struct FNiagaraGraphViewSettings //ScriptStruct Niagara.NiagaraGraphViewSettings
    {
    //Children Prop Count (Fields): 3
    public:

        struct FVector2D Location; // 0x0
        float Zoom; // 0x8
        bool bIsValid; // 0xc

    };

    struct FNiagaraEmitterScalabilityOverrides //ScriptStruct Niagara.NiagaraEmitterScalabilityOverrides
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<struct FNiagaraEmitterScalabilityOverride> Overrides; // 0x0

    };

    struct FNiagaraEmitterScalabilitySettings //ScriptStruct Niagara.NiagaraEmitterScalabilitySettings
    {
    //Children Prop Count (Fields): 3
    public:

        struct FNiagaraPlatformSet Platforms; // 0x0
        char bScaleSpawnCount; // 0x20
        float SpawnCountScale; // 0x24

    };

    struct FNiagaraPlatformSet //ScriptStruct Niagara.NiagaraPlatformSet
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t QualityLevelMask; // 0x0
        struct TArray<struct FNiagaraDeviceProfileStateEntry> DeviceProfileStates; // 0x8

    };

    struct FNiagaraDeviceProfileStateEntry //ScriptStruct Niagara.NiagaraDeviceProfileStateEntry
    {
    //Children Prop Count (Fields): 3
    public:

        struct FName ProfileName; // 0x0
        uint32_t QualityLevelMask; // 0x8
        uint32_t SetQualityLevelMask; // 0xc

    };

    struct FNiagaraEmitterScalabilityOverride : FNiagaraEmitterScalabilitySettings //ScriptStruct Niagara.NiagaraEmitterScalabilityOverride
    {
    //Children Prop Count (Fields): 1
    public:

        char bOverrideSpawnCountScale; // 0x28

    };

    struct FNiagaraEmitterScalabilitySettingsArray //ScriptStruct Niagara.NiagaraEmitterScalabilitySettingsArray
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<struct FNiagaraEmitterScalabilitySettings> Settings; // 0x0

    };

    struct FNiagaraSystemScalabilityOverrides //ScriptStruct Niagara.NiagaraSystemScalabilityOverrides
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<struct FNiagaraSystemScalabilityOverride> Overrides; // 0x0

    };

    struct FNiagaraSystemScalabilitySettings //ScriptStruct Niagara.NiagaraSystemScalabilitySettings
    {
    //Children Prop Count (Fields): 7
    public:

        struct FNiagaraPlatformSet Platforms; // 0x0
        char bCullByDistance; // 0x20
        char bCullMaxInstanceCount; // 0x20
        char bCullByMaxTimeWithoutRender; // 0x20
        float MaxDistance; // 0x24
        float MaxInstances; // 0x28
        float MaxTimeWithoutRender; // 0x2c

    };

    struct FNiagaraSystemScalabilityOverride : FNiagaraSystemScalabilitySettings //ScriptStruct Niagara.NiagaraSystemScalabilityOverride
    {
    //Children Prop Count (Fields): 3
    public:

        char bOverrideDistanceSettings; // 0x30
        char bOverrideInstanceCountSettings; // 0x30
        char bOverrideTimeSinceRendererSettings; // 0x30

    };

    struct FNiagaraSystemScalabilitySettingsArray //ScriptStruct Niagara.NiagaraSystemScalabilitySettingsArray
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<struct FNiagaraSystemScalabilitySettings> Settings; // 0x0

    };

    struct FNiagaraDetailsLevelScaleOverrides //ScriptStruct Niagara.NiagaraDetailsLevelScaleOverrides
    {
    //Children Prop Count (Fields): 5
    public:

        float Low; // 0x0
        float Medium; // 0x4
        float High; // 0x8
        float Epic; // 0xc
        float Cine; // 0x10

    };

    struct FNiagaraEmitterScriptProperties //ScriptStruct Niagara.NiagaraEmitterScriptProperties
    {
    //Children Prop Count (Fields): 3
    public:

        class UNiagaraScript* Script; // 0x0
        struct TArray<struct FNiagaraEventReceiverProperties> EventReceivers; // 0x8
        struct TArray<struct FNiagaraEventGeneratorProperties> EventGenerators; // 0x18

    };

    struct FNiagaraEventGeneratorProperties //ScriptStruct Niagara.NiagaraEventGeneratorProperties
    {
    //Children Prop Count (Fields): 3
    public:

        int32_t MaxEventsPerFrame; // 0x0
        struct FName ID; // 0x4
        struct FNiagaraDataSetCompiledData DataSetCompiledData; // 0x10

    };

    struct FNiagaraEventReceiverProperties //ScriptStruct Niagara.NiagaraEventReceiverProperties
    {
    //Children Prop Count (Fields): 3
    public:

        struct FName Name; // 0x0
        struct FName SourceEventGenerator; // 0x8
        struct FName SourceEmitter; // 0x10

    };

    struct FNiagaraEventScriptProperties : FNiagaraEmitterScriptProperties //ScriptStruct Niagara.NiagaraEventScriptProperties
    {
    //Children Prop Count (Fields): 7
    public:

        enum class EScriptExecutionMode ExecutionMode; // 0x28
        uint32_t SpawnNumber; // 0x2c
        uint32_t MaxEventsPerFrame; // 0x30
        struct FGuid SourceEmitterID; // 0x34
        struct FName SourceEventName; // 0x44
        bool bRandomSpawnNumber; // 0x4c
        uint32_t MinSpawnNumber; // 0x50

    };

    struct FNiagaraEmitterHandle //ScriptStruct Niagara.NiagaraEmitterHandle
    {
    //Children Prop Count (Fields): 5
    public:

        struct FGuid ID; // 0x0
        struct FName IdName; // 0x10
        bool bIsEnabled; // 0x18
        struct FName Name; // 0x1c
        class UNiagaraEmitter* Instance; // 0x28

    };

    struct FNiagaraCollisionEventPayload //ScriptStruct Niagara.NiagaraCollisionEventPayload
    {
    //Children Prop Count (Fields): 5
    public:

        struct FVector CollisionPos; // 0x0
        struct FVector CollisionNormal; // 0xc
        struct FVector CollisionVelocity; // 0x18
        int32_t ParticleIndex; // 0x24
        int32_t PhysicalMaterialIndex; // 0x28

    };

    struct FNiagaraMeshMaterialOverride //ScriptStruct Niagara.NiagaraMeshMaterialOverride
    {
    //Children Prop Count (Fields): 2
    public:

        class UMaterialInterface* ExplicitMat; // 0x0
        struct FNiagaraUserParameterBinding UserParamBinding; // 0x8

    };

    struct FNiagaraParameters //ScriptStruct Niagara.NiagaraParameters
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<struct FNiagaraVariable> Parameters; // 0x0

    };

    struct FNiagaraParameterStore //ScriptStruct Niagara.NiagaraParameterStore
    {
    //Children Prop Count (Fields): 5
    public:

        class UObject* Owner; // 0x8
        struct TArray<struct FNiagaraVariableWithOffset> SortedParameterOffsets; // 0x10
        struct TArray<char> ParameterData; // 0x20
        struct TArray<class UNiagaraDataInterface*> DataInterfaces; // 0x30
        struct TArray<class UObject*> UObjects; // 0x40

    };

    struct FNiagaraVariableWithOffset : FNiagaraVariableBase //ScriptStruct Niagara.NiagaraVariableWithOffset
    {
    //Children Prop Count (Fields): 1
    public:

        int32_t Offset; // 0x18

    };

    struct FNiagaraBoundParameter //ScriptStruct Niagara.NiagaraBoundParameter
    {
    //Children Prop Count (Fields): 3
    public:

        struct FNiagaraVariable Parameter; // 0x0
        int32_t SrcOffset; // 0x28
        int32_t DestOffset; // 0x2c

    };

    struct FNiagaraPlatformSetConflictInfo //ScriptStruct Niagara.NiagaraPlatformSetConflictInfo
    {
    //Children Prop Count (Fields): 3
    public:

        int32_t SetAIndex; // 0x0
        int32_t SetBIndex; // 0x4
        struct TArray<struct FNiagaraPlatformSetConflictEntry> Conflicts; // 0x8

    };

    struct FNiagaraPlatformSetConflictEntry //ScriptStruct Niagara.NiagaraPlatformSetConflictEntry
    {
    //Children Prop Count (Fields): 2
    public:

        struct FName ProfileName; // 0x0
        int32_t QualityLevelMask; // 0x8

    };

    struct FNiagaraScalabilityManager //ScriptStruct Niagara.NiagaraScalabilityManager
    {
    //Children Prop Count (Fields): 2
    public:

        class UNiagaraEffectType* EffectType; // 0x0
        struct TArray<class UNiagaraComponent*> ManagedComponents; // 0x8

    };

    struct FNiagaraVMExecutableData //ScriptStruct Niagara.NiagaraVMExecutableData
    {
    //Children Prop Count (Fields): 17
    public:

        struct TArray<char> ByteCode; // 0x0
        struct TArray<char> OptimizedByteCode; // 0x10
        int32_t NumTempRegisters; // 0x20
        int32_t NumUserPtrs; // 0x24
        struct FNiagaraParameters Parameters; // 0x28
        struct FNiagaraParameters InternalParameters; // 0x38
        struct TMap<struct FName, struct FNiagaraParameters> DataSetToParameters; // 0x48
        struct TArray<struct FNiagaraVariable> Attributes; // 0x98
        struct FNiagaraScriptDataUsageInfo DataUsage; // 0xa8
        struct TArray<struct FNiagaraScriptDataInterfaceCompileInfo> DataInterfaceInfo; // 0xb0
        struct TArray<struct FVMExternalFunctionBindingInfo> CalledVMExternalFunctions; // 0xc0
        struct TArray<struct FNiagaraDataSetID> ReadDataSets; // 0xd0
        struct TArray<struct FNiagaraDataSetProperties> WriteDataSets; // 0xe0
        struct TArray<struct FNiagaraStatScope> StatScopes; // 0xf0
        struct TArray<struct FNiagaraDataInterfaceGPUParamInfo> DIParamInfo; // 0x100
        enum class ENiagaraScriptCompileStatus LastCompileStatus; // 0x110
        struct TArray<struct FSimulationStageMetaData> SimulationStageMetaData; // 0x118

    };

    struct FSimulationStageMetaData //ScriptStruct Niagara.SimulationStageMetaData
    {
    //Children Prop Count (Fields): 6
    public:

        struct FName IterationSource; // 0x0
        char bSpawnOnly; // 0x8
        char bWritesParticles; // 0x8
        struct TArray<struct FName> OutputDestinations; // 0x10
        int32_t MinStage; // 0x20
        int32_t MaxStage; // 0x24

    };

    struct FNiagaraDataInterfaceGPUParamInfo //ScriptStruct NiagaraShader.NiagaraDataInterfaceGPUParamInfo
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString DataInterfaceHLSLSymbol; // 0x0
        struct FString DIClassName; // 0x10
        struct TArray<struct FNiagaraDataInterfaceGeneratedFunction> GeneratedFunctions; // 0x20

    };

    struct FNiagaraDataInterfaceGeneratedFunction //ScriptStruct NiagaraShader.NiagaraDataInterfaceGeneratedFunction
    {
    public:


    };

    struct FNiagaraVMExecutableDataId //ScriptStruct Niagara.NiagaraVMExecutableDataId
    {
    //Children Prop Count (Fields): 8
    public:

        struct FGuid CompilerVersionID; // 0x0
        enum class ENiagaraScriptUsage ScriptUsageType; // 0x10
        struct FGuid ScriptUsageTypeID; // 0x14
        char bUsesRapidIterationParams; // 0x24
        char bInterpolatedSpawn; // 0x24
        char bRequiresPersistentIDs; // 0x24
        struct FGuid BaseScriptID; // 0x28
        struct FNiagaraCompileHash BaseScriptCompileHash; // 0x38

    };

    struct FNiagaraModuleDependency //ScriptStruct Niagara.NiagaraModuleDependency
    {
    //Children Prop Count (Fields): 4
    public:

        struct FName ID; // 0x0
        enum class ENiagaraModuleDependencyType Type; // 0x8
        enum class ENiagaraModuleDependencyScriptConstraint ScriptConstraint; // 0x9
        struct FText Description; // 0x10

    };

    struct FNiagaraScriptExecutionParameterStore : FNiagaraParameterStore //ScriptStruct Niagara.NiagaraScriptExecutionParameterStore
    {
    //Children Prop Count (Fields): 4
    public:

        int32_t ParameterSize; // 0xb8
        uint32_t PaddedParameterSize; // 0xbc
        struct TArray<struct FNiagaraScriptExecutionPaddingInfo> PaddingInfo; // 0xc0
        char bInitialized; // 0xd0

    };

    struct FNiagaraScriptExecutionPaddingInfo //ScriptStruct Niagara.NiagaraScriptExecutionPaddingInfo
    {
    //Children Prop Count (Fields): 4
    public:

        uint16_t SrcOffset; // 0x0
        uint16_t DestOffset; // 0x2
        uint16_t SrcSize; // 0x4
        uint16_t DestSize; // 0x6

    };

    struct FNiagaraScriptHighlight //ScriptStruct Niagara.NiagaraScriptHighlight
    {
    //Children Prop Count (Fields): 2
    public:

        struct FLinearColor Color; // 0x0
        struct FText DisplayName; // 0x10

    };

    struct FNiagaraSystemCompileRequest //ScriptStruct Niagara.NiagaraSystemCompileRequest
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UObject*> RootObjects; // 0x8

    };

    struct FEmitterCompiledScriptPair //ScriptStruct Niagara.EmitterCompiledScriptPair
    {
    public:


    };

    struct FNiagaraSystemCompiledData //ScriptStruct Niagara.NiagaraSystemCompiledData
    {
    //Children Prop Count (Fields): 12
    public:

        struct FNiagaraParameterStore InstanceParamStore; // 0x0
        struct FNiagaraDataSetCompiledData DataSetCompiledData; // 0xb8
        struct FNiagaraDataSetCompiledData SpawnInstanceParamsDataSetCompiledData; // 0xf8
        struct FNiagaraDataSetCompiledData UpdateInstanceParamsDataSetCompiledData; // 0x138
        struct FNiagaraParameterDataSetBindingCollection SpawnInstanceGlobalBinding; // 0x178
        struct FNiagaraParameterDataSetBindingCollection SpawnInstanceSystemBinding; // 0x198
        struct FNiagaraParameterDataSetBindingCollection SpawnInstanceOwnerBinding; // 0x1b8
        struct TArray<struct FNiagaraParameterDataSetBindingCollection> SpawnInstanceEmitterBindings; // 0x1d8
        struct FNiagaraParameterDataSetBindingCollection UpdateInstanceGlobalBinding; // 0x1e8
        struct FNiagaraParameterDataSetBindingCollection UpdateInstanceSystemBinding; // 0x208
        struct FNiagaraParameterDataSetBindingCollection UpdateInstanceOwnerBinding; // 0x228
        struct TArray<struct FNiagaraParameterDataSetBindingCollection> UpdateInstanceEmitterBindings; // 0x248

    };

    struct FNiagaraParameterDataSetBindingCollection //ScriptStruct Niagara.NiagaraParameterDataSetBindingCollection
    {
    //Children Prop Count (Fields): 2
    public:

        struct TArray<struct FNiagaraParameterDataSetBinding> FloatOffsets; // 0x0
        struct TArray<struct FNiagaraParameterDataSetBinding> Int32Offsets; // 0x10

    };

    struct FNiagaraParameterDataSetBinding //ScriptStruct Niagara.NiagaraParameterDataSetBinding
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t ParameterOffset; // 0x0
        int32_t DataSetComponentOffset; // 0x4

    };

    struct FNiagaraEmitterCompiledData //ScriptStruct Niagara.NiagaraEmitterCompiledData
    {
    //Children Prop Count (Fields): 8
    public:

        struct TArray<struct FName> SpawnAttributes; // 0x0
        struct FNiagaraVariable EmitterSpawnIntervalVar; // 0x10
        struct FNiagaraVariable EmitterInterpSpawnStartDTVar; // 0x38
        struct FNiagaraVariable EmitterSpawnGroupVar; // 0x60
        struct FNiagaraVariable EmitterAgeVar; // 0x88
        struct FNiagaraVariable EmitterRandomSeedVar; // 0xb0
        struct FNiagaraVariable EmitterTotalSpawnedParticlesVar; // 0xd8
        struct FNiagaraDataSetCompiledData DataSetCompiledData; // 0x100

    };

    struct FNiagaraVariableMetaData //ScriptStruct Niagara.NiagaraVariableMetaData
    {
    //Children Prop Count (Fields): 17
    public:

        struct FText Description; // 0x0
        struct FText CategoryName; // 0x18
        bool bAdvancedDisplay; // 0x30
        int32_t EditorSortPriority; // 0x34
        bool bInlineEditConditionToggle; // 0x38
        struct FNiagaraInputConditionMetadata EditCondition; // 0x40
        struct FNiagaraInputConditionMetadata VisibleCondition; // 0x58
        struct TMap<struct FName, struct FString> PropertyMetaData; // 0x70
        struct FName ScopeName; // 0xc0
        enum class ENiagaraScriptParameterUsage Usage; // 0xc8
        bool bIsStaticSwitch; // 0xcc
        int32_t StaticSwitchDefaultValue; // 0xd0
        bool bAddedToNodeGraphDeepCopy; // 0xd4
        bool bOutputIsPersistent; // 0xd5
        struct FName CachedNamespacelessVariableName; // 0xd8
        bool bCreatedInSystemEditor; // 0xe0
        bool bUseLegacyNameString; // 0xe1

    };

    struct FNiagaraInputConditionMetadata //ScriptStruct Niagara.NiagaraInputConditionMetadata
    {
    //Children Prop Count (Fields): 2
    public:

        struct FName InputName; // 0x0
        struct TArray<struct FString> TargetValues; // 0x8

    };

    struct FNiagaraParameterScopeInfo //ScriptStruct Niagara.NiagaraParameterScopeInfo
    {
    //Children Prop Count (Fields): 2
    public:

        enum class ENiagaraParameterScope Scope; // 0x0
        struct FString NamespaceString; // 0x8

    };

    struct FNiagaraCompileHashVisitorDebugInfo //ScriptStruct Niagara.NiagaraCompileHashVisitorDebugInfo
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString Object; // 0x0
        struct TArray<struct FString> PropertyKeys; // 0x10
        struct TArray<struct FString> PropertyValues; // 0x20

    };

    struct FNiagaraID //ScriptStruct Niagara.NiagaraID
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t Index; // 0x0
        int32_t AcquireTag; // 0x4

    };

    struct FNiagaraSpawnInfo //ScriptStruct Niagara.NiagaraSpawnInfo
    {
    //Children Prop Count (Fields): 4
    public:

        int32_t Count; // 0x0
        float InterpStartDt; // 0x4
        float IntervalDt; // 0x8
        int32_t SpawnGroup; // 0xc

    };

    struct FNiagaraMatrix //ScriptStruct Niagara.NiagaraMatrix
    {
    //Children Prop Count (Fields): 4
    public:

        struct FVector4 Row0; // 0x0
        struct FVector4 Row1; // 0x10
        struct FVector4 Row2; // 0x20
        struct FVector4 Row3; // 0x30

    };

    struct FNiagaraTestStruct //ScriptStruct Niagara.NiagaraTestStruct
    {
    //Children Prop Count (Fields): 4
    public:

        struct FVector Vector1; // 0x0
        struct FVector Vector2; // 0xc
        struct FNiagaraTestStructInner InnerStruct1; // 0x18
        struct FNiagaraTestStructInner InnerStruct2; // 0x30

    };

    struct FNiagaraTestStructInner //ScriptStruct Niagara.NiagaraTestStructInner
    {
    //Children Prop Count (Fields): 2
    public:

        struct FVector InnerVector1; // 0x0
        struct FVector InnerVector2; // 0xc

    };

    struct FNiagaraParameterMap //ScriptStruct Niagara.NiagaraParameterMap
    {
    public:


    };

    struct FNiagaraNumeric //ScriptStruct Niagara.NiagaraNumeric
    {
    public:


    };

    struct FNiagaraBool //ScriptStruct Niagara.NiagaraBool
    {
    //Children Prop Count (Fields): 1
    public:

        int32_t Value; // 0x0

    };

    struct FNiagaraInt32 //ScriptStruct Niagara.NiagaraInt32
    {
    //Children Prop Count (Fields): 1
    public:

        int32_t Value; // 0x0

    };

    struct FNiagaraFloat //ScriptStruct Niagara.NiagaraFloat
    {
    //Children Prop Count (Fields): 1
    public:

        float Value; // 0x0

    };

    struct FNiagaraUserRedirectionParameterStore : FNiagaraParameterStore //ScriptStruct Niagara.NiagaraUserRedirectionParameterStore
    {
    //Children Prop Count (Fields): 1
    public:

        struct TMap<struct FNiagaraVariable, struct FNiagaraVariable> UserParameterRedirects; // 0xb8

    };

    struct FNiagaraVariant //ScriptStruct Niagara.NiagaraVariant
    {
    //Children Prop Count (Fields): 4
    public:

        class UObject* Object; // 0x0
        class UNiagaraDataInterface* DataInterface; // 0x8
        struct TArray<char> Bytes; // 0x10
        enum class ENiagaraVariantMode CurrentMode; // 0x20

    };

    struct FNiagaraWorldManagerTickFunction : FTickFunction //ScriptStruct Niagara.NiagaraWorldManagerTickFunction
    {
    public:


    };

    struct FNiagaraCompileEvent //ScriptStruct NiagaraShader.NiagaraCompileEvent
    {
    //Children Prop Count (Fields): 5
    public:

        enum class FNiagaraCompileEventSeverity Severity; // 0x0
        struct FString Message; // 0x8
        struct FGuid NodeGuid; // 0x18
        struct FGuid PinGuid; // 0x28
        struct TArray<struct FGuid> StackGuids; // 0x38

    };

    struct FRepAttachment //ScriptStruct Engine.RepAttachment
    {
    //Children Prop Count (Fields): 6
    public:

        class AActor* AttachParent; // 0x0
        struct FVector_NetQuantize100 LocationOffset; // 0x8
        struct FVector_NetQuantize100 RelativeScale3D; // 0x14
        struct FRotator RotationOffset; // 0x20
        struct FName AttachSocket; // 0x2c
        class USceneComponent* AttachComponent; // 0x38

    };

    struct FVector_NetQuantize100 : FVector //ScriptStruct Engine.Vector_NetQuantize100
    {
    public:


    };

    struct FRepMovement //ScriptStruct Engine.RepMovement
    {
    //Children Prop Count (Fields): 9
    public:

        struct FVector LinearVelocity; // 0x0
        struct FVector AngularVelocity; // 0xc
        struct FVector Location; // 0x18
        struct FRotator Rotation; // 0x24
        char bSimulatedPhysicSleep; // 0x30
        char bRepPhysics; // 0x30
        enum class EVectorQuantization LocationQuantizationLevel; // 0x31
        enum class EVectorQuantization VelocityQuantizationLevel; // 0x32
        enum class ERotatorQuantization RotationQuantizationLevel; // 0x33

    };

    struct FActorTickFunction : FTickFunction //ScriptStruct Engine.ActorTickFunction
    {
    public:


    };

    struct FMagicLeapSharedWorldSharedData //ScriptStruct MagicLeapSharedWorld.MagicLeapSharedWorldSharedData
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<struct FGuid> PinIDs; // 0x0

    };

    struct FMagicLeapSharedWorldAlignmentTransforms //ScriptStruct MagicLeapSharedWorld.MagicLeapSharedWorldAlignmentTransforms
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<struct FTransform> AlignmentTransforms; // 0x0

    };

    struct FMagicLeapSharedWorldLocalData //ScriptStruct MagicLeapSharedWorld.MagicLeapSharedWorldLocalData
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<struct FMagicLeapSharedWorldPinData> LocalPins; // 0x0

    };

    struct FMagicLeapSharedWorldPinData //ScriptStruct MagicLeapSharedWorld.MagicLeapSharedWorldPinData
    {
    //Children Prop Count (Fields): 2
    public:

        struct FGuid PinID; // 0x0
        struct FMagicLeapARPinState PinState; // 0x10

    };

    struct FMagicLeapGraphicsClientPerformanceInfo //ScriptStruct MagicLeap.MagicLeapGraphicsClientPerformanceInfo
    {
    //Children Prop Count (Fields): 7
    public:

        float FrameStartCPUCompAcquireCPUTimeMs; // 0x0
        float FrameStartCPUFrameEndGPUTimeMs; // 0x4
        float FrameStartCPUFrameStartCPUTimeMs; // 0x8
        float FrameDurationCPUTimeMs; // 0xc
        float FrameDurationGPUTimeMs; // 0x10
        float FrameInternalDurationCPUTimeMs; // 0x14
        float FrameInternalDurationGPUTimeMs; // 0x18

    };

    struct FMagicLeapHeadTrackingState //ScriptStruct MagicLeap.MagicLeapHeadTrackingState
    {
    //Children Prop Count (Fields): 3
    public:

        enum class EMagicLeapHeadTrackingMode Mode; // 0x0
        enum class EMagicLeapHeadTrackingError Error; // 0x1
        float Confidence; // 0x4

    };

    struct FMagicLeapAudioDummyStruct //ScriptStruct MagicLeapAudio.MagicLeapAudioDummyStruct
    {
    public:


    };

    struct FMagicLeapEyeBlinkState //ScriptStruct MagicLeapEyeTracker.MagicLeapEyeBlinkState
    {
    //Children Prop Count (Fields): 2
    public:

        bool LeftEyeBlinked; // 0x0
        bool RightEyeBlinked; // 0x1

    };

    struct FMagicLeapImageTrackerTarget //ScriptStruct MagicLeapImageTracker.MagicLeapImageTrackerTarget
    {
    public:


    };

    struct FMagicLeapPlanesQuery //ScriptStruct MagicLeapPlanes.MagicLeapPlanesQuery
    {
    //Children Prop Count (Fields): 11
    public:

        struct TArray<enum class EMagicLeapPlaneQueryFlags> Flags; // 0x0
        class UBoxComponent* SearchVolume; // 0x10
        int32_t MaxResults; // 0x18
        float MinHoleLength; // 0x1c
        float MinPlaneArea; // 0x20
        struct FVector SearchVolumePosition; // 0x24
        struct FQuat SearchVolumeOrientation; // 0x30
        struct FVector SearchVolumeExtents; // 0x40
        float SimilarityThreshold; // 0x4c
        bool bSearchVolumeTrackingSpace; // 0x50
        bool bResultTrackingSpace; // 0x51

    };

    struct FMagicLeapHandMesh //ScriptStruct MagicLeapHandMeshing.MagicLeapHandMesh
    {
    //Children Prop Count (Fields): 3
    public:

        int32_t Version; // 0x0
        int32_t DataCount; // 0x4
        struct TArray<struct FMagicLeapHandMeshBlock> Data; // 0x8

    };

    struct FMagicLeapHandMeshBlock //ScriptStruct MagicLeapHandMeshing.MagicLeapHandMeshBlock
    {
    //Children Prop Count (Fields): 4
    public:

        int32_t IndexCount; // 0x0
        int32_t VertexCount; // 0x4
        struct TArray<struct FVector> Vertex; // 0x8
        struct TArray<int32_t> Index; // 0x18

    };

    struct FMagicLeapLightEstimationColorTemperatureState //ScriptStruct MagicLeapLightEstimation.MagicLeapLightEstimationColorTemperatureState
    {
    //Children Prop Count (Fields): 3
    public:

        float ColorTemperatureKelvin; // 0x0
        struct FLinearColor AmbientColor; // 0x4
        struct FTimespan Timestamp; // 0x18

    };

    struct FMagicLeapLightEstimationAmbientGlobalState //ScriptStruct MagicLeapLightEstimation.MagicLeapLightEstimationAmbientGlobalState
    {
    //Children Prop Count (Fields): 2
    public:

        struct TArray<float> AmbientIntensityNits; // 0x0
        struct FTimespan Timestamp; // 0x10

    };

    struct FUdpMockMessage //ScriptStruct UdpMessaging.UdpMockMessage
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<char> Data; // 0x0

    };

    struct FActorSequenceObjectReferenceMap //ScriptStruct ActorSequence.ActorSequenceObjectReferenceMap
    {
    //Children Prop Count (Fields): 2
    public:

        struct TArray<struct FGuid> BindingIds; // 0x0
        struct TArray<struct FActorSequenceObjectReferences> References; // 0x10

    };

    struct FActorSequenceObjectReferences //ScriptStruct ActorSequence.ActorSequenceObjectReferences
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<struct FActorSequenceObjectReference> Array; // 0x0

    };

    struct FActorSequenceObjectReference //ScriptStruct ActorSequence.ActorSequenceObjectReference
    {
    //Children Prop Count (Fields): 3
    public:

        enum class EActorSequenceObjectReferenceType Type; // 0x0
        struct FGuid ActorId; // 0x4
        struct FString PathToComponent; // 0x18

    };

    struct FTemplateSequenceBindingOverrideData //ScriptStruct TemplateSequence.TemplateSequenceBindingOverrideData
    {
    //Children Prop Count (Fields): 2
    public:

        struct TWeakObjectPtr<struct UObject> Object; // 0x0
        bool bOverridesDefault; // 0x8

    };

    struct FMovieSceneSequenceInstanceData //ScriptStruct MovieScene.MovieSceneSequenceInstanceData
    {
    public:


    };

    struct FTemplateSequenceInstanceData : FMovieSceneSequenceInstanceData //ScriptStruct TemplateSequence.TemplateSequenceInstanceData
    {
    //Children Prop Count (Fields): 1
    public:

        struct FMovieSceneEvaluationOperand Operand; // 0x8

    };

    struct FMovieSceneEvaluationOperand //ScriptStruct MovieScene.MovieSceneEvaluationOperand
    {
    //Children Prop Count (Fields): 2
    public:

        struct FGuid ObjectBindingID; // 0x0
        struct FMovieSceneSequenceID SequenceID; // 0x10

    };

    struct FMovieSceneSequenceID //ScriptStruct MovieScene.MovieSceneSequenceID
    {
    //Children Prop Count (Fields): 1
    public:

        uint32_t Value; // 0x0

    };

    struct FTemplateSequenceSectionTemplate : FMovieSceneEvalTemplate //ScriptStruct TemplateSequence.TemplateSequenceSectionTemplate
    {
    //Children Prop Count (Fields): 3
    public:

        struct FFrameNumber SectionStartTime; // 0x20
        struct FGuid OuterBindingId; // 0x24
        struct FMovieSceneEvaluationOperand InnerOperand; // 0x34

    };

    struct FAudioCaptureDeviceInfo //ScriptStruct AudioCapture.AudioCaptureDeviceInfo
    {
    //Children Prop Count (Fields): 3
    public:

        struct FName DeviceName; // 0x0
        int32_t NumInputChannels; // 0x8
        int32_t SampleRate; // 0xc

    };

    struct FCustomMeshTriangle //ScriptStruct CustomMeshComponent.CustomMeshTriangle
    {
    //Children Prop Count (Fields): 3
    public:

        struct FVector Vertex0; // 0x0
        struct FVector Vertex1; // 0xc
        struct FVector Vertex2; // 0x18

    };

    struct FAnimNode_WheelHandler : FAnimNode_SkeletalControlBase //ScriptStruct PhysXVehicles.AnimNode_WheelHandler
    {
    public:


    };

    struct FTireConfigMaterialFriction //ScriptStruct PhysXVehicles.TireConfigMaterialFriction
    {
    //Children Prop Count (Fields): 2
    public:

        class UPhysicalMaterial* PhysicalMaterial; // 0x0
        float FrictionScale; // 0x8

    };

    struct FAnimInstanceProxy //ScriptStruct Engine.AnimInstanceProxy
    {
    public:


    };

    struct FVehicleAnimInstanceProxy : FAnimInstanceProxy //ScriptStruct PhysXVehicles.VehicleAnimInstanceProxy
    {
    public:


    };

    struct FVehicleInputRate //ScriptStruct PhysXVehicles.VehicleInputRate
    {
    //Children Prop Count (Fields): 2
    public:

        float RiseRate; // 0x0
        float FallRate; // 0x4

    };

    struct FReplicatedVehicleState //ScriptStruct PhysXVehicles.ReplicatedVehicleState
    {
    //Children Prop Count (Fields): 5
    public:

        float SteeringInput; // 0x0
        float ThrottleInput; // 0x4
        float BrakeInput; // 0x8
        float HandbrakeInput; // 0xc
        int32_t CurrentGear; // 0x10

    };

    struct FWheelSetup //ScriptStruct PhysXVehicles.WheelSetup
    {
    //Children Prop Count (Fields): 4
    public:

        class UVehicleWheel* WheelClass; // 0x0
        struct FName BoneName; // 0x8
        struct FVector AdditionalOffset; // 0x10
        bool bDisableSteering; // 0x1c

    };

    struct FVehicleTransmissionData //ScriptStruct PhysXVehicles.VehicleTransmissionData
    {
    //Children Prop Count (Fields): 8
    public:

        bool bUseGearAutoBox; // 0x0
        float GearSwitchTime; // 0x4
        float GearAutoBoxLatency; // 0x8
        float FinalRatio; // 0xc
        struct TArray<struct FVehicleGearData> ForwardGears; // 0x10
        float ReverseGearRatio; // 0x20
        float NeutralGearUpRatio; // 0x24
        float ClutchStrength; // 0x28

    };

    struct FVehicleGearData //ScriptStruct PhysXVehicles.VehicleGearData
    {
    //Children Prop Count (Fields): 3
    public:

        float Ratio; // 0x0
        float DownRatio; // 0x4
        float UpRatio; // 0x8

    };

    struct FVehicleEngineData //ScriptStruct PhysXVehicles.VehicleEngineData
    {
    //Children Prop Count (Fields): 6
    public:

        struct FRuntimeFloatCurve TorqueCurve; // 0x0
        float MaxRPM; // 0x88
        float MOI; // 0x8c
        float DampingRateFullThrottle; // 0x90
        float DampingRateZeroThrottleClutchEngaged; // 0x94
        float DampingRateZeroThrottleClutchDisengaged; // 0x98

    };

    struct FRuntimeFloatCurve //ScriptStruct Engine.RuntimeFloatCurve
    {
    //Children Prop Count (Fields): 2
    public:

        struct FRichCurve EditorCurveData; // 0x0
        class UCurveFloat* ExternalCurve; // 0x80

    };

    struct FIndexedCurve //ScriptStruct Engine.IndexedCurve
    {
    //Children Prop Count (Fields): 1
    public:

        struct FKeyHandleMap KeyHandlesToIndices; // 0x8

    };

    struct FKeyHandleMap //ScriptStruct Engine.KeyHandleMap
    {
    public:


    };

    struct FRealCurve : FIndexedCurve //ScriptStruct Engine.RealCurve
    {
    //Children Prop Count (Fields): 3
    public:

        float DefaultValue; // 0x68
        enum class ERichCurveExtrapolation PreInfinityExtrap; // 0x6c
        enum class ERichCurveExtrapolation PostInfinityExtrap; // 0x6d

    };

    struct FRichCurve : FRealCurve //ScriptStruct Engine.RichCurve
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<struct FRichCurveKey> Keys; // 0x70

    };

    struct FRichCurveKey //ScriptStruct Engine.RichCurveKey
    {
    //Children Prop Count (Fields): 9
    public:

        enum class ERichCurveInterpMode InterpMode; // 0x0
        enum class ERichCurveTangentMode TangentMode; // 0x1
        enum class ERichCurveTangentWeightMode TangentWeightMode; // 0x2
        float Time; // 0x4
        float Value; // 0x8
        float ArriveTangent; // 0xc
        float ArriveTangentWeight; // 0x10
        float LeaveTangent; // 0x14
        float LeaveTangentWeight; // 0x18

    };

    struct FVehicleDifferential4WData //ScriptStruct PhysXVehicles.VehicleDifferential4WData
    {
    //Children Prop Count (Fields): 7
    public:

        enum class EVehicleDifferential4W DifferentialType; // 0x0
        float FrontRearSplit; // 0x4
        float FrontLeftRightSplit; // 0x8
        float RearLeftRightSplit; // 0xc
        float CentreBias; // 0x10
        float FrontBias; // 0x14
        float RearBias; // 0x18

    };

    struct FModularSynthPresetBankEntry //ScriptStruct Synthesis.ModularSynthPresetBankEntry
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString PresetName; // 0x0
        struct FModularSynthPreset Preset; // 0x10

    };

    struct FModularSynthPreset : FTableRowBase //ScriptStruct Synthesis.ModularSynthPreset
    {
    //Children Prop Count (Fields): 59
    public:

        char bEnablePolyphony; // 0x8
        enum class ESynth1OscType Osc1Type; // 0xc
        float Osc1Gain; // 0x10
        float Osc1Octave; // 0x14
        float Osc1Semitones; // 0x18
        float Osc1Cents; // 0x1c
        float Osc1PulseWidth; // 0x20
        enum class ESynth1OscType Osc2Type; // 0x24
        float Osc2Gain; // 0x28
        float Osc2Octave; // 0x2c
        float Osc2Semitones; // 0x30
        float Osc2Cents; // 0x34
        float Osc2PulseWidth; // 0x38
        float Portamento; // 0x3c
        char bEnableUnison; // 0x40
        char bEnableOscillatorSync; // 0x40
        float Spread; // 0x44
        float Pan; // 0x48
        float LFO1Frequency; // 0x4c
        float LFO1Gain; // 0x50
        enum class ESynthLFOType LFO1Type; // 0x54
        enum class ESynthLFOMode LFO1Mode; // 0x55
        enum class ESynthLFOPatchType LFO1PatchType; // 0x56
        float LFO2Frequency; // 0x58
        float LFO2Gain; // 0x5c
        enum class ESynthLFOType LFO2Type; // 0x60
        enum class ESynthLFOMode LFO2Mode; // 0x61
        enum class ESynthLFOPatchType LFO2PatchType; // 0x62
        float GainDb; // 0x64
        float AttackTime; // 0x68
        float DecayTime; // 0x6c
        float SustainGain; // 0x70
        float ReleaseTime; // 0x74
        enum class ESynthModEnvPatch ModEnvPatchType; // 0x78
        enum class ESynthModEnvBiasPatch ModEnvBiasPatchType; // 0x79
        char bInvertModulationEnvelope; // 0x7c
        char bInvertModulationEnvelopeBias; // 0x7c
        float ModulationEnvelopeDepth; // 0x80
        float ModulationEnvelopeAttackTime; // 0x84
        float ModulationEnvelopeDecayTime; // 0x88
        float ModulationEnvelopeSustainGain; // 0x8c
        float ModulationEnvelopeReleaseTime; // 0x90
        char bLegato; // 0x94
        char bRetrigger; // 0x94
        float FilterFrequency; // 0x98
        float FilterQ; // 0x9c
        enum class ESynthFilterType FilterType; // 0xa0
        enum class ESynthFilterAlgorithm FilterAlgorithm; // 0xa1
        char bStereoDelayEnabled; // 0xa4
        enum class ESynthStereoDelayMode StereoDelayMode; // 0xa8
        float StereoDelayTime; // 0xac
        float StereoDelayFeedback; // 0xb0
        float StereoDelayWetlevel; // 0xb4
        float StereoDelayRatio; // 0xb8
        char bChorusEnabled; // 0xbc
        float ChorusDepth; // 0xc0
        float ChorusFeedback; // 0xc4
        float ChorusFrequency; // 0xc8
        struct TArray<struct FEpicSynth1Patch> Patches; // 0xd0

    };

    struct FEpicSynth1Patch //ScriptStruct Synthesis.EpicSynth1Patch
    {
    //Children Prop Count (Fields): 2
    public:

        enum class ESynth1PatchSource PatchSource; // 0x0
        struct TArray<struct FSynth1PatchCable> PatchCables; // 0x8

    };

    struct FSynth1PatchCable //ScriptStruct Synthesis.Synth1PatchCable
    {
    //Children Prop Count (Fields): 2
    public:

        float Depth; // 0x0
        enum class ESynth1PatchDestination Destination; // 0x4

    };

    struct FPatchId //ScriptStruct Synthesis.PatchId
    {
    //Children Prop Count (Fields): 1
    public:

        int32_t ID; // 0x0

    };

    struct FSourceEffectBitCrusherSettings //ScriptStruct Synthesis.SourceEffectBitCrusherSettings
    {
    //Children Prop Count (Fields): 2
    public:

        float CrushedSampleRate; // 0x0
        float CrushedBits; // 0x4

    };

    struct FSourceEffectChorusSettings //ScriptStruct Synthesis.SourceEffectChorusSettings
    {
    //Children Prop Count (Fields): 6
    public:

        float Depth; // 0x0
        float Frequency; // 0x4
        float Feedback; // 0x8
        float WetLevel; // 0xc
        float DryLevel; // 0x10
        float Spread; // 0x14

    };

    struct FSourceEffectDynamicsProcessorSettings //ScriptStruct Synthesis.SourceEffectDynamicsProcessorSettings
    {
    //Children Prop Count (Fields): 12
    public:

        enum class ESourceEffectDynamicsProcessorType DynamicsProcessorType; // 0x0
        enum class ESourceEffectDynamicsPeakMode PeakMode; // 0x1
        float LookAheadMsec; // 0x4
        float AttackTimeMsec; // 0x8
        float ReleaseTimeMsec; // 0xc
        float ThresholdDb; // 0x10
        float Ratio; // 0x14
        float KneeBandwidthDb; // 0x18
        float InputGainDb; // 0x1c
        float OutputGainDb; // 0x20
        char bStereoLinked; // 0x24
        char bAnalogMode; // 0x24

    };

    struct FSourceEffectEnvelopeFollowerSettings //ScriptStruct Synthesis.SourceEffectEnvelopeFollowerSettings
    {
    //Children Prop Count (Fields): 4
    public:

        float AttackTime; // 0x0
        float ReleaseTime; // 0x4
        enum class EEnvelopeFollowerPeakMode PeakMode; // 0x8
        bool bIsAnalogMode; // 0x9

    };

    struct FSourceEffectEQSettings //ScriptStruct Synthesis.SourceEffectEQSettings
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<struct FSourceEffectEQBand> EQBands; // 0x0

    };

    struct FSourceEffectEQBand //ScriptStruct Synthesis.SourceEffectEQBand
    {
    //Children Prop Count (Fields): 4
    public:

        float Frequency; // 0x0
        float Bandwidth; // 0x4
        float GainDb; // 0x8
        char bEnabled; // 0xc

    };

    struct FSourceEffectFilterSettings //ScriptStruct Synthesis.SourceEffectFilterSettings
    {
    //Children Prop Count (Fields): 4
    public:

        enum class ESourceEffectFilterCircuit FilterCircuit; // 0x0
        enum class ESourceEffectFilterType FilterType; // 0x1
        float CutoffFrequency; // 0x4
        float FilterQ; // 0x8

    };

    struct FSourceEffectFoldbackDistortionSettings //ScriptStruct Synthesis.SourceEffectFoldbackDistortionSettings
    {
    //Children Prop Count (Fields): 3
    public:

        float InputGainDb; // 0x0
        float ThresholdDb; // 0x4
        float OutputGainDb; // 0x8

    };

    struct FSourceEffectMidSideSpreaderSettings //ScriptStruct Synthesis.SourceEffectMidSideSpreaderSettings
    {
    //Children Prop Count (Fields): 4
    public:

        enum class EStereoChannelMode InputMode; // 0x0
        float SpreadAmount; // 0x4
        enum class EStereoChannelMode OutputMode; // 0x8
        bool bEqualPower; // 0x9

    };

    struct FSourceEffectPannerSettings //ScriptStruct Synthesis.SourceEffectPannerSettings
    {
    //Children Prop Count (Fields): 2
    public:

        float Spread; // 0x0
        float Pan; // 0x4

    };

    struct FSourceEffectPhaserSettings //ScriptStruct Synthesis.SourceEffectPhaserSettings
    {
    //Children Prop Count (Fields): 5
    public:

        float WetLevel; // 0x0
        float Frequency; // 0x4
        float Feedback; // 0x8
        enum class EPhaserLFOType LFOType; // 0xc
        bool UseQuadraturePhase; // 0xd

    };

    struct FSourceEffectRingModulationSettings //ScriptStruct Synthesis.SourceEffectRingModulationSettings
    {
    //Children Prop Count (Fields): 5
    public:

        enum class ERingModulatorTypeSourceEffect ModulatorType; // 0x0
        float Frequency; // 0x4
        float Depth; // 0x8
        float DryLevel; // 0xc
        float WetLevel; // 0x10

    };

    struct FSourceEffectSimpleDelaySettings //ScriptStruct Synthesis.SourceEffectSimpleDelaySettings
    {
    //Children Prop Count (Fields): 6
    public:

        float SpeedOfSound; // 0x0
        float DelayAmount; // 0x4
        float DryAmount; // 0x8
        float WetAmount; // 0xc
        float Feedback; // 0x10
        char bDelayBasedOnDistance; // 0x14

    };

    struct FSourceEffectStereoDelaySettings //ScriptStruct Synthesis.SourceEffectStereoDelaySettings
    {
    //Children Prop Count (Fields): 5
    public:

        enum class EStereoDelaySourceEffect DelayMode; // 0x0
        float DelayTimeMsec; // 0x4
        float Feedback; // 0x8
        float DelayRatio; // 0xc
        float WetLevel; // 0x10

    };

    struct FSourceEffectWaveShaperSettings //ScriptStruct Synthesis.SourceEffectWaveShaperSettings
    {
    //Children Prop Count (Fields): 2
    public:

        float Amount; // 0x0
        float OutputGainDb; // 0x4

    };

    struct FSubmixEffectConvolutionReverbSettings //ScriptStruct Synthesis.SubmixEffectConvolutionReverbSettings
    {
    //Children Prop Count (Fields): 7
    public:

        float NormalizationVolumeDb; // 0x0
        float SurroundRearChannelBleedDb; // 0x4
        bool bInvertRearChannelBleedPhase; // 0x8
        bool bSurroundRearChannelFlip; // 0x9
        float SurroundRearChannelBleedAmount; // 0xc
        class UAudioImpulseResponse* ImpulseResponse; // 0x10
        bool AllowHArdwareAcceleration; // 0x18

    };

    struct FSubmixEffectDelaySettings //ScriptStruct Synthesis.SubmixEffectDelaySettings
    {
    //Children Prop Count (Fields): 3
    public:

        float MaximumDelayLength; // 0x0
        float InterpolationTime; // 0x4
        float DelayLength; // 0x8

    };

    struct FSubmixEffectFilterSettings //ScriptStruct Synthesis.SubmixEffectFilterSettings
    {
    //Children Prop Count (Fields): 4
    public:

        enum class ESubmixFilterType FilterType; // 0x0
        enum class ESubmixFilterAlgorithm FilterAlgorithm; // 0x1
        float FilterFrequency; // 0x4
        float FilterQ; // 0x8

    };

    struct FSubmixEffectFlexiverbSettings //ScriptStruct Synthesis.SubmixEffectFlexiverbSettings
    {
    //Children Prop Count (Fields): 4
    public:

        float PreDelay; // 0x0
        float DecayTime; // 0x4
        float RoomDampening; // 0x8
        int32_t Complexity; // 0xc

    };

    struct FSubmixEffectTapDelaySettings //ScriptStruct Synthesis.SubmixEffectTapDelaySettings
    {
    //Children Prop Count (Fields): 3
    public:

        float MaximumDelayLength; // 0x0
        float InterpolationTime; // 0x4
        struct TArray<struct FTapDelayInfo> Taps; // 0x8

    };

    struct FTapDelayInfo //ScriptStruct Synthesis.TapDelayInfo
    {
    //Children Prop Count (Fields): 6
    public:

        enum class ETapLineMode TapLineMode; // 0x0
        float DelayLength; // 0x4
        float Gain; // 0x8
        int32_t OutputChannel; // 0xc
        float PanInDegrees; // 0x10
        int32_t TapId; // 0x14

    };

    struct FSynth2DSliderStyle : FSlateWidgetStyle //ScriptStruct Synthesis.Synth2DSliderStyle
    {
    //Children Prop Count (Fields): 6
    public:

        struct FSlateBrush NormalThumbImage; // 0x8
        struct FSlateBrush DisabledThumbImage; // 0x90
        struct FSlateBrush NormalBarImage; // 0x118
        struct FSlateBrush DisabledBarImage; // 0x1a0
        struct FSlateBrush BackgroundImage; // 0x228
        float BarThickness; // 0x2b0

    };

    struct FSynthKnobStyle : FSlateWidgetStyle //ScriptStruct Synthesis.SynthKnobStyle
    {
    //Children Prop Count (Fields): 7
    public:

        struct FSlateBrush LargeKnob; // 0x8
        struct FSlateBrush LargeKnobOverlay; // 0x90
        struct FSlateBrush MediumKnob; // 0x118
        struct FSlateBrush MediumKnobOverlay; // 0x1a0
        float MinValueAngle; // 0x228
        float MaxValueAngle; // 0x22c
        enum class ESynthKnobSize KnobSize; // 0x230

    };

    struct FSynthSlateStyle : FSlateWidgetStyle //ScriptStruct Synthesis.SynthSlateStyle
    {
    //Children Prop Count (Fields): 2
    public:

        enum class ESynthSlateSizeType SizeType; // 0x8
        enum class ESynthSlateColorStyle ColorStyle; // 0x9

    };

    struct FGroupRangeInfo //ScriptStruct VeiledExperts.GroupRangeInfo
    {
    //Children Prop Count (Fields): 9
    public:

        int32_t DefScore; // 0x0
        int32_t PlayerExistWeight; // 0x4
        int32_t PlayerNoneWeight; // 0x8
        float Height; // 0xc
        float ARadius; // 0x10
        float BRadius; // 0x14
        struct FColor AColor; // 0x18
        struct FColor BColor; // 0x1c
        float Bold; // 0x20

    };

    struct FActionNotifyData //ScriptStruct VeiledExperts.ActionNotifyData
    {
    //Children Prop Count (Fields): 5
    public:

        struct FName EventName; // 0x0
        class UCurveBase* Curve; // 0x8
        struct FVector EventVector; // 0x10
        class UAnimSequenceBase* NotifyAnimSequence; // 0x28
        enum class ECameraMovementType CameraMovement; // 0x30

    };

    struct FParkourHandOffset : FTableRowBase //ScriptStruct VeiledExperts.ParkourHandOffset
    {
    //Children Prop Count (Fields): 2
    public:

        float LeftHandOffset; // 0x8
        float RightHandOffset; // 0xc

    };

    struct FPDAS_HPAnimEvent //ScriptStruct VeiledExperts.PDAS_HPAnimEvent
    {
    //Children Prop Count (Fields): 6
    public:

        int32_t HP; // 0x0
        int32_t AnimIndex; // 0x4
        int32_t EffectID; // 0x8
        struct FName SocketName; // 0xc
        struct FString SoundName; // 0x18
        class UStaticMesh* MeshForDS; // 0x28

    };

    struct FPDAudioSwitch //ScriptStruct VeiledExperts.PDAudioSwitch
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString Group; // 0x0
        struct FString Switch; // 0x10

    };

    struct FAutoBreakSettings //ScriptStruct VeiledExperts.AutoBreakSettings
    {
    //Children Prop Count (Fields): 2
    public:

        enum class EGameModeInternal GameMode; // 0x0
        struct TArray<struct FAutoBreakSetting> Settings; // 0x8

    };

    struct FAutoBreakSetting //ScriptStruct VeiledExperts.AutoBreakSetting
    {
    //Children Prop Count (Fields): 3
    public:

        int32_t Round; // 0x0
        int32_t MinTimeToBreak; // 0x4
        int32_t MaxTimeToBreak; // 0x8

    };

    struct FPDButtonOutLine //ScriptStruct VeiledExperts.PDButtonOutLine
    {
    //Children Prop Count (Fields): 6
    public:

        struct FAnchors Anchors; // 0x0
        struct FMargin Offsets; // 0x10
        struct FVector2D Alignment; // 0x20
        bool bSizeToContent; // 0x28
        struct FSlateBrush OutLineStyle; // 0x30
        struct FLinearColor BrushColor; // 0xb8

    };

    struct FAnchors //ScriptStruct Slate.Anchors
    {
    //Children Prop Count (Fields): 2
    public:

        struct FVector2D Minimum; // 0x0
        struct FVector2D Maximum; // 0x8

    };

    struct FPDCameraGroupPlayData //ScriptStruct VeiledExperts.PDCameraGroupPlayData
    {
    //Children Prop Count (Fields): 3
    public:

        enum class EPDCamGroupPlayParam Type; // 0x0
        float Duration; // 0x4
        class UCurveFloat* SpeedCurve; // 0x8

    };

    struct FPDCameraPlayData //ScriptStruct VeiledExperts.PDCameraPlayData
    {
    //Children Prop Count (Fields): 5
    public:

        enum class EPDCamPlayParam Type; // 0x0
        struct FVector TargetLocation; // 0x4
        struct FText TargetString; // 0x10
        float StartTime; // 0x28
        float Duration; // 0x2c

    };

    struct FActionTaskData //ScriptStruct VeiledExperts.ActionTaskData
    {
    //Children Prop Count (Fields): 11
    public:

        bool BoolValue0; // 0x0
        bool BoolValue1; // 0x1
        int32_t IntValue0; // 0x4
        int32_t IntValue1; // 0x8
        float FloatValue0; // 0xc
        float FloatValue1; // 0x10
        struct FVector VectorValue0; // 0x14
        struct FVector VectorValue1; // 0x20
        struct FTransform TransformValue; // 0x30
        class UObject* ObjectValue0; // 0x60
        class UObject* ObjectValue1; // 0x68

    };

    struct FPDAnimGraphAimingValues //ScriptStruct VeiledExperts.PDAnimGraphAimingValues
    {
    //Children Prop Count (Fields): 1
    public:

        struct FRotator SpineRotation; // 0x0

    };

    struct FWeaponAnimDataSet //ScriptStruct VeiledExperts.WeaponAnimDataSet
    {
    //Children Prop Count (Fields): 1
    public:

        class UAnimMontage* Fire; // 0x0

    };

    struct FBulletWeaponAnimDataSet : FWeaponAnimDataSet //ScriptStruct VeiledExperts.BulletWeaponAnimDataSet
    {
    //Children Prop Count (Fields): 1
    public:

        class UAnimMontage* Reload; // 0x8

    };

    struct FPDPlayerAnimDatas : FTableRowBase //ScriptStruct VeiledExperts.PDPlayerAnimDatas
    {
    //Children Prop Count (Fields): 3
    public:

        struct FPDPerCharacterAnimDatas PerCharacterAnimDatas; // 0x8
        struct FPDPerWeaponAnimDatas PerWeaponAnimDatas; // 0xe88
        struct FPDPerSpecificWeaponAnimDatas PerSpecificWeaponAnimDatas; // 0x4110

    };

    struct FPDPerSpecificWeaponAnimDatas //ScriptStruct VeiledExperts.PDPerSpecificWeaponAnimDatas
    {
    //Children Prop Count (Fields): 31
    public:

        class UAnimSequence* Stance; // 0x0
        class UAnimMontage* ReloadWeapon_Stand; // 0x8
        class UAnimMontage* ReloadWeapon_Crouch; // 0x10
        class UAnimMontage* QuickReloadWeapon_Stand; // 0x18
        class UAnimMontage* QuickReloadWeapon_Crouch; // 0x20
        class UAnimMontage* SlowReloadWeapon_Stand; // 0x28
        class UAnimMontage* SlowReloadWeapon_Crouch; // 0x30
        class UAnimMontage* FireWeapon_FP; // 0x38
        class UAnimMontage* BoltActionFP; // 0x40
        class UAnimSequence* Weapon_ReloadEmpty; // 0x48
        class UAnimSequence* Weapon_ReloadNotEmpty; // 0x50
        class UAnimSequence* Weapon_FireEmpty; // 0x58
        class UAnimSequence* Weapon_FireNotEmpty; // 0x60
        class UAnimSequence* Weapon_BoltAction; // 0x68
        class UAnimSequence* Weapon_ReloadEmptyEnd; // 0x70
        class UAnimSequence* Weapon_Idle; // 0x78
        class UAnimSequence* Weapon_QuickReloadEmpty; // 0x80
        class UAnimSequence* Weapon_QuickReloadEmptyEnd; // 0x88
        class UAnimSequence* Weapon_Slow_Reload_Empty; // 0x90
        class UAnimSequence* Weapon_Slow_Reload_EmptyEnd; // 0x98
        class UAnimSequence* Weapon_Slow_Reload_NotEmpty; // 0xa0
        class UAnimSequence* Weapon_Draw; // 0xa8
        class UAnimMontage* Aim_Charge_Stand; // 0xb0
        class UAnimMontage* Aim_Charge_Crouch; // 0xb8
        float ADSAimYaw; // 0xc0
        float ADSPlusAimPitch_Stn; // 0xc4
        float ADSPlusAimPitch_Cro; // 0xc8
        float ADSPlusAimPitch_CroWalk; // 0xcc
        float ADSPlusAimPitch_Stn_Lean; // 0xd0
        float ADSPlusAimPitch_Cro_Lean; // 0xd4
        float ADSPlusAimPitch_CroWalk_Lean; // 0xd8

    };

    struct FPDPerWeaponAnimDatas //ScriptStruct VeiledExperts.PDPerWeaponAnimDatas
    {
    //Children Prop Count (Fields): 5
    public:

        struct FPDPWUsingInABPAnimDatas UsingInABPAnimDatas; // 0x0
        struct FPDLandActionAnimDatas LandAnimDatas; // 0x128
        struct FPDMeleeActionAnimDatas MeleeActionAnimDatas; // 0x130
        struct FPDWeaponHandlingAnimDatas WeaponHandlingAnimDatas; // 0x150
        struct FPDPWParkourAnimDatas ParkourDatas; // 0x220

    };

    struct FPDPWParkourAnimDatas //ScriptStruct VeiledExperts.PDPWParkourAnimDatas
    {
    //Children Prop Count (Fields): 9
    public:

        class UAnimMontage* Roll_F; // 0x0
        class UAnimMontage* Roll_F02; // 0x8
        class UAnimMontage* Roll_F03; // 0x10
        class UAnimMontage* Roll_F04; // 0x18
        class UAnimMontage* Roll_B; // 0x20
        class UAnimMontage* Roll_L; // 0x28
        class UAnimMontage* Roll_R; // 0x30
        class UAnimMontage* Jump_FP; // 0x38
        class UAnimMontage* Land_FP; // 0x40

    };

    struct FPDWeaponHandlingAnimDatas //ScriptStruct VeiledExperts.PDWeaponHandlingAnimDatas
    {
    //Children Prop Count (Fields): 26
    public:

        class UAnimMontage* Stand_FireWeapon; // 0x0
        class UAnimMontage* Crouch_FireWeapon; // 0x8
        class UAnimMontage* Stand_Fire_HipFire; // 0x10
        class UAnimMontage* Crouch_Fire_HipFire; // 0x18
        class UAnimMontage* Stand_FireWeapon_FP; // 0x20
        class UAnimMontage* Crouch_FireWeapon_FP; // 0x28
        class UAnimMontage* Crouch_Walk_Fire_HipFire; // 0x30
        class UAnimMontage* Crouch_Walk_Fire_ADS; // 0x38
        class UBlendSpace* Stand_FireRecoil_HipFire; // 0x40
        class UBlendSpace* Crouch_FireRecoil_HipFire; // 0x48
        class UBlendSpace* Stand_FireRecoil_ADS; // 0x50
        class UBlendSpace* Crouch_FireRecoil_ADS; // 0x58
        class UBlendSpace* Stand_FireRecoil_ADS_FP; // 0x60
        class UBlendSpace* Crouch_FireRecoil_ADS_FP; // 0x68
        class UBlendSpace* Crouch_Walk_FireRecoil_HipFire; // 0x70
        class UPDFireRecoilLevelData* FireRecoilLeveldata; // 0x78
        class UPDFireRecoilLevelData* FireRecoilLeveldata_FP; // 0x80
        class UAnimMontage* ReloadWeapon_Stand; // 0x88
        class UAnimMontage* ReloadWeapon_Crouch; // 0x90
        class UAnimMontage* ReloadWeapon_Groggy; // 0x98
        class UAnimMontage* HolsterWeapon; // 0xa0
        class UAnimMontage* DrawWeapon; // 0xa8
        class UAnimMontage* DrawWeapon_FP; // 0xb0
        class UAnimMontage* BoltAction; // 0xb8
        class UAnimMontage* BoltAction_Crouch; // 0xc0
        class UAnimMontage* BoltAction_Groggy; // 0xc8

    };

    struct FPDMeleeActionAnimDatas //ScriptStruct VeiledExperts.PDMeleeActionAnimDatas
    {
    //Children Prop Count (Fields): 4
    public:

        class UAnimMontage* Melee_Attack_DefAtt; // 0x0
        class UAnimMontage* Melee_Attack_LBTAtt; // 0x8
        class UAnimMontage* Melee_Attack_RBTAtt; // 0x10
        class UAnimMontage* Melee_Attack_FallAtt; // 0x18

    };

    struct FPDLandActionAnimDatas //ScriptStruct VeiledExperts.PDLandActionAnimDatas
    {
    //Children Prop Count (Fields): 1
    public:

        class UAnimMontage* SoftLand; // 0x0

    };

    struct FPDPWUsingInABPAnimDatas //ScriptStruct VeiledExperts.PDPWUsingInABPAnimDatas
    {
    //Children Prop Count (Fields): 37
    public:

        class UAnimSequence* Loco_Stand_Idle; // 0x0
        class UAnimSequence* Loco_Crouch_Idle; // 0x8
        class UAnimSequence* Loco_Stand_HipFireIdle; // 0x10
        class UAnimSequence* Loco_Crouch_HipFireIdle; // 0x18
        class UAnimSequence* Loco_Stand_ADSIdle; // 0x20
        class UAnimSequence* Loco_Crouch_ADSIdle; // 0x28
        class UAnimSequence* Loco_Stand_Fall; // 0x30
        class UAnimSequence* Loco_Crouch_Fall; // 0x38
        class UAnimSequence* StandToCrouch; // 0x40
        class UAnimSequence* CrouchToStand; // 0x48
        class UAnimSequence* StandToCrouch_ADS; // 0x50
        class UAnimSequence* CrouchToStand_ADS; // 0x58
        class UAnimSequence* Loco_Crouch_Walk_HipFireIdle; // 0x60
        class UBlendSpace* Loco_Stand_Run; // 0x68
        class UBlendSpace* Loco_Crouch_Run; // 0x70
        class UBlendSpace* Loco_Stand_Run_ADS; // 0x78
        class UBlendSpace* Loco_Crouch_Run_ADS; // 0x80
        class UBlendSpace* Loco_Stand_RunStart; // 0x88
        class UAnimSequence* Loco_Stand_RunStart_L; // 0x90
        class UAnimSequence* Loco_Stand_RunStart_R; // 0x98
        class UBlendSpace* Loco_Crouch_RunStart; // 0xa0
        class UAnimSequence* Loco_Stand_Fall_FP; // 0xa8
        class UBlendSpace* Loco_Stand_Walk_FP; // 0xb0
        class UAnimSequence* WaitBeforePlay_Stand_FP; // 0xb8
        class UAnimSequence* Stance; // 0xc0
        class UBlendSpaceBase* AO_Lean_Stand; // 0xc8
        class UBlendSpaceBase* AO_Lean_Crouch; // 0xd0
        class UBlendSpaceBase* AO_Stand_HipFire; // 0xd8
        class UBlendSpaceBase* AO_Crouch_HipFire; // 0xe0
        class UBlendSpaceBase* AO_Stand_ADS; // 0xe8
        class UBlendSpaceBase* AO_Crouch_ADS; // 0xf0
        class UBlendSpaceBase* AO_Crouch_Walk_HipFire; // 0xf8
        class UAnimSequence* Stand_LeanR_ADS; // 0x100
        class UAnimSequence* Crouch_LeanR_ADS; // 0x108
        class UAnimSequence* Stand_LeanR_HF; // 0x110
        class UAnimSequence* Crouch_LeanR_HF; // 0x118
        class UAnimSequence* Crouch_LeanR_Walk_HF; // 0x120

    };

    struct FPDPerCharacterAnimDatas //ScriptStruct VeiledExperts.PDPerCharacterAnimDatas
    {
    //Children Prop Count (Fields): 20
    public:

        struct FPDPCUsingInABPAnimDatas UsingInABPAnimDatas; // 0x0
        struct FPDLeanAnimDatas LeanAnimData; // 0x60
        struct FPDTurnAnimDatas TurnAnimDatas; // 0x68
        struct FPDParkourActionAnimDatas ParkourAnimDatas; // 0x128
        struct FPDClimbActionAnimDatas ClimbActionAnimDatas; // 0x2d8
        struct FPDGroggyActionAnimDatas GroggyActionAnimDatas; // 0x340
        struct FPDInteractionActionAnimDatas InteractionActionAnimDatas; // 0x3c0
        struct FPDItemUseActionAnimDatas ItemUseActionAnimDatas; // 0x408
        struct FPDDeathAnimData DeathAnimData; // 0x438
        struct FPDKnockbackAnimData KnockbackAnimData; // 0x478
        struct FPDPerkAnimDatas PerkAnimData; // 0x4c8
        struct FPDZiplineAnimData ZipLineAnimData; // 0x4e8
        struct FPDSignatureAnimDatas SignatureAnimData; // 0x4f8
        struct FPDSlideAnimDatas SlideAnimData; // 0x560
        struct FPDHitReactionAnimData HitReactionAnimData; // 0x580
        struct FPDWearJuggernautAnimData WearJuggernautAnimData; // 0x6d0
        struct FPDCQCAnimData CQC_FemaleCommonAnimData; // 0x700
        struct FPDCQCAnimData CQC_MaleCommonAnimData; // 0x718
        struct FPDSummonNPCAnimData SummonNPC_AnimData; // 0x730
        struct FPDPerAgentAnimData PerAgentAnimData; // 0x748

    };

    struct FPDPerAgentAnimData //ScriptStruct VeiledExperts.PDPerAgentAnimData
    {
    //Children Prop Count (Fields): 4
    public:

        struct FPDAFKAnimData AFKAnimData; // 0x0
        struct FPDSceneDirectionAnimData SceneDirectionAnimData; // 0x58
        struct FPDAttackAnimData AttackAnimData; // 0x88
        struct FPDCQCAnimData CQC_AnimData; // 0x90

    };

    struct FPDCQCAnimData //ScriptStruct VeiledExperts.PDCQCAnimData
    {
    //Children Prop Count (Fields): 4
    public:

        class UAnimMontage* CQCAttack; // 0x0
        class UAnimMontage* CQCDamage; // 0x8
        float CQC_KnockBackSpaceCheckLength; // 0x10
        float CQC_KnockBackSpaceCheckLength_Groggy; // 0x14

    };

    struct FPDAttackAnimData //ScriptStruct VeiledExperts.PDAttackAnimData
    {
    //Children Prop Count (Fields): 1
    public:

        class UAnimMontage* Execution; // 0x0

    };

    struct FPDSceneDirectionAnimData //ScriptStruct VeiledExperts.PDSceneDirectionAnimData
    {
    //Children Prop Count (Fields): 4
    public:

        class UAnimMontage* RoundEnterSeriousAnim; // 0x0
        struct TArray<int32_t> SeriousAnimLinkedKeyType; // 0x8
        class UAnimMontage* RoundEnterLightAnim; // 0x18
        struct TArray<int32_t> LightAnimLinkedKeyType; // 0x20

    };

    struct FPDAFKAnimData //ScriptStruct VeiledExperts.PDAFKAnimData
    {
    //Children Prop Count (Fields): 11
    public:

        class UAnimMontage* RifleStand; // 0x0
        class UAnimMontage* RifleCrouch; // 0x8
        uint32_t RiflePercentTypeD; // 0x10
        class UAnimMontage* HGStand; // 0x18
        class UAnimMontage* HGCrouch; // 0x20
        class UAnimMontage* ThrowStand; // 0x28
        class UAnimMontage* ThrowCrouch; // 0x30
        class UAnimMontage* MeleeStand; // 0x38
        class UAnimMontage* MeleeCrouch; // 0x40
        class UAnimMontage* BowStand; // 0x48
        class UAnimMontage* BowCrouch; // 0x50

    };

    struct FPDSummonNPCAnimData //ScriptStruct VeiledExperts.PDSummonNPCAnimData
    {
    //Children Prop Count (Fields): 3
    public:

        class UAnimMontage* Common; // 0x0
        class UAnimMontage* SummonUPS; // 0x8
        class UAnimMontage* SummonDrone; // 0x10

    };

    struct FPDWearJuggernautAnimData //ScriptStruct VeiledExperts.PDWearJuggernautAnimData
    {
    //Children Prop Count (Fields): 3
    public:

        class UAnimMontage* WearJuggernaut; // 0x0
        class UAnimMontage* JuggernautDash; // 0x8
        class UAnimMontage* JuggernautLauncher; // 0x10

    };

    struct FPDHitReactionAnimData //ScriptStruct VeiledExperts.PDHitReactionAnimData
    {
    //Children Prop Count (Fields): 36
    public:

        class UAnimMontage* AM_BurnReactionAnim; // 0x0
        class UAnimMontage* AM_NormalHitAnimA; // 0x8
        class UAnimMontage* AM_NormalHitAnimB; // 0x10
        class UAnimMontage* AM_NormalHitAnimC; // 0x18
        struct TArray<class UAnimMontage*> FowardNormalHitAnims; // 0x20
        struct TArray<class UAnimMontage*> BackNormalHitAnims; // 0x30
        struct TArray<class UAnimMontage*> LeftNormalHitAnims; // 0x40
        struct TArray<class UAnimMontage*> RightNormalHitAnims; // 0x50
        struct TArray<class UAnimMontage*> HitHeadAnims; // 0x60
        struct TArray<class UAnimMontage*> BulletGrazeAnimsStand; // 0x70
        struct TArray<class UAnimMontage*> BulletGrazeAnimsCrouch; // 0x80
        struct TArray<class UAnimMontage*> BombGrazeAnimsStand; // 0x90
        struct TArray<class UAnimMontage*> BombGrazeAnimsCrouch; // 0xa0
        class UAnimMontage* AM_RunHitAnimA; // 0xb0
        class UAnimMontage* AM_RunHitAnimB; // 0xb8
        class UAnimMontage* AM_RunHitAnimC; // 0xc0
        struct FRotator HitReactionRotation; // 0xc8
        float HitReactionAngleFoward; // 0xd4
        float HitReactionAngleLeft; // 0xd8
        float HitReactionAngleRight; // 0xdc
        float HitReactionAngleBack; // 0xe0
        class UCurveFloat* HitReactionRotationCurve; // 0xe8
        float NoramlHitMotionFrequency_Local; // 0xf0
        float NoramlHitMotionFrequency_Remote; // 0xf4
        float RunHitMotionFrequency_Local; // 0xf8
        float RunHitMotionFrequency_Remote; // 0xfc
        float FirstHitTime; // 0x100
        class UAnimMontage* AM_Lower_Right_HitAnim; // 0x108
        class UAnimMontage* AM_Lower_Left_HitAnim; // 0x110
        float HitDelay; // 0x118
        class UAnimMontage* AM_UpperBody_WeakCenter; // 0x120
        class UAnimMontage* AM_UpperBody_WeakLeft; // 0x128
        class UAnimMontage* AM_UpperBody_WeakRight; // 0x130
        class UAnimMontage* AM_UpperBody_StrongCenter; // 0x138
        class UAnimMontage* AM_UpperBody_StrongLeft; // 0x140
        class UAnimMontage* AM_UpperBody_StrongRight; // 0x148

    };

    struct FPDSlideAnimDatas //ScriptStruct VeiledExperts.PDSlideAnimDatas
    {
    //Children Prop Count (Fields): 4
    public:

        class UAnimMontage* SlideEnter; // 0x0
        class UAnimMontage* SlideExitDefault; // 0x8
        class UAnimMontage* SlideExitRoll; // 0x10
        class UAnimMontage* SlideExitGroggy; // 0x18

    };

    struct FPDSignatureAnimDatas //ScriptStruct VeiledExperts.PDSignatureAnimDatas
    {
    //Children Prop Count (Fields): 13
    public:

        class UAnimMontage* RevolverSpinning; // 0x0
        class UAnimMontage* DrinkBottle; // 0x8
        class UAnimMontage* EatHotDog; // 0x10
        class UAnimMontage* LickKnife; // 0x18
        class UAnimMontage* CoinToss; // 0x20
        class UAnimMontage* GlassesScan; // 0x28
        class UAnimMontage* LookMagnifier; // 0x30
        class UAnimMontage* ShootFlare; // 0x38
        class UAnimMontage* SprayMoney; // 0x40
        class UAnimMontage* Warcry; // 0x48
        class UAnimMontage* SpinSickle; // 0x50
        class UAnimMontage* TurnTable; // 0x58
        class UAnimMontage* FeverTurnTable; // 0x60

    };

    struct FPDZiplineAnimData //ScriptStruct VeiledExperts.PDZiplineAnimData
    {
    //Children Prop Count (Fields): 2
    public:

        class UAnimMontage* ZiplineEnter; // 0x0
        class UAnimMontage* ZiplineRide; // 0x8

    };

    struct FPDPerkAnimDatas //ScriptStruct VeiledExperts.PDPerkAnimDatas
    {
    //Children Prop Count (Fields): 4
    public:

        class UAnimMontage* RobCoin; // 0x0
        class UAnimMontage* ReviveInGroggy; // 0x8
        class UAnimMontage* Hacking; // 0x10
        class UAnimMontage* Maintenance; // 0x18

    };

    struct FPDKnockbackAnimData //ScriptStruct VeiledExperts.PDKnockbackAnimData
    {
    //Children Prop Count (Fields): 10
    public:

        class UAnimMontage* Knockback_WeakCenter; // 0x0
        class UAnimMontage* Knockback_WeakLeft; // 0x8
        class UAnimMontage* Knockback_WeakRight; // 0x10
        class UAnimMontage* Knockback_MidCenter; // 0x18
        class UAnimMontage* Knockback_MidLeft; // 0x20
        class UAnimMontage* Knockback_MidRight; // 0x28
        class UAnimMontage* Knockback_StrongCenter; // 0x30
        class UAnimMontage* Knockback_StrongLeft; // 0x38
        class UAnimMontage* Knockback_StrongRight; // 0x40
        class UAnimMontage* Knockback_FallingObject; // 0x48

    };

    struct FPDDeathAnimData //ScriptStruct VeiledExperts.PDDeathAnimData
    {
    //Children Prop Count (Fields): 8
    public:

        class UAnimMontage* Death_Random; // 0x0
        class UAnimMontage* Death_GROGGY_Random; // 0x8
        class UAnimMontage* Death_Groggy_By_Soccer_Kick; // 0x10
        class UAnimMontage* Death_GROGGY_Fall; // 0x18
        class UAnimMontage* Death_CLIMB_2P; // 0x20
        class UAnimMontage* Death_CLIMB_4P; // 0x28
        class UAnimMontage* Death_Front_KnockBack; // 0x30
        class UAnimMontage* Death_Back_KnockBack; // 0x38

    };

    struct FPDItemUseActionAnimDatas //ScriptStruct VeiledExperts.PDItemUseActionAnimDatas
    {
    //Children Prop Count (Fields): 6
    public:

        class UAnimMontage* Bandage; // 0x0
        class UAnimMontage* Painkiller; // 0x8
        class UAnimMontage* ArmorPlateReplaceKit; // 0x10
        class UAnimMontage* Bandage_CLI; // 0x18
        class UAnimMontage* Painkiller_CLI; // 0x20
        class UAnimMontage* ArmorPlateReplaceKit_CLI; // 0x28

    };

    struct FPDInteractionActionAnimDatas //ScriptStruct VeiledExperts.PDInteractionActionAnimDatas
    {
    //Children Prop Count (Fields): 9
    public:

        class UAnimMontage* PickItem_Crouch_Left; // 0x0
        class UAnimMontage* PickItem_Crouch_Right; // 0x8
        class UAnimMontage* PickItem_Stand_Left; // 0x10
        class UAnimMontage* PickItem_Stand_Right; // 0x18
        class UAnimMontage* Door_HingeOpen; // 0x20
        class UAnimMontage* GroggyRescue; // 0x28
        class UAnimMontage* Bomb; // 0x30
        class UAnimMontage* Bomb_Crouch; // 0x38
        class UAnimMontage* Bomb_Groggy; // 0x40

    };

    struct FPDGroggyActionAnimDatas //ScriptStruct VeiledExperts.PDGroggyActionAnimDatas
    {
    //Children Prop Count (Fields): 16
    public:

        class UAnimMontage* Enter_MeleeHit; // 0x0
        class UAnimMontage* Enter_Random_Hit_Head; // 0x8
        class UAnimMontage* Enter_Random_Hit_Chest; // 0x10
        class UAnimMontage* Enter_Random_Hit_Abdomen; // 0x18
        class UAnimMontage* Enter_Random_Hit_LeftLeg; // 0x20
        class UAnimMontage* Enter_Random_Hit_RightLeg; // 0x28
        class UAnimMontage* Exit; // 0x30
        class UAnimMontage* FallEnter; // 0x38
        class UAnimMontage* FallLand; // 0x40
        class UAnimMontage* Climb2PEnter; // 0x48
        class UAnimMontage* Climb4PEnter; // 0x50
        class UAnimMontage* SlideEnter; // 0x58
        class UAnimMontage* InertiaEnter; // 0x60
        class UAnimMontage* FrontKnockBackEnter; // 0x68
        class UAnimMontage* BackKnockBackEnter; // 0x70
        class UAnimMontage* BurnEnter; // 0x78

    };

    struct FPDClimbActionAnimDatas //ScriptStruct VeiledExperts.PDClimbActionAnimDatas
    {
    //Children Prop Count (Fields): 13
    public:

        class UAnimMontage* ClimbEnter; // 0x0
        class UAnimMontage* ClimbLedgeGrap; // 0x8
        class UAnimMontage* ClimbExit; // 0x10
        class UAnimMontage* ClimbExit_2PJump; // 0x18
        class UAnimMontage* ClimbExit_4PJump; // 0x20
        class UAnimMontage* ClimbMove_Turn; // 0x28
        class UAnimMontage* ClimbMove_2P; // 0x30
        class UAnimMontage* ClimbMove_2PWide; // 0x38
        class UAnimMontage* ClimbMove_4P; // 0x40
        class UAnimMontage* ClimbMove_4PWide; // 0x48
        class UAnimMontage* ClimbJump_2P; // 0x50
        class UAnimMontage* ClimbJump_4P; // 0x58
        class UAnimMontage* ClimbLongJump_4P; // 0x60

    };

    struct FPDParkourActionAnimDatas //ScriptStruct VeiledExperts.PDParkourActionAnimDatas
    {
    //Children Prop Count (Fields): 54
    public:

        class UAnimMontage* Jump; // 0x0
        class UAnimMontage* Jump_Sprint; // 0x8
        class UAnimMontage* Jump_Long01; // 0x10
        class UAnimMontage* Jump_Long02; // 0x18
        class UAnimMontage* Jump_Long03; // 0x20
        class UAnimMontage* Jump_Long04; // 0x28
        class UAnimMontage* SoftLand; // 0x30
        class UAnimMontage* AutoRollLand; // 0x38
        class UAnimMontage* HardLand; // 0x40
        class UAnimMontage* HardLand1; // 0x48
        class UAnimMontage* HardLand2; // 0x50
        class UAnimMontage* HardLand1_Move; // 0x58
        class UAnimMontage* HardLand2_Move; // 0x60
        class UAnimMontage* groggyland; // 0x68
        class UAnimMontage* DamageLand; // 0x70
        class UAnimMontage* Roll_F01; // 0x78
        class UAnimMontage* Roll_F02; // 0x80
        class UAnimMontage* Roll_F03; // 0x88
        class UAnimMontage* Roll_F04; // 0x90
        class UAnimMontage* Roll_B; // 0x98
        class UAnimMontage* Roll_L; // 0xa0
        class UAnimMontage* Roll_R; // 0xa8
        class UAnimMontage* GRO_Roll_F; // 0xb0
        class UAnimMontage* GRO_Roll_B; // 0xb8
        class UAnimMontage* GRO_Roll_L; // 0xc0
        class UAnimMontage* GRO_Roll_R; // 0xc8
        class UAnimMontage* Vault_100_Walk; // 0xd0
        class UAnimMontage* Vault_100_Run; // 0xd8
        class UAnimMontage* Vault_150_Walk; // 0xe0
        class UAnimMontage* Vault_150_Run; // 0xe8
        class UAnimMontage* Vault_200_Walk; // 0xf0
        class UAnimMontage* Vault_200_Run; // 0xf8
        class UAnimMontage* Vault_250_Walk; // 0x100
        class UAnimMontage* Vault_250_Run; // 0x108
        class UAnimMontage* Vault_300_Walk; // 0x110
        class UAnimMontage* Vault_300_Run; // 0x118
        class UAnimMontage* Climbup_51; // 0x120
        class UAnimMontage* Climbup_100_Walk; // 0x128
        class UAnimMontage* Climbup_100_Run; // 0x130
        class UAnimMontage* Climbup_150_Walk; // 0x138
        class UAnimMontage* Climbup_150_Run; // 0x140
        class UAnimMontage* Climbup_200_Walk; // 0x148
        class UAnimMontage* Climbup_200_Run; // 0x150
        class UAnimMontage* Climbup_250_Walk; // 0x158
        class UAnimMontage* Climbup_250_Run; // 0x160
        class UAnimMontage* Climbup_300_Walk; // 0x168
        class UAnimMontage* Climbup_300_Run; // 0x170
        class UAnimMontage* Climbup_2P_Walk; // 0x178
        class UAnimMontage* Climbup_2P_Run; // 0x180
        class UAnimMontage* ClimbupMoveStart_101; // 0x188
        class UAnimMontage* ClimbupMoveStart_200_301; // 0x190
        class UAnimMontage* LedgeGrapVault; // 0x198
        class UAnimMontage* LedgeGrapClimbupFull; // 0x1a0
        class UAnimMontage* LedgeGrapClimbupHalf; // 0x1a8

    };

    struct FPDTurnAnimDatas //ScriptStruct VeiledExperts.PDTurnAnimDatas
    {
    //Children Prop Count (Fields): 24
    public:

        class UAnimMontage* Loco_Stand_TurnInPlaceLeft; // 0x0
        class UAnimMontage* Loco_Stand_TurnInPlaceRight; // 0x8
        class UAnimMontage* Loco_Stand_TurnInPlaceLeft_GunStance; // 0x10
        class UAnimMontage* Loco_Stand_TurnInPlaceRight_GunStance; // 0x18
        class UAnimMontage* Loco_Crouch_TurnInPlaceLeft; // 0x20
        class UAnimMontage* Loco_Crouch_TurnInPlaceRight; // 0x28
        class UAnimMontage* Loco_Crouch_TurnInPlaceLeft_GunStance; // 0x30
        class UAnimMontage* Loco_Crouch_TurnInPlaceRight_GunStance; // 0x38
        class UAnimMontage* Loco_Groggy_TurnInPlaceLeft; // 0x40
        class UAnimMontage* Loco_Groggy_TurnInPlaceRight; // 0x48
        class UAnimMontage* Stand_AlignRotation_TurnLeft; // 0x50
        class UAnimMontage* Stand_AlignRoatation_TurnRight; // 0x58
        class UAnimMontage* Crouch_AlignRoatation_TurnLeft; // 0x60
        class UAnimMontage* Crouch_AlignRotation_TurnRight; // 0x68
        class UAnimMontage* Mirror_Turn_Stn; // 0x70
        class UAnimMontage* Mirror_Turn_Cro; // 0x78
        class UAnimMontage* Stand_TurnInPlaceLeft_Glock; // 0x80
        class UAnimMontage* Stand_TurnInPlaceRight_Glock; // 0x88
        class UAnimMontage* Crouch_TurnInPlaceLeft_Glock; // 0x90
        class UAnimMontage* Crouch_TurnInPlaceRight_Glock; // 0x98
        class UAnimMontage* Stand_TurnInPlaceLeft_Bow; // 0xa0
        class UAnimMontage* Stand_TurnInPlaceRight_Bow; // 0xa8
        class UAnimMontage* Crouch_TurnInPlaceLeft_Bow; // 0xb0
        class UAnimMontage* Crouch_TurnInPlaceRight_Bow; // 0xb8

    };

    struct FPDLeanAnimDatas //ScriptStruct VeiledExperts.PDLeanAnimDatas
    {
    //Children Prop Count (Fields): 1
    public:

        class UAnimMontage* Lean_Loop; // 0x0

    };

    struct FPDPCUsingInABPAnimDatas //ScriptStruct VeiledExperts.PDPCUsingInABPAnimDatas
    {
    //Children Prop Count (Fields): 12
    public:

        class UBlendSpace* Loco_Climb_2P; // 0x0
        class UBlendSpace* Loco_Climb_4P; // 0x8
        class UAnimSequence* Loco_Groggy_Idle_Bare; // 0x10
        class UAnimSequence* Loco_Groggy_Idle_HG; // 0x18
        class UBlendSpace* Loco_Groggy_Run_Bare; // 0x20
        class UBlendSpace* Loco_Groggy_Run_HG; // 0x28
        class UAnimSequence* Loco_Fall_Groggy_Idle_Bare; // 0x30
        class UAnimSequence* Loco_Climb_Groggy_Idle_Bare; // 0x38
        class UBlendSpaceBase* AO_Groggy_Bare; // 0x40
        class UBlendSpaceBase* AO_Groggy_HG; // 0x48
        class UBlendSpace* Loco_Slide_Default; // 0x50
        class UBlendSpace* Loco_Slide_Groggy; // 0x58

    };

    struct FPDLobbyCharacterAnimData : FTableRowBase //ScriptStruct VeiledExperts.PDLobbyCharacterAnimData
    {
    //Children Prop Count (Fields): 1
    public:

        struct FPDLobbyAnimData LobbyAnimData; // 0x8

    };

    struct FPDLobbyAnimData //ScriptStruct VeiledExperts.PDLobbyAnimData
    {
    //Children Prop Count (Fields): 16
    public:

        class UAnimSequence* Lobby_Scene_Select; // 0x0
        class UAnimSequence* Lobby_Scene_Idle_2; // 0x8
        class UAnimSequence* Lobby_Scene_Matching_Start; // 0x10
        class UAnimSequence* Lobby_Scene_Matching_Idle; // 0x18
        class UAnimSequence* Lobby_Scene_Matching_Cancel; // 0x20
        class UAnimSequence* Lobby_Scene_Customizing; // 0x28
        struct TArray<struct FPDResultAnimSequence> Result_Scene_Win; // 0x30
        struct TArray<struct FPDResultAnimSequence> Result_Scene_Lose; // 0x40
        class UAnimSequence* Lobby_Scene_Select_Hair; // 0x50
        class UAnimSequence* Lobby_Scene_Idle_Hair_2; // 0x58
        class UAnimSequence* Lobby_Scene_Matching_Start_Hair; // 0x60
        class UAnimSequence* Lobby_Scene_Matching_Idle_Hair; // 0x68
        class UAnimSequence* Lobby_Scene_Matching_Cancel_Hair; // 0x70
        class UAnimSequence* Lobby_Scene_Customizing_Hair; // 0x78
        struct TArray<struct FPDResultHairAnimSequence> Result_Scene_Win_Hair; // 0x80
        struct TArray<struct FPDResultHairAnimSequence> Result_Scene_Lose_Hair; // 0x90

    };

    struct FPDResultHairAnimSequence //ScriptStruct VeiledExperts.PDResultHairAnimSequence
    {
    //Children Prop Count (Fields): 2
    public:

        class UAnimSequence* ActionAnimData; // 0x0
        class UAnimSequence* IdleAnimData; // 0x8

    };

    struct FPDResultAnimSequence //ScriptStruct VeiledExperts.PDResultAnimSequence
    {
    //Children Prop Count (Fields): 3
    public:

        class UAnimSequence* ActionAnimData; // 0x0
        class UAnimSequence* IdleAnimData; // 0x8
        int32_t EquipWeaponIndex; // 0x10

    };

    struct FPDFacialAnimData : FTableRowBase //ScriptStruct VeiledExperts.PDFacialAnimData
    {
    //Children Prop Count (Fields): 1
    public:

        struct FPDIngameFacialAnimData IngameFacialAnimData; // 0x8

    };

    struct FPDIngameFacialAnimData //ScriptStruct VeiledExperts.PDIngameFacialAnimData
    {
    //Children Prop Count (Fields): 13
    public:

        class UAnimSequence* Idle; // 0x0
        class UAnimSequence* Crouch; // 0x8
        class UAnimSequence* Exhauted; // 0x10
        class UAnimSequence* ads; // 0x18
        class UAnimSequence* Groggy; // 0x20
        class UAnimSequence* Dead; // 0x28
        class UAnimSequence* Env1; // 0x30
        class UAnimMontage* Melee; // 0x38
        class UAnimMontage* Hipfire; // 0x40
        class UAnimMontage* ADSFire; // 0x48
        class UAnimMontage* Reload; // 0x50
        class UAnimMontage* Painful; // 0x58
        class UAnimMontage* Parkour; // 0x60

    };

    struct FPDHitReactionBSAnimData //ScriptStruct VeiledExperts.PDHitReactionBSAnimData
    {
    //Children Prop Count (Fields): 1
    public:

        class UBlendSpaceBase* HitReaction_BS; // 0x0

    };

    struct FNeighborInfoArray //ScriptStruct VeiledExperts.NeighborInfoArray
    {
    //Children Prop Count (Fields): 2
    public:

        struct TArray<class APDClimbNodeActor*> ClimbNodeActors; // 0x0
        class APDClimbableActor* ClimbableActor; // 0x18

    };

    struct FNeighborInfo //ScriptStruct VeiledExperts.NeighborInfo
    {
    //Children Prop Count (Fields): 3
    public:

        struct FClimbNodeInfo Self; // 0x0
        struct TArray<struct FClimbNodeInfo> NeighborActors; // 0x20
        struct TArray<struct FClimbNodeInfo> NeighborActorsToJump; // 0x30

    };

    struct FClimbNodeInfo //ScriptStruct VeiledExperts.ClimbNodeInfo
    {
    //Children Prop Count (Fields): 5
    public:

        bool bDataOverridden; // 0x0
        class APDClimbableActor* ClimbableActor; // 0x8
        enum class EPDClimbStanceState ClimbType; // 0x10
        enum class EPDClimbMoveType MoveType; // 0x11
        enum class EPDClimbPointUptype ClimbUpType; // 0x12

    };

    struct FSafeZoneDrawing //ScriptStruct VeiledExperts.SafeZoneDrawing
    {
    //Children Prop Count (Fields): 2
    public:

        enum class ESafeZoneDrawStyle Style; // 0x0
        struct FColor Color; // 0x4

    };

    struct FHitFeedbackIcon //ScriptStruct VeiledExperts.HitFeedbackIcon
    {
    //Children Prop Count (Fields): 3
    public:

        class UPaperSprite* Sprite; // 0x0
        struct FLinearColor Color; // 0x8
        struct FVector2D Size; // 0x18

    };

    struct FIKAnimInstanceProxy : FAnimInstanceProxy //ScriptStruct PDAnimRuntime.IKAnimInstanceProxy
    {
    //Children Prop Count (Fields): 1
    public:

        struct FIKTargetBoneArray IKTargetBones; // 0x6e0

    };

    struct FIKTargetBoneArray //ScriptStruct PDAnimRuntime.IKTargetBoneArray
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<struct FBoneReference> Array; // 0x0

    };

    struct FBoneReference //ScriptStruct Engine.BoneReference
    {
    //Children Prop Count (Fields): 1
    public:

        struct FName BoneName; // 0x0

    };

    struct FPDIKAnimInstanceProxy : FIKAnimInstanceProxy //ScriptStruct VeiledExperts.PDIKAnimInstanceProxy
    {
    //Children Prop Count (Fields): 6
    public:

        struct FPDHandIKData HandIKData; // 0xab0
        float StanceExplicitTime; // 0xb50
        class UPDIKAnimInstance* IKAnimInstance; // 0xb58
        class UPDStateComponent* OwnerStateComponent; // 0xb60
        class APDCharacterEntity* OwnerCharacterEntity; // 0xb68
        float AimClampedYaw; // 0xb70

    };

    struct FPDHandIKData //ScriptStruct PDAnimRuntime.PDHandIKData
    {
    //Children Prop Count (Fields): 13
    public:

        char bEnableHandIK; // 0x0
        char bUseRightShoulder; // 0x0
        char bEnableTriggerHandOverride; // 0x0
        struct FName HandleAttachedBone; // 0x4
        struct FName MuzzleBone; // 0xc
        class UMeshComponent* WeaponMeshComponent; // 0x18
        struct FTransform TriggerHandOffset; // 0x20
        struct FTransform TriggerHandOverride; // 0x50
        struct FVector AimingTarget; // 0x80
        float HandleHandAlpha; // 0x8c
        float TriggerHandAlpha; // 0x90
        float StockAlpha; // 0x94
        float MuzzleAlpha; // 0x98

    };

    struct FPDIngameMapPos //ScriptStruct VeiledExperts.PDIngameMapPos
    {
    //Children Prop Count (Fields): 3
    public:

        struct FAnchors Anchors; // 0x0
        struct FMargin Offsets; // 0x10
        struct FVector2D Alignment; // 0x20

    };

    struct FPDActionExecutionInfo //ScriptStruct VeiledExperts.PDActionExecutionInfo
    {
    public:


    };

    struct FSmoothMoveInfo //ScriptStruct VeiledExperts.SmoothMoveInfo
    {
    //Children Prop Count (Fields): 7
    public:

        class UPrimitiveComponent* TargetRotationComponent; // 0x90
        class UPrimitiveComponent* TargetLocationComponent; // 0x98
        class AActor* TargetRotationActor; // 0xa0
        class AActor* TargetLocationActor; // 0xa8
        class UCurveFloat* CurrentSmoothRotationCurve; // 0xe8
        class UCurveFloat* CurrentSmoothLocationCurveFloat; // 0xf0
        class UCurveVector* CurrentSmoothLocationCurveVector; // 0xf8

    };

    struct FCameraMoveInfo //ScriptStruct VeiledExperts.CameraMoveInfo
    {
    //Children Prop Count (Fields): 10
    public:

        float ArmLength; // 0x0
        struct FVector SocketOffset; // 0x4
        struct FVector TargetOffset; // 0x10
        struct FRotator RelativeRotation; // 0x1c
        float FOV; // 0x28
        float InterpTime; // 0x2c
        float ReturnTime; // 0x30
        float DelayTime; // 0x34
        struct TWeakObjectPtr<struct UCurveFloat> BlendingCurve; // 0x38
        struct TWeakObjectPtr<struct UCurveFloat> ReturnCurve; // 0x40

    };

    struct FPDFootstepInfo //ScriptStruct VeiledExperts.PDFootstepInfo
    {
    //Children Prop Count (Fields): 1
    public:

        class UDecalComponent* Decal; // 0x0

    };

    struct FSkeletalMeshMergeParams //ScriptStruct VeiledExperts.SkeletalMeshMergeParams
    {
    //Children Prop Count (Fields): 8
    public:

        struct TArray<struct FSkelMeshMergeSectionMapping_BP> MeshSectionMappings; // 0x0
        struct TArray<struct FSkelMeshMergeUVTransformMapping> UVTransformsPerMesh; // 0x10
        struct TArray<class USkeletalMesh*> MeshesToMerge; // 0x20
        int32_t StripTopLODS; // 0x30
        char bNeedsCpuAccess; // 0x34
        char bSkeletonBefore; // 0x34
        class USkeleton* Skeleton; // 0x38
        class UPhysicsAsset* PhysicsAsset; // 0x40

    };

    struct FSkelMeshMergeUVTransformMapping //ScriptStruct VeiledExperts.SkelMeshMergeUVTransformMapping
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<struct FSkelMeshMergeUVTransform> UVTransformsPerMesh; // 0x0

    };

    struct FSkelMeshMergeUVTransform //ScriptStruct VeiledExperts.SkelMeshMergeUVTransform
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<struct FTransform> UVTransforms; // 0x0

    };

    struct FSkelMeshMergeSectionMapping_BP //ScriptStruct VeiledExperts.SkelMeshMergeSectionMapping_BP
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<int32_t> SectionIDs; // 0x0

    };

    struct FAnimNode_AssetPlayerBase : FAnimNode_Base //ScriptStruct Engine.AnimNode_AssetPlayerBase
    {
    //Children Prop Count (Fields): 5
    public:

        int32_t GroupIndex; // 0x10
        enum class EAnimGroupRole GroupRole; // 0x14
        bool bIgnoreForRelevancyTest; // 0x15
        float BlendWeight; // 0x18
        float InternalTimeAccumulator; // 0x1c

    };

    struct FAnimNode_PDAssetPlayerBase : FAnimNode_AssetPlayerBase //ScriptStruct PDAnimRuntime.AnimNode_PDAssetPlayerBase
    {
    //Children Prop Count (Fields): 3
    public:

        float BlendTime; // 0x30
        bool bResetOnActivated; // 0x34
        bool bPrintDebug; // 0x35

    };

    struct FAnimNode_PDBlendSpacePlayer : FAnimNode_PDAssetPlayerBase //ScriptStruct PDAnimRuntime.AnimNode_PDBlendSpacePlayer
    {
    //Children Prop Count (Fields): 9
    public:

        float X; // 0x48
        float Y; // 0x4c
        float Z; // 0x50
        float PlayRate; // 0x54
        bool bLoop; // 0x58
        bool bResetPlayTimeWhenBlendSpaceChanges; // 0x59
        float StartPosition; // 0x5c
        class UBlendSpaceBase* BlendSpace; // 0x60
        class UBlendSpaceBase* PreviousBlendSpace; // 0xe0

    };

    struct FAnimNode_PDIK : FAnimNode_SkeletalControlBase //ScriptStruct PDAnimRuntime.AnimNode_PDIK
    {
    //Children Prop Count (Fields): 14
    public:

        struct TArray<struct FName> PreHandleSlots; // 0xc8
        struct FPDHandIKData HandIKData; // 0x100
        float MaxArmStretchOffset; // 0x1a0
        struct FPoseLink StancePose; // 0x1a8
        struct TArray<struct FPerBoneBlendWeight> PerBoneBlendWeights; // 0x1b8
        struct FGuid SkeletonGuid; // 0x1cc
        struct FGuid VirtualBoneGuid; // 0x1dc
        struct FName IK_Handle_Off; // 0x240
        struct FName IK_Handle_MustOff; // 0x248
        struct FName IK_Weapon; // 0x250
        bool bAimingIdleState; // 0x258
        struct FName IKProfileName; // 0x25c
        struct TMap<struct FName, struct FPDIKProfileData> IKProfiles; // 0x268
        struct FBoneReference Hip; // 0x2b8

    };

    struct FPDIKProfileData //ScriptStruct PDAnimRuntime.PDIKProfileData
    {
    //Children Prop Count (Fields): 8
    public:

        struct FBoneReference TriggerHand; // 0x0
        struct FBoneReference HandleHand; // 0x10
        struct FBoneReference RightShoulder; // 0x20
        struct FBoneReference LeftShoulder; // 0x30
        struct FBoneReference RightWeaponAttached; // 0x40
        struct FBoneReference LeftWeaponAttached; // 0x50
        struct FBoneReference HandleHandPalm; // 0x60
        struct FBoneReference TriggerHandPalm; // 0x70

    };

    struct FPerBoneBlendWeight //ScriptStruct Engine.PerBoneBlendWeight
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t SourceIndex; // 0x0
        float BlendWeight; // 0x4

    };

    struct FAnimNode_PDSequenceEvaluator : FAnimNode_PDAssetPlayerBase //ScriptStruct PDAnimRuntime.AnimNode_PDSequenceEvaluator
    {
    //Children Prop Count (Fields): 6
    public:

        class UAnimSequenceBase* Sequence; // 0x48
        float ExplicitTime; // 0x50
        bool bShouldLoop; // 0x54
        bool bTeleportToExplicitTime; // 0x55
        enum class ESequenceEvalReinit ReinitializationBehavior; // 0x56
        float StartPosition; // 0x58

    };

    struct FAnimNode_PDSequencePlayer : FAnimNode_PDAssetPlayerBase //ScriptStruct PDAnimRuntime.AnimNode_PDSequencePlayer
    {
    //Children Prop Count (Fields): 7
    public:

        class UAnimSequenceBase* Sequence; // 0x48
        float PlayRateBasis; // 0x50
        float PlayRate; // 0x54
        struct FInputScaleBiasClamp PlayRateScaleBiasClamp; // 0x58
        float StartPosition; // 0x88
        bool bLoopAnimation; // 0x8c
        class UAnimSequenceBase* PreviousSequence; // 0x1c0

    };

    struct FPDIKTargetData //ScriptStruct PDAnimRuntime.PDIKTargetData
    {
    //Children Prop Count (Fields): 11
    public:

        class UIKTargetGetter* IKTargetGetter; // 0x0
        char bEnableTranslation; // 0x8
        char bEnableOrientation; // 0x8
        char bUseWorldOrientation; // 0x8
        char bCaptureTarget; // 0x8
        enum class EPDCaptureSpace CaptureSpace; // 0x9
        struct FName CapturedSocketName; // 0x60
        struct FTransform TargetOffset; // 0x70
        enum class EPDCaptureSpace OffsetSpace; // 0xa0
        struct FName OffsetSocketName; // 0xa4
        float BlendTime; // 0xac

    };

    struct FCompositeFont //ScriptStruct SlateCore.CompositeFont
    {
    //Children Prop Count (Fields): 3
    public:

        struct FTypeface DefaultTypeface; // 0x0
        struct FCompositeFallbackFont FallbackTypeface; // 0x10
        struct TArray<struct FCompositeSubFont> SubTypefaces; // 0x28

    };

    struct FCompositeFallbackFont //ScriptStruct SlateCore.CompositeFallbackFont
    {
    //Children Prop Count (Fields): 2
    public:

        struct FTypeface Typeface; // 0x0
        float ScalingFactor; // 0x10

    };

    struct FTypeface //ScriptStruct SlateCore.Typeface
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<struct FTypefaceEntry> Fonts; // 0x0

    };

    struct FTypefaceEntry //ScriptStruct SlateCore.TypefaceEntry
    {
    //Children Prop Count (Fields): 2
    public:

        struct FName Name; // 0x0
        struct FFontData Font; // 0x8

    };

    struct FFontData //ScriptStruct SlateCore.FontData
    {
    //Children Prop Count (Fields): 5
    public:

        struct FString FontFilename; // 0x0
        enum class EFontHinting Hinting; // 0x10
        enum class EFontLoadingPolicy LoadingPolicy; // 0x11
        int32_t SubFaceIndex; // 0x14
        class UObject* FontFaceAsset; // 0x18

    };

    struct FCompositeSubFont : FCompositeFallbackFont //ScriptStruct SlateCore.CompositeSubFont
    {
    //Children Prop Count (Fields): 2
    public:

        struct TArray<struct FInt32Range> CharacterRanges; // 0x18
        struct FString Cultures; // 0x28

    };

    struct FMotionEvent : FInputEvent //ScriptStruct SlateCore.MotionEvent
    {
    public:


    };

    struct FCaptureLostEvent //ScriptStruct SlateCore.CaptureLostEvent
    {
    public:


    };

    struct FFocusEvent //ScriptStruct SlateCore.FocusEvent
    {
    public:


    };

    struct FWindowStyle : FSlateWidgetStyle //ScriptStruct SlateCore.WindowStyle
    {
    //Children Prop Count (Fields): 14
    public:

        struct FButtonStyle MinimizeButtonStyle; // 0x8
        struct FButtonStyle MaximizeButtonStyle; // 0x280
        struct FButtonStyle RestoreButtonStyle; // 0x4f8
        struct FButtonStyle CloseButtonStyle; // 0x770
        struct FTextBlockStyle TitleTextStyle; // 0x9e8
        struct FSlateBrush ActiveTitleBrush; // 0xc50
        struct FSlateBrush InactiveTitleBrush; // 0xcd8
        struct FSlateBrush FlashTitleBrush; // 0xd60
        struct FSlateColor BackgroundColor; // 0xde8
        struct FSlateBrush OutlineBrush; // 0xe10
        struct FSlateColor OutlineColor; // 0xe98
        struct FSlateBrush BorderBrush; // 0xec0
        struct FSlateBrush BackgroundBrush; // 0xf48
        struct FSlateBrush ChildBackgroundBrush; // 0xfd0

    };

    struct FScrollBorderStyle : FSlateWidgetStyle //ScriptStruct SlateCore.ScrollBorderStyle
    {
    //Children Prop Count (Fields): 2
    public:

        struct FSlateBrush TopShadowBrush; // 0x8
        struct FSlateBrush BottomShadowBrush; // 0x90

    };

    struct FScrollBoxStyle : FSlateWidgetStyle //ScriptStruct SlateCore.ScrollBoxStyle
    {
    //Children Prop Count (Fields): 4
    public:

        struct FSlateBrush TopShadowBrush; // 0x8
        struct FSlateBrush BottomShadowBrush; // 0x90
        struct FSlateBrush LeftShadowBrush; // 0x118
        struct FSlateBrush RightShadowBrush; // 0x1a0

    };

    struct FDockTabStyle : FSlateWidgetStyle //ScriptStruct SlateCore.DockTabStyle
    {
    //Children Prop Count (Fields): 12
    public:

        struct FButtonStyle CloseButtonStyle; // 0x8
        struct FSlateBrush NormalBrush; // 0x280
        struct FSlateBrush ActiveBrush; // 0x308
        struct FSlateBrush ColorOverlayTabBrush; // 0x390
        struct FSlateBrush ColorOverlayIconBrush; // 0x418
        struct FSlateBrush ForegroundBrush; // 0x4a0
        struct FSlateBrush HoveredBrush; // 0x528
        struct FSlateBrush ContentAreaBrush; // 0x5b0
        struct FSlateBrush TabWellBrush; // 0x638
        struct FMargin TabPadding; // 0x6c0
        float OverlapWidth; // 0x6d0
        struct FSlateColor FlashColor; // 0x6d8

    };

    struct FHeaderRowStyle : FSlateWidgetStyle //ScriptStruct SlateCore.HeaderRowStyle
    {
    //Children Prop Count (Fields): 5
    public:

        struct FTableColumnHeaderStyle ColumnStyle; // 0x8
        struct FTableColumnHeaderStyle LastColumnStyle; // 0x4d8
        struct FSplitterStyle ColumnSplitterStyle; // 0x9a8
        struct FSlateBrush BackgroundBrush; // 0xac0
        struct FSlateColor ForegroundColor; // 0xb48

    };

    struct FSplitterStyle : FSlateWidgetStyle //ScriptStruct SlateCore.SplitterStyle
    {
    //Children Prop Count (Fields): 2
    public:

        struct FSlateBrush HandleNormalBrush; // 0x8
        struct FSlateBrush HandleHighlightBrush; // 0x90

    };

    struct FTableColumnHeaderStyle : FSlateWidgetStyle //ScriptStruct SlateCore.TableColumnHeaderStyle
    {
    //Children Prop Count (Fields): 9
    public:

        struct FSlateBrush SortPrimaryAscendingImage; // 0x8
        struct FSlateBrush SortPrimaryDescendingImage; // 0x90
        struct FSlateBrush SortSecondaryAscendingImage; // 0x118
        struct FSlateBrush SortSecondaryDescendingImage; // 0x1a0
        struct FSlateBrush NormalBrush; // 0x228
        struct FSlateBrush HoveredBrush; // 0x2b0
        struct FSlateBrush MenuDropdownImage; // 0x338
        struct FSlateBrush MenuDropdownNormalBorderBrush; // 0x3c0
        struct FSlateBrush MenuDropdownHoveredBorderBrush; // 0x448

    };

    struct FInlineTextImageStyle : FSlateWidgetStyle //ScriptStruct SlateCore.InlineTextImageStyle
    {
    //Children Prop Count (Fields): 2
    public:

        struct FSlateBrush Image; // 0x8
        int16_t Baseline; // 0x90

    };

    struct FVolumeControlStyle : FSlateWidgetStyle //ScriptStruct SlateCore.VolumeControlStyle
    {
    //Children Prop Count (Fields): 6
    public:

        struct FSliderStyle SliderStyle; // 0x8
        struct FSlateBrush HighVolumeImage; // 0x348
        struct FSlateBrush MidVolumeImage; // 0x3d0
        struct FSlateBrush LowVolumeImage; // 0x458
        struct FSlateBrush NoVolumeImage; // 0x4e0
        struct FSlateBrush MutedImage; // 0x568

    };

    struct FSliderStyle : FSlateWidgetStyle //ScriptStruct SlateCore.SliderStyle
    {
    //Children Prop Count (Fields): 7
    public:

        struct FSlateBrush NormalBarImage; // 0x8
        struct FSlateBrush HoveredBarImage; // 0x90
        struct FSlateBrush DisabledBarImage; // 0x118
        struct FSlateBrush NormalThumbImage; // 0x1a0
        struct FSlateBrush HoveredThumbImage; // 0x228
        struct FSlateBrush DisabledThumbImage; // 0x2b0
        float BarThickness; // 0x338

    };

    struct FSearchBoxStyle : FSlateWidgetStyle //ScriptStruct SlateCore.SearchBoxStyle
    {
    //Children Prop Count (Fields): 8
    public:

        struct FEditableTextBoxStyle TextBoxStyle; // 0x8
        struct FSlateFontInfo ActiveFontInfo; // 0x7f8
        struct FSlateBrush UpArrowImage; // 0x848
        struct FSlateBrush DownArrowImage; // 0x8d0
        struct FSlateBrush GlassImage; // 0x958
        struct FSlateBrush ClearImage; // 0x9e0
        struct FMargin ImagePadding; // 0xa68
        bool bLeftAlignButtons; // 0xa78

    };

    struct FExpandableAreaStyle : FSlateWidgetStyle //ScriptStruct SlateCore.ExpandableAreaStyle
    {
    //Children Prop Count (Fields): 3
    public:

        struct FSlateBrush CollapsedImage; // 0x8
        struct FSlateBrush ExpandedImage; // 0x90
        float RolloutAnimationSeconds; // 0x118

    };

    struct FProgressBarStyle : FSlateWidgetStyle //ScriptStruct SlateCore.ProgressBarStyle
    {
    //Children Prop Count (Fields): 3
    public:

        struct FSlateBrush BackgroundImage; // 0x8
        struct FSlateBrush FillImage; // 0x90
        struct FSlateBrush MarqueeImage; // 0x118

    };

    struct FInlineEditableTextBlockStyle : FSlateWidgetStyle //ScriptStruct SlateCore.InlineEditableTextBlockStyle
    {
    //Children Prop Count (Fields): 2
    public:

        struct FEditableTextBoxStyle EditableTextBoxStyle; // 0x8
        struct FTextBlockStyle TextStyle; // 0x7f8

    };

    struct FHyperlinkStyle : FSlateWidgetStyle //ScriptStruct SlateCore.HyperlinkStyle
    {
    //Children Prop Count (Fields): 3
    public:

        struct FButtonStyle UnderlineStyle; // 0x8
        struct FTextBlockStyle TextStyle; // 0x280
        struct FMargin Padding; // 0x4e8

    };

    struct FCheckBoxStyle : FSlateWidgetStyle //ScriptStruct SlateCore.CheckBoxStyle
    {
    //Children Prop Count (Fields): 16
    public:

        enum class ESlateCheckBoxType CheckBoxType; // 0x8
        struct FSlateBrush UncheckedImage; // 0x10
        struct FSlateBrush UncheckedHoveredImage; // 0x98
        struct FSlateBrush UncheckedPressedImage; // 0x120
        struct FSlateBrush CheckedImage; // 0x1a8
        struct FSlateBrush CheckedHoveredImage; // 0x230
        struct FSlateBrush CheckedPressedImage; // 0x2b8
        struct FSlateBrush UndeterminedImage; // 0x340
        struct FSlateBrush UndeterminedHoveredImage; // 0x3c8
        struct FSlateBrush UndeterminedPressedImage; // 0x450
        struct FMargin Padding; // 0x4d8
        struct FSlateColor ForegroundColor; // 0x4e8
        struct FSlateColor BorderBackgroundColor; // 0x510
        struct FSlateSound CheckedSlateSound; // 0x538
        struct FSlateSound UncheckedSlateSound; // 0x550
        struct FSlateSound HoveredSlateSound; // 0x568

    };

    struct FCustomizedToolMenu //ScriptStruct Slate.CustomizedToolMenu
    {
    //Children Prop Count (Fields): 5
    public:

        struct FName Name; // 0x0
        struct TMap<struct FName, struct FCustomizedToolMenuEntry> Entries; // 0x8
        struct TMap<struct FName, struct FCustomizedToolMenuSection> Sections; // 0x58
        struct TMap<struct FName, struct FCustomizedToolMenuNameArray> EntryOrder; // 0xa8
        struct TArray<struct FName> SectionOrder; // 0xf8

    };

    struct FCustomizedToolMenuNameArray //ScriptStruct Slate.CustomizedToolMenuNameArray
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<struct FName> Names; // 0x0

    };

    struct FCustomizedToolMenuSection //ScriptStruct Slate.CustomizedToolMenuSection
    {
    //Children Prop Count (Fields): 1
    public:

        enum class ECustomizedToolMenuVisibility Visibility; // 0x0

    };

    struct FCustomizedToolMenuEntry //ScriptStruct Slate.CustomizedToolMenuEntry
    {
    //Children Prop Count (Fields): 1
    public:

        enum class ECustomizedToolMenuVisibility Visibility; // 0x0

    };

    struct FImageWriteOptions //ScriptStruct ImageWriteQueue.ImageWriteOptions
    {
    //Children Prop Count (Fields): 5
    public:

        enum class EDesiredImageFormat Format; // 0x0
        struct FDelegate OnComplete; // 0x4
        int32_t CompressionQuality; // 0x14
        bool bOverwriteFile; // 0x18
        bool bAsync; // 0x19

    };

    struct FMaterialQualityOverrides //ScriptStruct MaterialShaderQualitySettings.MaterialQualityOverrides
    {
    //Children Prop Count (Fields): 9
    public:

        bool bDiscardQualityDuringCook; // 0x0
        bool bEnableOverride; // 0x1
        bool bForceFullyRough; // 0x2
        bool bForceNonMetal; // 0x3
        bool bForceDisableLMDirectionality; // 0x4
        bool bForceLQReflections; // 0x5
        bool bForceDisablePreintegratedGF; // 0x6
        bool bDisableMaterialNormalCalculation; // 0x7
        enum class EMobileCSMQuality MobileCSMQuality; // 0x8

    };

    struct FLightPropagationVolumeSettings //ScriptStruct Renderer.LightPropagationVolumeSettings
    {
    //Children Prop Count (Fields): 28
    public:

        char bOverride_LPVIntensity; // 0x0
        char bOverride_LPVDirectionalOcclusionIntensity; // 0x0
        char bOverride_LPVDirectionalOcclusionRadius; // 0x0
        char bOverride_LPVDiffuseOcclusionExponent; // 0x0
        char bOverride_LPVSpecularOcclusionExponent; // 0x0
        char bOverride_LPVDiffuseOcclusionIntensity; // 0x0
        char bOverride_LPVSpecularOcclusionIntensity; // 0x0
        char bOverride_LPVSize; // 0x0
        char bOverride_LPVSecondaryOcclusionIntensity; // 0x1
        char bOverride_LPVSecondaryBounceIntensity; // 0x1
        char bOverride_LPVGeometryVolumeBias; // 0x1
        char bOverride_LPVVplInjectionBias; // 0x1
        char bOverride_LPVEmissiveInjectionIntensity; // 0x1
        float LPVIntensity; // 0x4
        float LPVVplInjectionBias; // 0x8
        float LPVSize; // 0xc
        float LPVSecondaryOcclusionIntensity; // 0x10
        float LPVSecondaryBounceIntensity; // 0x14
        float LPVGeometryVolumeBias; // 0x18
        float LPVEmissiveInjectionIntensity; // 0x1c
        float LPVDirectionalOcclusionIntensity; // 0x20
        float LPVDirectionalOcclusionRadius; // 0x24
        float LPVDiffuseOcclusionExponent; // 0x28
        float LPVSpecularOcclusionExponent; // 0x2c
        float LPVDiffuseOcclusionIntensity; // 0x30
        float LPVSpecularOcclusionIntensity; // 0x34
        float LPVFadeRange; // 0x38
        float LPVDirectionalOcclusionFadeRange; // 0x3c

    };

    struct FAutoCompleteCommand //ScriptStruct EngineSettings.AutoCompleteCommand
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString Command; // 0x0
        struct FString Desc; // 0x10

    };

    struct FGameModeName //ScriptStruct EngineSettings.GameModeName
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString Name; // 0x0
        struct FSoftClassPath GameMode; // 0x10

    };

    struct FMRMeshConfiguration //ScriptStruct MRMesh.MRMeshConfiguration
    {
    public:


    };

    struct FARSharedWorldReplicationState //ScriptStruct AugmentedReality.ARSharedWorldReplicationState
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t PreviewImageOffset; // 0x0
        int32_t ARWorldOffset; // 0x4

    };

    struct FARTraceResult //ScriptStruct AugmentedReality.ARTraceResult
    {
    //Children Prop Count (Fields): 4
    public:

        float DistanceFromCamera; // 0x0
        enum class EARLineTraceChannels TraceChannel; // 0x4
        struct FTransform LocalToTrackingTransform; // 0x10
        class UARTrackedGeometry* TrackedGeometry; // 0x40

    };

    struct FARPose3D //ScriptStruct AugmentedReality.ARPose3D
    {
    //Children Prop Count (Fields): 4
    public:

        struct FARSkeletonDefinition SkeletonDefinition; // 0x0
        struct TArray<struct FTransform> JointTransforms; // 0x28
        struct TArray<bool> IsJointTracked; // 0x38
        enum class EARJointTransformSpace JointTransformSpace; // 0x48

    };

    struct FARSkeletonDefinition //ScriptStruct AugmentedReality.ARSkeletonDefinition
    {
    //Children Prop Count (Fields): 3
    public:

        int32_t NumJoints; // 0x0
        struct TArray<struct FName> JointNames; // 0x8
        struct TArray<int32_t> ParentIndices; // 0x18

    };

    struct FARPose2D //ScriptStruct AugmentedReality.ARPose2D
    {
    //Children Prop Count (Fields): 3
    public:

        struct FARSkeletonDefinition SkeletonDefinition; // 0x0
        struct TArray<struct FVector2D> JointLocations; // 0x28
        struct TArray<bool> IsJointTracked; // 0x38

    };

    struct FARVideoFormat //ScriptStruct AugmentedReality.ARVideoFormat
    {
    //Children Prop Count (Fields): 3
    public:

        int32_t FPS; // 0x0
        int32_t Width; // 0x4
        int32_t Height; // 0x8

    };

    struct FARSessionStatus //ScriptStruct AugmentedReality.ARSessionStatus
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString AdditionalInfo; // 0x0
        enum class EARSessionStatus Status; // 0x10

    };

    struct FXRDeviceId //ScriptStruct HeadMountedDisplay.XRDeviceId
    {
    //Children Prop Count (Fields): 2
    public:

        struct FName SystemName; // 0x0
        int32_t DeviceID; // 0x8

    };

    struct FFileManifestData //ScriptStruct BuildPatchServices.FileManifestData
    {
    //Children Prop Count (Fields): 8
    public:

        struct FString Filename; // 0x0
        struct FSHAHashData FileHash; // 0x10
        struct TArray<struct FChunkPartData> FileChunkParts; // 0x28
        struct TArray<struct FString> InstallTags; // 0x38
        bool bIsUnixExecutable; // 0x48
        struct FString SymlinkTarget; // 0x50
        bool bIsReadOnly; // 0x60
        bool bIsCompressed; // 0x61

    };

    struct FChunkPartData //ScriptStruct BuildPatchServices.ChunkPartData
    {
    //Children Prop Count (Fields): 3
    public:

        struct FGuid Guid; // 0x0
        uint32_t Offset; // 0x10
        uint32_t Size; // 0x14

    };

    struct FSHAHashData //ScriptStruct BuildPatchServices.SHAHashData
    {
    //Children Prop Count (Fields): 1
    public:

        char Hash; // 0x0

    };

    struct FChunkInfoData //ScriptStruct BuildPatchServices.ChunkInfoData
    {
    //Children Prop Count (Fields): 5
    public:

        struct FGuid Guid; // 0x0
        uint64_t Hash; // 0x10
        struct FSHAHashData ShaHash; // 0x18
        int64_t FileSize; // 0x30
        char GroupNumber; // 0x38

    };

    struct FCustomFieldData //ScriptStruct BuildPatchServices.CustomFieldData
    {
    //Children Prop Count (Fields): 2
    public:

        struct FString Key; // 0x0
        struct FString Value; // 0x10

    };

    struct FFoliageVertexColorChannelMask //ScriptStruct Foliage.FoliageVertexColorChannelMask
    {
    //Children Prop Count (Fields): 3
    public:

        char UseMask; // 0x0
        float MaskThreshold; // 0x4
        char InvertMask; // 0x8

    };

    struct FFoliageTypeObject //ScriptStruct Foliage.FoliageTypeObject
    {
    //Children Prop Count (Fields): 4
    public:

        class UObject* FoliageTypeObject; // 0x0
        class UFoliageType* TypeInstance; // 0x8
        bool bIsAsset; // 0x10
        class UFoliageType_InstancedStaticMesh* Type; // 0x18

    };

    struct FProceduralFoliageInstance //ScriptStruct Foliage.ProceduralFoliageInstance
    {
    //Children Prop Count (Fields): 6
    public:

        struct FVector Location; // 0x0
        struct FQuat Rotation; // 0x10
        struct FVector Normal; // 0x20
        float Age; // 0x2c
        float Scale; // 0x30
        class UFoliageType* Type; // 0x38

    };

    struct FLandscapeLayer //ScriptStruct Landscape.LandscapeLayer
    {
    //Children Prop Count (Fields): 9
    public:

        struct FGuid Guid; // 0x0
        struct FName Name; // 0x10
        bool bVisible; // 0x18
        bool bLocked; // 0x19
        float HeightmapAlpha; // 0x1c
        float WeightmapAlpha; // 0x20
        enum class ELandscapeBlendMode BlendMode; // 0x24
        struct TArray<struct FLandscapeLayerBrush> Brushes; // 0x28
        struct TMap<class ULandscapeLayerInfoObject*, bool> WeightmapLayerAllocationBlend; // 0x38

    };

    struct FLandscapeLayerBrush //ScriptStruct Landscape.LandscapeLayerBrush
    {
    public:


    };

    struct FWeightmapSource //ScriptStruct Landscape.WeightmapSource
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<char> Data; // 0x0

    };

    struct FLandscapeLayerComponentData //ScriptStruct Landscape.LandscapeLayerComponentData
    {
    //Children Prop Count (Fields): 2
    public:

        struct FHeightmapData HeightmapData; // 0x0
        struct FWeightmapData WeightmapData; // 0x8

    };

    struct FWeightmapData //ScriptStruct Landscape.WeightmapData
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<class UTexture2D*> Textures; // 0x0
        struct TArray<struct FWeightmapLayerAllocationInfo> LayerAllocations; // 0x10
        struct TArray<class ULandscapeWeightmapUsage*> TextureUsages; // 0x20

    };

    struct FWeightmapLayerAllocationInfo //ScriptStruct Landscape.WeightmapLayerAllocationInfo
    {
    //Children Prop Count (Fields): 3
    public:

        class ULandscapeLayerInfoObject* LayerInfo; // 0x0
        char WeightmapTextureIndex; // 0x8
        char WeightmapTextureChannel; // 0x9

    };

    struct FHeightmapData //ScriptStruct Landscape.HeightmapData
    {
    //Children Prop Count (Fields): 1
    public:

        class UTexture2D* Texture; // 0x0

    };

    struct FLandscapeComponentMaterialOverride //ScriptStruct Landscape.LandscapeComponentMaterialOverride
    {
    //Children Prop Count (Fields): 2
    public:

        struct FPerPlatformInt LODIndex; // 0x0
        class UMaterialInterface* Material; // 0x8

    };

    struct FLandscapeEditToolRenderData //ScriptStruct Landscape.LandscapeEditToolRenderData
    {
    //Children Prop Count (Fields): 9
    public:

        class UMaterialInterface* ToolMaterial; // 0x0
        class UMaterialInterface* GizmoMaterial; // 0x8
        int32_t SelectedType; // 0x10
        int32_t DebugChannelR; // 0x14
        int32_t DebugChannelG; // 0x18
        int32_t DebugChannelB; // 0x1c
        class UTexture2D* DataTexture; // 0x20
        class UTexture2D* LayerContributionTexture; // 0x28
        class UTexture2D* DirtyTexture; // 0x30

    };

    struct FGizmoSelectData //ScriptStruct Landscape.GizmoSelectData
    {
    public:


    };

    struct FGrassVariety //ScriptStruct Landscape.GrassVariety
    {
    //Children Prop Count (Fields): 18
    public:

        class UStaticMesh* GrassMesh; // 0x0
        struct FPerPlatformFloat GrassDensity; // 0x8
        bool bUseGrid; // 0xc
        float PlacementJitter; // 0x10
        struct FPerPlatformInt StartCullDistance; // 0x14
        struct FPerPlatformInt EndCullDistance; // 0x18
        int32_t MinLOD; // 0x1c
        enum class EGrassScaling Scaling; // 0x20
        struct FFloatInterval ScaleX; // 0x24
        struct FFloatInterval ScaleY; // 0x2c
        struct FFloatInterval ScaleZ; // 0x34
        bool RandomRotation; // 0x3c
        bool AlignToSurface; // 0x3d
        bool bUseLandscapeLightmap; // 0x3e
        struct FLightingChannels LightingChannels; // 0x3f
        bool bReceivesDecals; // 0x40
        bool bCastDynamicShadow; // 0x41
        bool bKeepInstanceBufferCPUCopy; // 0x42

    };

    struct FLandscapeInfoLayerSettings //ScriptStruct Landscape.LandscapeInfoLayerSettings
    {
    //Children Prop Count (Fields): 2
    public:

        class ULandscapeLayerInfoObject* LayerInfoObj; // 0x0
        struct FName LayerName; // 0x8

    };

    struct FLandscapeMaterialTextureStreamingInfo //ScriptStruct Landscape.LandscapeMaterialTextureStreamingInfo
    {
    //Children Prop Count (Fields): 2
    public:

        struct FName TextureName; // 0x0
        float TexelFactor; // 0x8

    };

    struct FLandscapeProxyMaterialOverride //ScriptStruct Landscape.LandscapeProxyMaterialOverride
    {
    //Children Prop Count (Fields): 2
    public:

        struct FPerPlatformInt LODIndex; // 0x0
        class UMaterialInterface* Material; // 0x8

    };

    struct FLandscapeImportLayerInfo //ScriptStruct Landscape.LandscapeImportLayerInfo
    {
    public:


    };

    struct FLandscapeLayerStruct //ScriptStruct Landscape.LandscapeLayerStruct
    {
    //Children Prop Count (Fields): 1
    public:

        class ULandscapeLayerInfoObject* LayerInfoObj; // 0x0

    };

    struct FLandscapeEditorLayerSettings //ScriptStruct Landscape.LandscapeEditorLayerSettings
    {
    public:


    };

    struct FLandscapeSplineConnection //ScriptStruct Landscape.LandscapeSplineConnection
    {
    //Children Prop Count (Fields): 2
    public:

        class ULandscapeSplineSegment* Segment; // 0x0
        char End; // 0x8

    };

    struct FForeignWorldSplineData //ScriptStruct Landscape.ForeignWorldSplineData
    {
    public:


    };

    struct FForeignSplineSegmentData //ScriptStruct Landscape.ForeignSplineSegmentData
    {
    public:


    };

    struct FForeignControlPointData //ScriptStruct Landscape.ForeignControlPointData
    {
    public:


    };

    struct FLandscapeSplineMeshEntry //ScriptStruct Landscape.LandscapeSplineMeshEntry
    {
    //Children Prop Count (Fields): 9
    public:

        class UStaticMesh* Mesh; // 0x0
        struct TArray<class UMaterialInterface*> MaterialOverrides; // 0x8
        char bCenterH; // 0x18
        struct FVector2D CenterAdjust; // 0x1c
        char bScaleToWidth; // 0x24
        struct FVector Scale; // 0x28
        enum class LandscapeSplineMeshOrientation Orientation; // 0x34
        enum class ESplineMeshAxis ForwardAxis; // 0x35
        enum class ESplineMeshAxis UpAxis; // 0x36

    };

    struct FLandscapeSplineSegmentConnection //ScriptStruct Landscape.LandscapeSplineSegmentConnection
    {
    //Children Prop Count (Fields): 3
    public:

        class ULandscapeSplineControlPoint* ControlPoint; // 0x0
        float TangentLen; // 0x8
        struct FName SocketName; // 0xc

    };

    struct FLandscapeSplineInterpPoint //ScriptStruct Landscape.LandscapeSplineInterpPoint
    {
    //Children Prop Count (Fields): 10
    public:

        struct FVector Center; // 0x0
        struct FVector Left; // 0xc
        struct FVector Right; // 0x18
        struct FVector FalloffLeft; // 0x24
        struct FVector FalloffRight; // 0x30
        struct FVector LayerLeft; // 0x3c
        struct FVector LayerRight; // 0x48
        struct FVector LayerFalloffLeft; // 0x54
        struct FVector LayerFalloffRight; // 0x60
        float StartEndFalloff; // 0x6c

    };

    struct FGrassInput //ScriptStruct Landscape.GrassInput
    {
    //Children Prop Count (Fields): 3
    public:

        struct FName Name; // 0x0
        class ULandscapeGrassType* GrassType; // 0x8
        struct FExpressionInput Input; // 0x10

    };

    struct FLayerBlendInput //ScriptStruct Landscape.LayerBlendInput
    {
    //Children Prop Count (Fields): 7
    public:

        struct FName LayerName; // 0x0
        enum class ELandscapeLayerBlendType BlendType; // 0x8
        struct FExpressionInput LayerInput; // 0xc
        struct FExpressionInput HeightInput; // 0x20
        float PreviewWeight; // 0x34
        struct FVector ConstLayerInput; // 0x38
        float ConstHeightInput; // 0x44

    };

    struct FTimedDataInputEvaluationData //ScriptStruct TimeManagement.TimedDataInputEvaluationData
    {
    //Children Prop Count (Fields): 2
    public:

        float DistanceToNewestSampleSeconds; // 0x0
        float DistanceToOldestSampleSeconds; // 0x4

    };

    struct FTimedDataChannelSampleTime //ScriptStruct TimeManagement.TimedDataChannelSampleTime
    {
    public:


    };

    struct FMovieSceneSectionGroup //ScriptStruct MovieScene.MovieSceneSectionGroup
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<struct TWeakObjectPtr<struct UMovieSceneSection>> Sections; // 0x0

    };

    struct FMovieSceneObjectBindingIDs //ScriptStruct MovieScene.MovieSceneObjectBindingIDs
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<struct FMovieSceneObjectBindingID> IDs; // 0x0

    };

    struct FMovieSceneObjectBindingID //ScriptStruct MovieScene.MovieSceneObjectBindingID
    {
    //Children Prop Count (Fields): 3
    public:

        int32_t SequenceID; // 0x0
        enum class EMovieSceneObjectBindingSpace Space; // 0x4
        struct FGuid Guid; // 0x8

    };

    struct FMovieSceneTrackLabels //ScriptStruct MovieScene.MovieSceneTrackLabels
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<struct FString> Strings; // 0x0

    };

    struct FMovieSceneEditorData //ScriptStruct MovieScene.MovieSceneEditorData
    {
    //Children Prop Count (Fields): 9
    public:

        struct TMap<struct FString, struct FMovieSceneExpansionState> ExpansionStates; // 0x0
        struct TArray<struct FString> PinnedNodes; // 0x50
        double ViewStart; // 0x60
        double ViewEnd; // 0x68
        double WorkStart; // 0x70
        double WorkEnd; // 0x78
        struct TSet<struct FFrameNumber> MarkedFrames; // 0x80
        struct FFloatRange WorkingRange; // 0xd0
        struct FFloatRange ViewRange; // 0xe0

    };

    struct FMovieSceneExpansionState //ScriptStruct MovieScene.MovieSceneExpansionState
    {
    //Children Prop Count (Fields): 1
    public:

        bool bExpanded; // 0x0

    };

    struct FMovieSceneMarkedFrame //ScriptStruct MovieScene.MovieSceneMarkedFrame
    {
    //Children Prop Count (Fields): 2
    public:

        struct FFrameNumber FrameNumber; // 0x0
        struct FString Label; // 0x8

    };

    struct FMovieSceneTimecodeSource //ScriptStruct MovieScene.MovieSceneTimecodeSource
    {
    //Children Prop Count (Fields): 2
    public:

        struct FTimecode Timecode; // 0x0
        struct FFrameNumber DeltaFrame; // 0x14

    };

    struct FMovieSceneBinding //ScriptStruct MovieScene.MovieSceneBinding
    {
    //Children Prop Count (Fields): 3
    public:

        struct FGuid ObjectGuid; // 0x0
        struct FString BindingName; // 0x10
        struct TArray<class UMovieSceneTrack*> Tracks; // 0x20

    };

    struct FMovieSceneBindingOverrideData //ScriptStruct MovieScene.MovieSceneBindingOverrideData
    {
    //Children Prop Count (Fields): 3
    public:

        struct FMovieSceneObjectBindingID ObjectBindingID; // 0x0
        struct TWeakObjectPtr<struct UObject> Object; // 0x18
        bool bOverridesDefault; // 0x20

    };

    struct FOptionalMovieSceneBlendType //ScriptStruct MovieScene.OptionalMovieSceneBlendType
    {
    //Children Prop Count (Fields): 2
    public:

        enum class EMovieSceneBlendType BlendType; // 0x0
        bool bIsValid; // 0x1

    };

    struct FMovieSceneByteChannel : FMovieSceneChannel //ScriptStruct MovieScene.MovieSceneByteChannel
    {
    //Children Prop Count (Fields): 5
    public:

        struct TArray<struct FFrameNumber> Times; // 0x8
        char DefaultValue; // 0x18
        bool bHasDefaultValue; // 0x19
        struct TArray<char> Values; // 0x20
        class UEnum* Enum; // 0x30

    };

    struct FMovieSceneEvalTemplatePtr //ScriptStruct MovieScene.MovieSceneEvalTemplatePtr
    {
    public:


    };

    struct FMovieSceneEmptyStruct //ScriptStruct MovieScene.MovieSceneEmptyStruct
    {
    public:


    };

    struct FMovieSceneEvaluationField //ScriptStruct MovieScene.MovieSceneEvaluationField
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<struct FMovieSceneFrameRange> Ranges; // 0x0
        struct TArray<struct FMovieSceneEvaluationGroup> Groups; // 0x10
        struct TArray<struct FMovieSceneEvaluationMetaData> MetaData; // 0x20

    };

    struct FMovieSceneEvaluationMetaData //ScriptStruct MovieScene.MovieSceneEvaluationMetaData
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<struct FMovieSceneSequenceID> ActiveSequences; // 0x0
        struct TArray<struct FMovieSceneOrderedEvaluationKey> ActiveEntities; // 0x10
        struct TMap<struct FMovieSceneSequenceID, uint32_t> SubTemplateSerialNumbers; // 0x20

    };

    struct FMovieSceneOrderedEvaluationKey //ScriptStruct MovieScene.MovieSceneOrderedEvaluationKey
    {
    //Children Prop Count (Fields): 3
    public:

        struct FMovieSceneEvaluationKey Key; // 0x0
        uint16_t SetupIndex; // 0xc
        uint16_t TearDownIndex; // 0xe

    };

    struct FMovieSceneEvaluationKey //ScriptStruct MovieScene.MovieSceneEvaluationKey
    {
    //Children Prop Count (Fields): 3
    public:

        struct FMovieSceneSequenceID SequenceID; // 0x0
        struct FMovieSceneTrackIdentifier TrackIdentifier; // 0x4
        uint32_t SectionIndex; // 0x8

    };

    struct FMovieSceneTrackIdentifier //ScriptStruct MovieScene.MovieSceneTrackIdentifier
    {
    //Children Prop Count (Fields): 1
    public:

        uint32_t Value; // 0x0

    };

    struct FMovieSceneEvaluationGroup //ScriptStruct MovieScene.MovieSceneEvaluationGroup
    {
    //Children Prop Count (Fields): 2
    public:

        struct TArray<struct FMovieSceneEvaluationGroupLUTIndex> LUTIndices; // 0x0
        struct TArray<struct FMovieSceneEvaluationFieldSegmentPtr> SegmentPtrLUT; // 0x10

    };

    struct FMovieSceneEvaluationFieldTrackPtr //ScriptStruct MovieScene.MovieSceneEvaluationFieldTrackPtr
    {
    //Children Prop Count (Fields): 2
    public:

        struct FMovieSceneSequenceID SequenceID; // 0x0
        struct FMovieSceneTrackIdentifier TrackIdentifier; // 0x4

    };

    struct FMovieSceneEvaluationFieldSegmentPtr : FMovieSceneEvaluationFieldTrackPtr //ScriptStruct MovieScene.MovieSceneEvaluationFieldSegmentPtr
    {
    //Children Prop Count (Fields): 1
    public:

        struct FMovieSceneSegmentIdentifier SegmentID; // 0x8

    };

    struct FMovieSceneSegmentIdentifier //ScriptStruct MovieScene.MovieSceneSegmentIdentifier
    {
    //Children Prop Count (Fields): 1
    public:

        int32_t IdentifierIndex; // 0x0

    };

    struct FMovieSceneEvaluationGroupLUTIndex //ScriptStruct MovieScene.MovieSceneEvaluationGroupLUTIndex
    {
    //Children Prop Count (Fields): 3
    public:

        int32_t LUTOffset; // 0x0
        int32_t NumInitPtrs; // 0x4
        int32_t NumEvalPtrs; // 0x8

    };

    struct FMovieSceneFrameRange //ScriptStruct MovieScene.MovieSceneFrameRange
    {
    public:


    };

    struct FMovieSceneEvaluationTemplate //ScriptStruct MovieScene.MovieSceneEvaluationTemplate
    {
    //Children Prop Count (Fields): 8
    public:

        struct TMap<struct FMovieSceneTrackIdentifier, struct FMovieSceneEvaluationTrack> Tracks; // 0x0
        struct FMovieSceneEvaluationField EvaluationField; // 0xa0
        struct FMovieSceneSequenceHierarchy Hierarchy; // 0xd0
        struct FGuid SequenceSignature; // 0x170
        struct FMovieSceneEvaluationTemplateSerialNumber TemplateSerialNumber; // 0x180
        struct FMovieSceneTemplateGenerationLedger TemplateLedger; // 0x188
        struct FMovieSceneTrackFieldData TrackFieldData; // 0x230
        struct FMovieSceneSubSectionFieldData SubSectionFieldData; // 0x290

    };

    struct FMovieSceneSubSectionFieldData //ScriptStruct MovieScene.MovieSceneSubSectionFieldData
    {
    public:


    };

    struct FMovieSceneTrackFieldData //ScriptStruct MovieScene.MovieSceneTrackFieldData
    {
    public:


    };

    struct FMovieSceneTemplateGenerationLedger //ScriptStruct MovieScene.MovieSceneTemplateGenerationLedger
    {
    //Children Prop Count (Fields): 3
    public:

        struct FMovieSceneTrackIdentifier LastTrackIdentifier; // 0x0
        struct TMap<struct FGuid, struct FMovieSceneTrackIdentifier> TrackSignatureToTrackIdentifier; // 0x8
        struct TMap<struct FGuid, struct FMovieSceneFrameRange> SubSectionRanges; // 0x58

    };

    struct FMovieSceneEvaluationTemplateSerialNumber //ScriptStruct MovieScene.MovieSceneEvaluationTemplateSerialNumber
    {
    //Children Prop Count (Fields): 1
    public:

        uint32_t Value; // 0x0

    };

    struct FMovieSceneSequenceHierarchy //ScriptStruct MovieScene.MovieSceneSequenceHierarchy
    {
    //Children Prop Count (Fields): 2
    public:

        struct TMap<struct FMovieSceneSequenceID, struct FMovieSceneSubSequenceData> SubSequences; // 0x0
        struct TMap<struct FMovieSceneSequenceID, struct FMovieSceneSequenceHierarchyNode> Hierarchy; // 0x50

    };

    struct FMovieSceneSequenceHierarchyNode //ScriptStruct MovieScene.MovieSceneSequenceHierarchyNode
    {
    //Children Prop Count (Fields): 2
    public:

        struct FMovieSceneSequenceID ParentID; // 0x0
        struct TArray<struct FMovieSceneSequenceID> Children; // 0x8

    };

    struct FMovieSceneSubSequenceData //ScriptStruct MovieScene.MovieSceneSubSequenceData
    {
    //Children Prop Count (Fields): 13
    public:

        struct FSoftObjectPath Sequence; // 0x0
        struct FMovieSceneSequenceTransform RootToSequenceTransform; // 0x18
        struct FFrameRate TickResolution; // 0x38
        struct FMovieSceneSequenceID DeterministicSequenceID; // 0x40
        struct FMovieSceneFrameRange PlayRange; // 0x44
        struct FMovieSceneFrameRange FullPlayRange; // 0x54
        struct FMovieSceneFrameRange UnwarpedPlayRange; // 0x64
        struct FMovieSceneFrameRange PreRollRange; // 0x74
        struct FMovieSceneFrameRange PostRollRange; // 0x84
        int32_t HierarchicalBias; // 0x94
        struct FMovieSceneSequenceInstanceDataPtr InstanceData; // 0x98
        struct FGuid SubSectionSignature; // 0xb8
        struct FMovieSceneSequenceTransform OuterToInnerTransform; // 0xc8

    };

    struct FMovieSceneSequenceTransform //ScriptStruct MovieScene.MovieSceneSequenceTransform
    {
    //Children Prop Count (Fields): 2
    public:

        struct FMovieSceneTimeTransform LinearTransform; // 0x0
        struct TArray<struct FMovieSceneNestedSequenceTransform> NestedTransforms; // 0x10

    };

    struct FMovieSceneNestedSequenceTransform //ScriptStruct MovieScene.MovieSceneNestedSequenceTransform
    {
    //Children Prop Count (Fields): 2
    public:

        struct FMovieSceneTimeTransform LinearTransform; // 0x0
        struct FMovieSceneTimeWarping Warping; // 0xc

    };

    struct FMovieSceneTimeWarping //ScriptStruct MovieScene.MovieSceneTimeWarping
    {
    //Children Prop Count (Fields): 2
    public:

        struct FFrameNumber Start; // 0x0
        struct FFrameNumber End; // 0x4

    };

    struct FMovieSceneTimeTransform //ScriptStruct MovieScene.MovieSceneTimeTransform
    {
    //Children Prop Count (Fields): 2
    public:

        float TimeScale; // 0x0
        struct FFrameTime Offset; // 0x4

    };

    struct FMovieSceneSequenceInstanceDataPtr //ScriptStruct MovieScene.MovieSceneSequenceInstanceDataPtr
    {
    public:


    };

    struct FMovieSceneEvaluationTrack //ScriptStruct MovieScene.MovieSceneEvaluationTrack
    {
    //Children Prop Count (Fields): 12
    public:

        struct FGuid ObjectBindingID; // 0x0
        uint16_t EvaluationPriority; // 0x10
        enum class EEvaluationMethod EvaluationMethod; // 0x12
        struct FMovieSceneEvaluationTrackSegments Segments; // 0x18
        class UMovieSceneTrack* SourceTrack; // 0x38
        struct FSectionEvaluationDataTree EvaluationTree; // 0x40
        struct TArray<struct FMovieSceneEvalTemplatePtr> ChildTemplates; // 0xa0
        struct FMovieSceneTrackImplementationPtr TrackTemplate; // 0xb0
        struct FName EvaluationGroup; // 0xe8
        char bEvaluateInPreroll; // 0xf0
        char bEvaluateInPostroll; // 0xf0
        char bTearDownPriority; // 0xf0

    };

    struct FMovieSceneTrackImplementationPtr //ScriptStruct MovieScene.MovieSceneTrackImplementationPtr
    {
    public:


    };

    struct FSectionEvaluationDataTree //ScriptStruct MovieScene.SectionEvaluationDataTree
    {
    public:


    };

    struct FMovieSceneEvaluationTrackSegments //ScriptStruct MovieScene.MovieSceneEvaluationTrackSegments
    {
    //Children Prop Count (Fields): 2
    public:

        struct TArray<int32_t> SegmentIdentifierToIndex; // 0x0
        struct TArray<struct FMovieSceneSegment> SortedSegments; // 0x10

    };

    struct FMovieSceneSegment //ScriptStruct MovieScene.MovieSceneSegment
    {
    public:


    };

    struct FMovieSceneSubSectionData //ScriptStruct MovieScene.MovieSceneSubSectionData
    {
    //Children Prop Count (Fields): 3
    public:

        struct TWeakObjectPtr<struct UMovieSceneSubSection> Section; // 0x0
        struct FGuid ObjectBindingID; // 0x8
        enum class ESectionEvaluationFlags Flags; // 0x18

    };

    struct FMovieSceneRootEvaluationTemplateInstance //ScriptStruct MovieScene.MovieSceneRootEvaluationTemplateInstance
    {
    //Children Prop Count (Fields): 1
    public:

        struct TMap<struct FMovieSceneSequenceID, class UObject*> DirectorInstances; // 0x18

    };

    struct FMovieSceneKeyStruct //ScriptStruct MovieScene.MovieSceneKeyStruct
    {
    public:


    };

    struct FMovieSceneKeyTimeStruct : FMovieSceneKeyStruct //ScriptStruct MovieScene.MovieSceneKeyTimeStruct
    {
    //Children Prop Count (Fields): 1
    public:

        struct FFrameNumber Time; // 0x8

    };

    struct FGeneratedMovieSceneKeyStruct //ScriptStruct MovieScene.GeneratedMovieSceneKeyStruct
    {
    public:


    };

    struct FMovieSceneObjectPathChannel : FMovieSceneChannel //ScriptStruct MovieScene.MovieSceneObjectPathChannel
    {
    //Children Prop Count (Fields): 4
    public:

        class UObject* PropertyClass; // 0x8
        struct TArray<struct FFrameNumber> Times; // 0x10
        struct TArray<struct FMovieSceneObjectPathChannelKeyValue> Values; // 0x20
        struct FMovieSceneObjectPathChannelKeyValue DefaultValue; // 0x30

    };

    struct FMovieSceneObjectPathChannelKeyValue //ScriptStruct MovieScene.MovieSceneObjectPathChannelKeyValue
    {
    //Children Prop Count (Fields): 2
    public:

        struct TSoftObjectPtr<UObject> SoftPtr; // 0x0
        class UObject* HardPtr; // 0x28

    };

    struct FMovieScenePossessable //ScriptStruct MovieScene.MovieScenePossessable
    {
    //Children Prop Count (Fields): 5
    public:

        struct TArray<struct FName> Tags; // 0x0
        struct FGuid Guid; // 0x10
        struct FString Name; // 0x20
        class UObject* PossessedObjectClass; // 0x30
        struct FGuid ParentGuid; // 0x38

    };

    struct FMovieScenePropertySectionTemplate : FMovieSceneEvalTemplate //ScriptStruct MovieScene.MovieScenePropertySectionTemplate
    {
    //Children Prop Count (Fields): 1
    public:

        struct FMovieScenePropertySectionData PropertyData; // 0x20

    };

    struct FMovieScenePropertySectionData //ScriptStruct MovieScene.MovieScenePropertySectionData
    {
    //Children Prop Count (Fields): 4
    public:

        struct FName PropertyName; // 0x0
        struct FString PropertyPath; // 0x8
        struct FName FunctionName; // 0x18
        struct FName NotifyFunctionName; // 0x20

    };

    struct FMovieSceneEasingSettings //ScriptStruct MovieScene.MovieSceneEasingSettings
    {
    //Children Prop Count (Fields): 8
    public:

        int32_t AutoEaseInDuration; // 0x0
        int32_t AutoEaseOutDuration; // 0x4
        struct TScriptInterface<IMovieSceneEasingFunction> EaseIn; // 0x8
        bool bManualEaseIn; // 0x18
        int32_t ManualEaseInDuration; // 0x1c
        struct TScriptInterface<IMovieSceneEasingFunction> EaseOut; // 0x20
        bool bManualEaseOut; // 0x30
        int32_t ManualEaseOutDuration; // 0x34

    };

    struct FMovieSceneSectionEvalOptions //ScriptStruct MovieScene.MovieSceneSectionEvalOptions
    {
    //Children Prop Count (Fields): 2
    public:

        bool bCanEditCompletionMode; // 0x0
        enum class EMovieSceneCompletionMode CompletionMode; // 0x1

    };

    struct FMovieSceneSectionParameters //ScriptStruct MovieScene.MovieSceneSectionParameters
    {
    //Children Prop Count (Fields): 9
    public:

        struct FFrameNumber StartFrameOffset; // 0x0
        bool bCanLoop; // 0x4
        struct FFrameNumber EndFrameOffset; // 0x8
        struct FFrameNumber FirstLoopStartFrameOffset; // 0xc
        float TimeScale; // 0x10
        int32_t HierarchicalBias; // 0x14
        float StartOffset; // 0x18
        float PrerollTime; // 0x1c
        float PostrollTime; // 0x20

    };

    struct FSectionEvaluationData //ScriptStruct MovieScene.SectionEvaluationData
    {
    //Children Prop Count (Fields): 3
    public:

        int32_t ImplIndex; // 0x0
        struct FFrameNumber ForcedTime; // 0x4
        enum class ESectionEvaluationFlags Flags; // 0x8

    };

    struct FMovieSceneSequencePlaybackSettings //ScriptStruct MovieScene.MovieSceneSequencePlaybackSettings
    {
    //Children Prop Count (Fields): 12
    public:

        char bAutoPlay; // 0x0
        struct FMovieSceneSequenceLoopCount LoopCount; // 0x4
        float PlayRate; // 0x8
        float StartTime; // 0xc
        char bRandomStartTime; // 0x10
        char bRestoreState; // 0x10
        char bDisableMovementInput; // 0x10
        char bDisableLookAtInput; // 0x10
        char bHidePlayer; // 0x10
        char bHideHud; // 0x10
        char bDisableCameraCuts; // 0x10
        char bPauseAtEnd; // 0x10

    };

    struct FMovieSceneSequenceLoopCount //ScriptStruct MovieScene.MovieSceneSequenceLoopCount
    {
    //Children Prop Count (Fields): 1
    public:

        int32_t Value; // 0x0

    };

    struct FMovieSceneSequenceReplProperties //ScriptStruct MovieScene.MovieSceneSequenceReplProperties
    {
    //Children Prop Count (Fields): 3
    public:

        struct FFrameTime LastKnownPosition; // 0x0
        enum class EMovieScenePlayerStatus LastKnownStatus; // 0x8
        int32_t LastKnownNumLoops; // 0xc

    };

    struct FMovieSceneWarpCounter //ScriptStruct MovieScene.MovieSceneWarpCounter
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<uint32_t> WarpCounts; // 0x0

    };

    struct FMovieSceneSpawnable //ScriptStruct MovieScene.MovieSceneSpawnable
    {
    //Children Prop Count (Fields): 9
    public:

        struct FTransform SpawnTransform; // 0x0
        struct TArray<struct FName> Tags; // 0x30
        bool bContinuouslyRespawn; // 0x40
        struct FGuid Guid; // 0x44
        struct FString Name; // 0x58
        class UObject* ObjectTemplate; // 0x68
        struct TArray<struct FGuid> ChildPossessables; // 0x70
        enum class ESpawnOwnership Ownership; // 0x80
        struct FName LevelName; // 0x84

    };

    struct FTestMovieSceneEvalTemplate : FMovieSceneEvalTemplate //ScriptStruct MovieScene.TestMovieSceneEvalTemplate
    {
    public:


    };

    struct FMovieSceneTrackDisplayOptions //ScriptStruct MovieScene.MovieSceneTrackDisplayOptions
    {
    //Children Prop Count (Fields): 1
    public:

        char bShowVerticalFrames; // 0x0

    };

    struct FMovieSceneTrackEvalOptions //ScriptStruct MovieScene.MovieSceneTrackEvalOptions
    {
    //Children Prop Count (Fields): 5
    public:

        char bCanEvaluateNearestSection; // 0x0
        char bEvalNearestSection; // 0x0
        char bEvaluateInPreroll; // 0x0
        char bEvaluateInPostroll; // 0x0
        char bEvaluateNearestSection; // 0x0

    };

    struct FCCDIKChainLink //ScriptStruct AnimationCore.CCDIKChainLink
    {
    public:


    };

    struct FAxis //ScriptStruct AnimationCore.Axis
    {
    //Children Prop Count (Fields): 2
    public:

        struct FVector Axis; // 0x0
        bool bInLocalSpace; // 0xc

    };

    struct FConstraintData //ScriptStruct AnimationCore.ConstraintData
    {
    //Children Prop Count (Fields): 5
    public:

        struct FConstraintDescriptor Constraint; // 0x0
        float Weight; // 0x10
        bool bMaintainOffset; // 0x14
        struct FTransform Offset; // 0x20
        struct FTransform CurrentTransform; // 0x50

    };

    struct FConstraintDescriptor //ScriptStruct AnimationCore.ConstraintDescriptor
    {
    //Children Prop Count (Fields): 1
    public:

        enum class EConstraintType Type; // 0x0

    };

    struct FConstraintDescriptionEx //ScriptStruct AnimationCore.ConstraintDescriptionEx
    {
    //Children Prop Count (Fields): 1
    public:

        struct FFilterOptionPerAxis AxesFilterOption; // 0x8

    };

    struct FFilterOptionPerAxis //ScriptStruct AnimationCore.FilterOptionPerAxis
    {
    //Children Prop Count (Fields): 3
    public:

        bool bX; // 0x0
        bool bY; // 0x1
        bool bZ; // 0x2

    };

    struct FAimConstraintDescription : FConstraintDescriptionEx //ScriptStruct AnimationCore.AimConstraintDescription
    {
    //Children Prop Count (Fields): 4
    public:

        struct FAxis LookAt_Axis; // 0x10
        struct FAxis LookUp_Axis; // 0x20
        bool bUseLookUp; // 0x30
        struct FVector LookUpTarget; // 0x34

    };

    struct FTransformConstraintDescription : FConstraintDescriptionEx //ScriptStruct AnimationCore.TransformConstraintDescription
    {
    //Children Prop Count (Fields): 1
    public:

        enum class ETransformConstraintType TransformType; // 0x10

    };

    struct FTransformConstraint //ScriptStruct AnimationCore.TransformConstraint
    {
    //Children Prop Count (Fields): 5
    public:

        struct FConstraintDescription Operator; // 0x0
        struct FName SourceNode; // 0x10
        struct FName TargetNode; // 0x18
        float Weight; // 0x20
        bool bMaintainOffset; // 0x24

    };

    struct FConstraintDescription //ScriptStruct AnimationCore.ConstraintDescription
    {
    //Children Prop Count (Fields): 7
    public:

        bool bTranslation; // 0x0
        bool bRotation; // 0x1
        bool bScale; // 0x2
        bool bParent; // 0x3
        struct FFilterOptionPerAxis TranslationAxes; // 0x4
        struct FFilterOptionPerAxis RotationAxes; // 0x7
        struct FFilterOptionPerAxis ScaleAxes; // 0xa

    };

    struct FConstraintOffset //ScriptStruct AnimationCore.ConstraintOffset
    {
    //Children Prop Count (Fields): 4
    public:

        struct FVector Translation; // 0x0
        struct FQuat Rotation; // 0x10
        struct FVector Scale; // 0x20
        struct FTransform Parent; // 0x30

    };

    struct FTransformFilter //ScriptStruct AnimationCore.TransformFilter
    {
    //Children Prop Count (Fields): 3
    public:

        struct FFilterOptionPerAxis TranslationFilter; // 0x0
        struct FFilterOptionPerAxis RotationFilter; // 0x3
        struct FFilterOptionPerAxis ScaleFilter; // 0x6

    };

    struct FEulerTransform //ScriptStruct AnimationCore.EulerTransform
    {
    //Children Prop Count (Fields): 3
    public:

        struct FVector Location; // 0x0
        struct FRotator Rotation; // 0xc
        struct FVector Scale; // 0x18

    };

    struct FFABRIKChainLink //ScriptStruct AnimationCore.FABRIKChainLink
    {
    public:


    };

    struct FNodeChain //ScriptStruct AnimationCore.NodeChain
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<struct FName> Nodes; // 0x0

    };

    struct FNodeHierarchyWithUserData //ScriptStruct AnimationCore.NodeHierarchyWithUserData
    {
    //Children Prop Count (Fields): 1
    public:

        struct FNodeHierarchyData Hierarchy; // 0x8

    };

    struct FNodeHierarchyData //ScriptStruct AnimationCore.NodeHierarchyData
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<struct FNodeObject> Nodes; // 0x0
        struct TArray<struct FTransform> Transforms; // 0x10
        struct TMap<struct FName, int32_t> NodeNameToIndexMapping; // 0x20

    };

    struct FNodeObject //ScriptStruct AnimationCore.NodeObject
    {
    //Children Prop Count (Fields): 2
    public:

        struct FName Name; // 0x0
        struct FName ParentName; // 0x8

    };

    struct FTransformNoScale //ScriptStruct AnimationCore.TransformNoScale
    {
    //Children Prop Count (Fields): 2
    public:

        struct FVector Location; // 0x0
        struct FQuat Rotation; // 0x10

    };

    struct FAnimNode_BlendSpacePlayer : FAnimNode_AssetPlayerBase //ScriptStruct AnimGraphRuntime.AnimNode_BlendSpacePlayer
    {
    //Children Prop Count (Fields): 9
    public:

        float X; // 0x30
        float Y; // 0x34
        float Z; // 0x38
        float PlayRate; // 0x3c
        bool bLoop; // 0x40
        bool bResetPlayTimeWhenBlendSpaceChanges; // 0x41
        float StartPosition; // 0x44
        class UBlendSpaceBase* BlendSpace; // 0x48
        class UBlendSpaceBase* PreviousBlendSpace; // 0xd8

    };

    struct FAnimNode_AimOffsetLookAt : FAnimNode_BlendSpacePlayer //ScriptStruct AnimGraphRuntime.AnimNode_AimOffsetLookAt
    {
    //Children Prop Count (Fields): 7
    public:

        struct FPoseLink BasePose; // 0x140
        int32_t LODThreshold; // 0x150
        struct FName SourceSocketName; // 0x154
        struct FName PivotSocketName; // 0x15c
        struct FVector LookAtLocation; // 0x164
        struct FVector SocketAxis; // 0x170
        float Alpha; // 0x17c

    };

    struct FAnimNode_AnimDynamics : FAnimNode_SkeletalControlBase //ScriptStruct AnimGraphRuntime.AnimNode_AnimDynamics
    {
    //Children Prop Count (Fields): 38
    public:

        float LinearDampingOverride; // 0xc8
        float AngularDampingOverride; // 0xcc
        struct FBoneReference RelativeSpaceBone; // 0x130
        struct FBoneReference BoundBone; // 0x140
        struct FBoneReference ChainEnd; // 0x150
        struct FVector BoxExtents; // 0x160
        struct FVector LocalJointOffset; // 0x16c
        float GravityScale; // 0x178
        struct FVector GravityOverride; // 0x17c
        float LinearSpringConstant; // 0x188
        float AngularSpringConstant; // 0x18c
        float WindScale; // 0x190
        struct FVector ComponentLinearAccScale; // 0x194
        struct FVector ComponentLinearVelScale; // 0x1a0
        struct FVector ComponentAppliedLinearAccClamp; // 0x1ac
        float AngularBiasOverride; // 0x1b8
        int32_t NumSolverIterationsPreUpdate; // 0x1bc
        int32_t NumSolverIterationsPostUpdate; // 0x1c0
        struct FAnimPhysConstraintSetup ConstraintSetup; // 0x1c4
        struct TArray<struct FAnimPhysSphericalLimit> SphericalLimits; // 0x210
        float SphereCollisionRadius; // 0x220
        struct FVector ExternalForce; // 0x224
        struct TArray<struct FAnimPhysPlanarLimit> PlanarLimits; // 0x230
        enum class AnimPhysCollisionType CollisionType; // 0x240
        enum class AnimPhysSimSpaceType SimulationSpace; // 0x241
        char bUseSphericalLimits; // 0x244
        char bUsePlanarLimit; // 0x244
        char bDoUpdate; // 0x244
        char bDoEval; // 0x244
        char bOverrideLinearDamping; // 0x244
        char bOverrideAngularBias; // 0x244
        char bOverrideAngularDamping; // 0x244
        char bEnableWind; // 0x244
        char bUseGravityOverride; // 0x245
        char bLinearSpring; // 0x245
        char bAngularSpring; // 0x245
        char bChain; // 0x245
        struct FRotationRetargetingInfo RetargetingSettings; // 0x250

    };

    struct FRotationRetargetingInfo //ScriptStruct AnimGraphRuntime.RotationRetargetingInfo
    {
    //Children Prop Count (Fields): 15
    public:

        bool bEnabled; // 0x0
        struct FTransform Source; // 0x10
        struct FTransform Target; // 0x40
        enum class ERotationComponent RotationComponent; // 0x70
        struct FVector TwistAxis; // 0x74
        bool bUseAbsoluteAngle; // 0x80
        float SourceMinimum; // 0x84
        float SourceMaximum; // 0x88
        float TargetMinimum; // 0x8c
        float TargetMaximum; // 0x90
        enum class EEasingFuncType EasingType; // 0x94
        struct FRuntimeFloatCurve CustomCurve; // 0x98
        bool bFlipEasing; // 0x120
        float EasingWeight; // 0x124
        bool bClamp; // 0x128

    };

    struct FAnimPhysPlanarLimit //ScriptStruct AnimGraphRuntime.AnimPhysPlanarLimit
    {
    //Children Prop Count (Fields): 2
    public:

        struct FBoneReference DrivingBone; // 0x0
        struct FTransform PlaneTransform; // 0x10

    };

    struct FAnimPhysSphericalLimit //ScriptStruct AnimGraphRuntime.AnimPhysSphericalLimit
    {
    //Children Prop Count (Fields): 4
    public:

        struct FBoneReference DrivingBone; // 0x0
        struct FVector SphereLocalOffset; // 0x10
        float LimitRadius; // 0x1c
        enum class ESphericalLimitType LimitType; // 0x20

    };

    struct FAnimPhysConstraintSetup //ScriptStruct AnimGraphRuntime.AnimPhysConstraintSetup
    {
    //Children Prop Count (Fields): 12
    public:

        enum class AnimPhysLinearConstraintType LinearXLimitType; // 0x0
        enum class AnimPhysLinearConstraintType LinearYLimitType; // 0x1
        enum class AnimPhysLinearConstraintType LinearZLimitType; // 0x2
        struct FVector LinearAxesMin; // 0x4
        struct FVector LinearAxesMax; // 0x10
        enum class AnimPhysAngularConstraintType AngularConstraintType; // 0x1c
        enum class AnimPhysTwistAxis TwistAxis; // 0x1d
        enum class AnimPhysTwistAxis AngularTargetAxis; // 0x1e
        float ConeAngle; // 0x20
        struct FVector AngularLimitsMin; // 0x24
        struct FVector AngularLimitsMax; // 0x30
        struct FVector AngularTarget; // 0x3c

    };

    struct FAnimNode_ApplyAdditive : FAnimNode_Base //ScriptStruct AnimGraphRuntime.AnimNode_ApplyAdditive
    {
    //Children Prop Count (Fields): 10
    public:

        struct FPoseLink base; // 0x10
        struct FPoseLink Additive; // 0x20
        float Alpha; // 0x30
        struct FInputScaleBias AlphaScaleBias; // 0x34
        int32_t LODThreshold; // 0x3c
        struct FInputAlphaBoolBlend AlphaBoolBlend; // 0x40
        struct FName AlphaCurveName; // 0x88
        struct FInputScaleBiasClamp AlphaScaleBiasClamp; // 0x90
        enum class EAnimAlphaInputType AlphaInputType; // 0xc4
        bool bAlphaBoolEnabled; // 0xc5

    };

    struct FAnimNode_ApplyLimits : FAnimNode_SkeletalControlBase //ScriptStruct AnimGraphRuntime.AnimNode_ApplyLimits
    {
    //Children Prop Count (Fields): 2
    public:

        struct TArray<struct FAngularRangeLimit> AngularRangeLimits; // 0xc8
        struct TArray<struct FVector> AngularOffsets; // 0xd8

    };

    struct FAngularRangeLimit //ScriptStruct AnimGraphRuntime.AngularRangeLimit
    {
    //Children Prop Count (Fields): 3
    public:

        struct FVector LimitMin; // 0x0
        struct FVector LimitMax; // 0xc
        struct FBoneReference Bone; // 0x18

    };

    struct FAnimNode_BlendBoneByChannel : FAnimNode_Base //ScriptStruct AnimGraphRuntime.AnimNode_BlendBoneByChannel
    {
    //Children Prop Count (Fields): 6
    public:

        struct FPoseLink A; // 0x10
        struct FPoseLink B; // 0x20
        struct TArray<struct FBlendBoneByChannelEntry> BoneDefinitions; // 0x30
        float Alpha; // 0x50
        struct FInputScaleBias AlphaScaleBias; // 0x58
        enum class EBoneControlSpace TransformsSpace; // 0x60

    };

    struct FBlendBoneByChannelEntry //ScriptStruct AnimGraphRuntime.BlendBoneByChannelEntry
    {
    //Children Prop Count (Fields): 5
    public:

        struct FBoneReference SourceBone; // 0x0
        struct FBoneReference TargetBone; // 0x10
        bool bBlendTranslation; // 0x20
        bool bBlendRotation; // 0x21
        bool bBlendScale; // 0x22

    };

    struct FAnimNode_BlendListBase : FAnimNode_Base //ScriptStruct AnimGraphRuntime.AnimNode_BlendListBase
    {
    //Children Prop Count (Fields): 7
    public:

        struct TArray<struct FPoseLink> BlendPose; // 0x10
        struct TArray<float> BlendTime; // 0x20
        enum class EBlendListTransitionType TransitionType; // 0x30
        enum class EAlphaBlendOption BlendType; // 0x31
        bool bResetChildOnActivation; // 0x32
        class UCurveFloat* CustomBlendCurve; // 0x38
        class UBlendProfile* BlendProfile; // 0x40

    };

    struct FAnimNode_BlendListByBool : FAnimNode_BlendListBase //ScriptStruct AnimGraphRuntime.AnimNode_BlendListByBool
    {
    //Children Prop Count (Fields): 1
    public:

        bool bActiveValue; // 0x98

    };

    struct FAnimNode_BlendListByEnum : FAnimNode_BlendListBase //ScriptStruct AnimGraphRuntime.AnimNode_BlendListByEnum
    {
    //Children Prop Count (Fields): 2
    public:

        struct TArray<int32_t> EnumToPoseIndex; // 0x98
        char ActiveEnumValue; // 0xa8

    };

    struct FAnimNode_BlendListByInt : FAnimNode_BlendListBase //ScriptStruct AnimGraphRuntime.AnimNode_BlendListByInt
    {
    //Children Prop Count (Fields): 1
    public:

        int32_t ActiveChildIndex; // 0x98

    };

    struct FAnimNode_BlendSpaceEvaluator : FAnimNode_BlendSpacePlayer //ScriptStruct AnimGraphRuntime.AnimNode_BlendSpaceEvaluator
    {
    //Children Prop Count (Fields): 1
    public:

        float NormalizedTime; // 0xe0

    };

    struct FAnimNode_BoneDrivenController : FAnimNode_SkeletalControlBase //ScriptStruct AnimGraphRuntime.AnimNode_BoneDrivenController
    {
    //Children Prop Count (Fields): 22
    public:

        struct FBoneReference SourceBone; // 0xc8
        class UCurveFloat* DrivingCurve; // 0xd8
        float Multiplier; // 0xe0
        float RangeMin; // 0xe4
        float RangeMax; // 0xe8
        float RemappedMin; // 0xec
        float RemappedMax; // 0xf0
        struct FName ParameterName; // 0xf4
        struct FBoneReference TargetBone; // 0xfc
        enum class EDrivenDestinationMode DestinationMode; // 0x10c
        enum class EDrivenBoneModificationMode ModificationMode; // 0x10d
        enum class EComponentType SourceComponent; // 0x10e
        char bUseRange; // 0x10f
        char bAffectTargetTranslationX; // 0x10f
        char bAffectTargetTranslationY; // 0x10f
        char bAffectTargetTranslationZ; // 0x10f
        char bAffectTargetRotationX; // 0x10f
        char bAffectTargetRotationY; // 0x10f
        char bAffectTargetRotationZ; // 0x10f
        char bAffectTargetScaleX; // 0x10f
        char bAffectTargetScaleY; // 0x110
        char bAffectTargetScaleZ; // 0x110

    };

    struct FAnimNode_CCDIK : FAnimNode_SkeletalControlBase //ScriptStruct AnimGraphRuntime.AnimNode_CCDIK
    {
    //Children Prop Count (Fields): 10
    public:

        struct FVector EffectorLocation; // 0xc8
        enum class EBoneControlSpace EffectorLocationSpace; // 0xd4
        struct FBoneSocketTarget EffectorTarget; // 0xe0
        struct FBoneReference TipBone; // 0x140
        struct FBoneReference RootBone; // 0x150
        float Precision; // 0x160
        int32_t MaxIterations; // 0x164
        bool bStartFromTail; // 0x168
        bool bEnableRotationLimit; // 0x169
        struct TArray<float> RotationLimitPerJoints; // 0x170

    };

    struct FBoneSocketTarget //ScriptStruct AnimGraphRuntime.BoneSocketTarget
    {
    //Children Prop Count (Fields): 3
    public:

        bool bUseSocket; // 0x0
        struct FBoneReference BoneReference; // 0x4
        struct FSocketReference SocketReference; // 0x20

    };

    struct FSocketReference //ScriptStruct AnimGraphRuntime.SocketReference
    {
    //Children Prop Count (Fields): 1
    public:

        struct FName SocketName; // 0x30

    };

    struct FAnimNode_Constraint : FAnimNode_SkeletalControlBase //ScriptStruct AnimGraphRuntime.AnimNode_Constraint
    {
    //Children Prop Count (Fields): 3
    public:

        struct FBoneReference BoneToModify; // 0xc8
        struct TArray<struct FConstraint> ConstraintSetup; // 0xd8
        struct TArray<float> ConstraintWeights; // 0xe8

    };

    struct FConstraint //ScriptStruct AnimGraphRuntime.Constraint
    {
    //Children Prop Count (Fields): 4
    public:

        struct FBoneReference TargetBone; // 0x0
        enum class EConstraintOffsetOption OffsetOption; // 0x10
        enum class ETransformConstraintType TransformType; // 0x11
        struct FFilterOptionPerAxis PerAxis; // 0x12

    };

    struct FAnimNode_CopyBone : FAnimNode_SkeletalControlBase //ScriptStruct AnimGraphRuntime.AnimNode_CopyBone
    {
    //Children Prop Count (Fields): 6
    public:

        struct FBoneReference SourceBone; // 0xc8
        struct FBoneReference TargetBone; // 0xd8
        bool bCopyTranslation; // 0xe8
        bool bCopyRotation; // 0xe9
        bool bCopyScale; // 0xea
        enum class EBoneControlSpace ControlSpace; // 0xeb

    };

    struct FAnimNode_CopyBoneDelta : FAnimNode_SkeletalControlBase //ScriptStruct AnimGraphRuntime.AnimNode_CopyBoneDelta
    {
    //Children Prop Count (Fields): 9
    public:

        struct FBoneReference SourceBone; // 0xc8
        struct FBoneReference TargetBone; // 0xd8
        bool bCopyTranslation; // 0xe8
        bool bCopyRotation; // 0xe9
        bool bCopyScale; // 0xea
        enum class CopyBoneDeltaMode CopyMode; // 0xeb
        float TranslationMultiplier; // 0xec
        float RotationMultiplier; // 0xf0
        float ScaleMultiplier; // 0xf4

    };

    struct FAnimNode_CopyPoseFromMesh : FAnimNode_Base //ScriptStruct AnimGraphRuntime.AnimNode_CopyPoseFromMesh
    {
    //Children Prop Count (Fields): 3
    public:

        struct TWeakObjectPtr<struct USkeletalMeshComponent> SourceMeshComponent; // 0x10
        bool bUseAttachedParent; // 0x18
        bool bCopyCurves; // 0x19

    };

    struct FAnimNode_CurveSource : FAnimNode_Base //ScriptStruct AnimGraphRuntime.AnimNode_CurveSource
    {
    //Children Prop Count (Fields): 4
    public:

        struct FPoseLink SourcePose; // 0x10
        struct FName SourceBinding; // 0x20
        float Alpha; // 0x28
        struct TScriptInterface<ICurveSourceInterface> CurveSource; // 0x30

    };

    struct FAnimNode_Fabrik : FAnimNode_SkeletalControlBase //ScriptStruct AnimGraphRuntime.AnimNode_Fabrik
    {
    //Children Prop Count (Fields): 8
    public:

        struct FTransform EffectorTransform; // 0xd0
        struct FBoneSocketTarget EffectorTarget; // 0x100
        struct FBoneReference TipBone; // 0x160
        struct FBoneReference RootBone; // 0x170
        float Precision; // 0x180
        int32_t MaxIterations; // 0x184
        enum class EBoneControlSpace EffectorTransformSpace; // 0x188
        enum class EBoneRotationSource EffectorRotationSource; // 0x189

    };

    struct FAnimNode_HandIKRetargeting : FAnimNode_SkeletalControlBase //ScriptStruct AnimGraphRuntime.AnimNode_HandIKRetargeting
    {
    //Children Prop Count (Fields): 6
    public:

        struct FBoneReference RightHandFK; // 0xc8
        struct FBoneReference LeftHandFK; // 0xd8
        struct FBoneReference RightHandIK; // 0xe8
        struct FBoneReference LeftHandIK; // 0xf8
        struct TArray<struct FBoneReference> IKBonesToMove; // 0x108
        float HandFKWeight; // 0x118

    };

    struct FAnimNode_LayeredBoneBlend : FAnimNode_Base //ScriptStruct AnimGraphRuntime.AnimNode_LayeredBoneBlend
    {
    //Children Prop Count (Fields): 12
    public:

        struct FPoseLink BasePose; // 0x10
        struct TArray<struct FPoseLink> BlendPoses; // 0x20
        struct TArray<struct FInputBlendPose> LayerSetup; // 0x30
        struct TArray<float> BlendWeights; // 0x40
        bool bMeshSpaceRotationBlend; // 0x50
        bool bMeshSpaceScaleBlend; // 0x51
        enum class ECurveBlendOption CurveBlendOption; // 0x52
        bool bBlendRootMotionBasedOnRootBone; // 0x53
        int32_t LODThreshold; // 0x58
        struct TArray<struct FPerBoneBlendWeight> PerBoneBlendWeights; // 0x60
        struct FGuid SkeletonGuid; // 0x70
        struct FGuid VirtualBoneGuid; // 0x80

    };

    struct FInputBlendPose //ScriptStruct Engine.InputBlendPose
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<struct FBranchFilter> BranchFilters; // 0x0

    };

    struct FBranchFilter //ScriptStruct Engine.BranchFilter
    {
    //Children Prop Count (Fields): 2
    public:

        struct FName BoneName; // 0x0
        int32_t BlendDepth; // 0x8

    };

    struct FAnimNode_LegIK : FAnimNode_SkeletalControlBase //ScriptStruct AnimGraphRuntime.AnimNode_LegIK
    {
    //Children Prop Count (Fields): 3
    public:

        float ReachPrecision; // 0xc8
        int32_t MaxIterations; // 0xcc
        struct TArray<struct FAnimLegIKDefinition> LegsDefinition; // 0xd0

    };

    struct FAnimLegIKDefinition //ScriptStruct AnimGraphRuntime.AnimLegIKDefinition
    {
    //Children Prop Count (Fields): 8
    public:

        struct FBoneReference IKFootBone; // 0x0
        struct FBoneReference FKFootBone; // 0x10
        int32_t NumBonesInLimb; // 0x20
        float MinRotationAngle; // 0x24
        enum class EAxis FootBoneForwardAxis; // 0x28
        enum class EAxis HingeRotationAxis; // 0x29
        bool bEnableRotationLimit; // 0x2a
        bool bEnableKneeTwistCorrection; // 0x2b

    };

    struct FAnimLegIKData //ScriptStruct AnimGraphRuntime.AnimLegIKData
    {
    public:


    };

    struct FIKChain //ScriptStruct AnimGraphRuntime.IKChain
    {
    public:


    };

    struct FIKChainLink //ScriptStruct AnimGraphRuntime.IKChainLink
    {
    public:


    };

    struct FAnimNode_LookAt : FAnimNode_SkeletalControlBase //ScriptStruct AnimGraphRuntime.AnimNode_LookAt
    {
    //Children Prop Count (Fields): 10
    public:

        struct FBoneReference BoneToModify; // 0xc8
        struct FBoneSocketTarget LookAtTarget; // 0xe0
        struct FVector LookAtLocation; // 0x140
        struct FAxis LookAt_Axis; // 0x14c
        bool bUseLookUpAxis; // 0x15c
        enum class EInterpolationBlend InterpolationType; // 0x15d
        struct FAxis LookUp_Axis; // 0x160
        float LookAtClamp; // 0x170
        float InterpolationTime; // 0x174
        float InterpolationTriggerThreashold; // 0x178

    };

    struct FAnimNode_MakeDynamicAdditive : FAnimNode_Base //ScriptStruct AnimGraphRuntime.AnimNode_MakeDynamicAdditive
    {
    //Children Prop Count (Fields): 3
    public:

        struct FPoseLink base; // 0x10
        struct FPoseLink Additive; // 0x20
        bool bMeshSpaceAdditive; // 0x30

    };

    struct FAnimNode_ModifyBone : FAnimNode_SkeletalControlBase //ScriptStruct AnimGraphRuntime.AnimNode_ModifyBone
    {
    //Children Prop Count (Fields): 10
    public:

        struct FBoneReference BoneToModify; // 0xc8
        struct FVector Translation; // 0xd8
        struct FRotator Rotation; // 0xe4
        struct FVector Scale; // 0xf0
        enum class EBoneModificationMode TranslationMode; // 0xfc
        enum class EBoneModificationMode RotationMode; // 0xfd
        enum class EBoneModificationMode ScaleMode; // 0xfe
        enum class EBoneControlSpace TranslationSpace; // 0xff
        enum class EBoneControlSpace RotationSpace; // 0x100
        enum class EBoneControlSpace ScaleSpace; // 0x101

    };

    struct FAnimNode_ModifyCurve : FAnimNode_Base //ScriptStruct AnimGraphRuntime.AnimNode_ModifyCurve
    {
    //Children Prop Count (Fields): 5
    public:

        struct FPoseLink SourcePose; // 0x10
        struct TArray<float> CurveValues; // 0x20
        struct TArray<struct FName> CurveNames; // 0x30
        float Alpha; // 0x50
        enum class EModifyCurveApplyMode ApplyMode; // 0x54

    };

    struct FAnimNode_MultiWayBlend : FAnimNode_Base //ScriptStruct AnimGraphRuntime.AnimNode_MultiWayBlend
    {
    //Children Prop Count (Fields): 5
    public:

        struct TArray<struct FPoseLink> Poses; // 0x10
        struct TArray<float> DesiredAlphas; // 0x20
        struct FInputScaleBias AlphaScaleBias; // 0x40
        bool bAdditiveNode; // 0x48
        bool bNormalizeAlpha; // 0x49

    };

    struct FAnimNode_ObserveBone : FAnimNode_SkeletalControlBase //ScriptStruct AnimGraphRuntime.AnimNode_ObserveBone
    {
    //Children Prop Count (Fields): 6
    public:

        struct FBoneReference BoneToObserve; // 0xc8
        enum class EBoneControlSpace DisplaySpace; // 0xd8
        bool bRelativeToRefPose; // 0xd9
        struct FVector Translation; // 0xdc
        struct FRotator Rotation; // 0xe8
        struct FVector Scale; // 0xf4

    };

    struct FAnimNode_PoseHandler : FAnimNode_AssetPlayerBase //ScriptStruct AnimGraphRuntime.AnimNode_PoseHandler
    {
    //Children Prop Count (Fields): 1
    public:

        class UPoseAsset* PoseAsset; // 0x30

    };

    struct FAnimNode_PoseBlendNode : FAnimNode_PoseHandler //ScriptStruct AnimGraphRuntime.AnimNode_PoseBlendNode
    {
    //Children Prop Count (Fields): 3
    public:

        struct FPoseLink SourcePose; // 0x78
        enum class EAlphaBlendOption BlendOption; // 0x88
        class UCurveFloat* CustomCurve; // 0x90

    };

    struct FAnimNode_PoseByName : FAnimNode_PoseHandler //ScriptStruct AnimGraphRuntime.AnimNode_PoseByName
    {
    //Children Prop Count (Fields): 2
    public:

        struct FName PoseName; // 0x78
        float PoseWeight; // 0x80

    };

    struct FAnimNode_PoseDriver : FAnimNode_PoseHandler //ScriptStruct AnimGraphRuntime.AnimNode_PoseDriver
    {
    //Children Prop Count (Fields): 9
    public:

        struct FPoseLink SourcePose; // 0x78
        struct TArray<struct FBoneReference> SourceBones; // 0x88
        struct TArray<struct FBoneReference> OnlyDriveBones; // 0x98
        struct TArray<struct FPoseDriverTarget> PoseTargets; // 0xa8
        struct FBoneReference EvalSpaceBone; // 0xe8
        struct FRBFParams RBFParams; // 0xf8
        enum class EPoseDriverSource DriveSource; // 0x124
        enum class EPoseDriverOutput DriveOutput; // 0x125
        char bOnlyDriveSelectedBones; // 0x126

    };

    struct FRBFParams //ScriptStruct AnimGraphRuntime.RBFParams
    {
    //Children Prop Count (Fields): 11
    public:

        int32_t TargetDimensions; // 0x0
        enum class ERBFSolverType SolverType; // 0x4
        float Radius; // 0x8
        enum class ERBFFunctionType Function; // 0xc
        enum class ERBFDistanceMethod DistanceMethod; // 0xd
        enum class EBoneAxis TwistAxis; // 0xe
        float WeightThreshold; // 0x10
        enum class ERBFNormalizeMethod NormalizeMethod; // 0x14
        struct FVector MedianReference; // 0x18
        float MedianMin; // 0x24
        float MedianMax; // 0x28

    };

    struct FPoseDriverTarget //ScriptStruct AnimGraphRuntime.PoseDriverTarget
    {
    //Children Prop Count (Fields): 9
    public:

        struct TArray<struct FPoseDriverTransform> BoneTransforms; // 0x0
        struct FRotator TargetRotation; // 0x10
        float TargetScale; // 0x1c
        enum class ERBFDistanceMethod DistanceMethod; // 0x20
        enum class ERBFFunctionType FunctionType; // 0x21
        bool bApplyCustomCurve; // 0x22
        struct FRichCurve CustomCurve; // 0x28
        struct FName DrivenName; // 0xa8
        bool bIsHidden; // 0xb8

    };

    struct FPoseDriverTransform //ScriptStruct AnimGraphRuntime.PoseDriverTransform
    {
    //Children Prop Count (Fields): 2
    public:

        struct FVector TargetTranslation; // 0x0
        struct FRotator TargetRotation; // 0xc

    };

    struct FAnimNode_PoseSnapshot : FAnimNode_Base //ScriptStruct AnimGraphRuntime.AnimNode_PoseSnapshot
    {
    //Children Prop Count (Fields): 3
    public:

        struct FName SnapshotName; // 0x10
        struct FPoseSnapshot Snapshot; // 0x18
        enum class ESnapshotSourceMode Mode; // 0x50

    };

    struct FPoseSnapshot //ScriptStruct Engine.PoseSnapshot
    {
    //Children Prop Count (Fields): 5
    public:

        struct TArray<struct FTransform> LocalTransforms; // 0x0
        struct TArray<struct FName> BoneNames; // 0x10
        struct FName SkeletalMeshName; // 0x20
        struct FName SnapshotName; // 0x28
        bool bIsValid; // 0x30

    };

    struct FAnimNode_RandomPlayer : FAnimNode_Base //ScriptStruct AnimGraphRuntime.AnimNode_RandomPlayer
    {
    //Children Prop Count (Fields): 2
    public:

        struct TArray<struct FRandomPlayerSequenceEntry> Entries; // 0x10
        bool bShuffleMode; // 0x70

    };

    struct FRandomPlayerSequenceEntry //ScriptStruct AnimGraphRuntime.RandomPlayerSequenceEntry
    {
    //Children Prop Count (Fields): 7
    public:

        class UAnimSequence* Sequence; // 0x0
        float ChanceToPlay; // 0x8
        int32_t MinLoopCount; // 0xc
        int32_t MaxLoopCount; // 0x10
        float MinPlayRate; // 0x14
        float MaxPlayRate; // 0x18
        struct FAlphaBlend BlendIn; // 0x20

    };

    struct FAnimNode_MeshSpaceRefPose : FAnimNode_Base //ScriptStruct AnimGraphRuntime.AnimNode_MeshSpaceRefPose
    {
    public:


    };

    struct FAnimNode_RefPose : FAnimNode_Base //ScriptStruct AnimGraphRuntime.AnimNode_RefPose
    {
    //Children Prop Count (Fields): 1
    public:

        enum class ERefPoseType RefPoseType; // 0x10

    };

    struct FAnimNode_ResetRoot : FAnimNode_SkeletalControlBase //ScriptStruct AnimGraphRuntime.AnimNode_ResetRoot
    {
    public:


    };

    struct FAnimNode_RigidBody : FAnimNode_SkeletalControlBase //ScriptStruct AnimGraphRuntime.AnimNode_RigidBody
    {
    //Children Prop Count (Fields): 17
    public:

        class UPhysicsAsset* OverridePhysicsAsset; // 0xc8
        struct FVector OverrideWorldGravity; // 0x168
        struct FVector ExternalForce; // 0x174
        struct FVector ComponentLinearAccScale; // 0x180
        struct FVector ComponentLinearVelScale; // 0x18c
        struct FVector ComponentAppliedLinearAccClamp; // 0x198
        float CachedBoundsScale; // 0x1a4
        struct FBoneReference BaseBoneRef; // 0x1a8
        enum class ECollisionChannel OverlapChannel; // 0x1b8
        enum class ESimulationSpace SimulationSpace; // 0x1b9
        bool bForceDisableCollisionBetweenConstraintBodies; // 0x1ba
        char bEnableWorldGeometry; // 0x1bc
        char bOverrideWorldGravity; // 0x1bc
        char bTransferBoneVelocities; // 0x1bc
        char bFreezeIncomingPoseOnStart; // 0x1bc
        char bClampLinearTranslationLimitToRefPose; // 0x1bc
        struct FSolverIterations OverrideSolverIterations; // 0x1c0

    };

    struct FSolverIterations //ScriptStruct Engine.SolverIterations
    {
    //Children Prop Count (Fields): 6
    public:

        int32_t SolverIterations; // 0x0
        int32_t JointIterations; // 0x4
        int32_t CollisionIterations; // 0x8
        int32_t SolverPushOutIterations; // 0xc
        int32_t JointPushOutIterations; // 0x10
        int32_t CollisionPushOutIterations; // 0x14

    };

    struct FAnimNode_RigidBody_Chaos : FAnimNode_SkeletalControlBase //ScriptStruct AnimGraphRuntime.AnimNode_RigidBody_Chaos
    {
    //Children Prop Count (Fields): 17
    public:

        class UPhysicsAsset* OverridePhysicsAsset; // 0xc8
        struct FVector OverrideWorldGravity; // 0xd0
        struct FVector ExternalForce; // 0xdc
        struct FVector ComponentLinearAccScale; // 0xe8
        struct FVector ComponentLinearVelScale; // 0xf4
        struct FVector ComponentAppliedLinearAccClamp; // 0x100
        float CachedBoundsScale; // 0x10c
        struct FBoneReference BaseBoneRef; // 0x110
        enum class ECollisionChannel OverlapChannel; // 0x120
        enum class ESimulationSpace SimulationSpace; // 0x121
        bool bForceDisableCollisionBetweenConstraintBodies; // 0x122
        char bEnableWorldGeometry; // 0x123
        char bOverrideWorldGravity; // 0x123
        char bTransferBoneVelocities; // 0x123
        char bFreezeIncomingPoseOnStart; // 0x123
        char bClampLinearTranslationLimitToRefPose; // 0x123
        struct FSolverIterations OverrideSolverIterations; // 0x124

    };

    struct FAnimNode_RotateRootBone : FAnimNode_Base //ScriptStruct AnimGraphRuntime.AnimNode_RotateRootBone
    {
    //Children Prop Count (Fields): 6
    public:

        struct FPoseLink BasePose; // 0x10
        float Pitch; // 0x20
        float Yaw; // 0x24
        struct FInputScaleBiasClamp PitchScaleBiasClamp; // 0x28
        struct FInputScaleBiasClamp YawScaleBiasClamp; // 0x58
        struct FRotator MeshToComponent; // 0x88

    };

    struct FAnimNode_RotationMultiplier : FAnimNode_SkeletalControlBase //ScriptStruct AnimGraphRuntime.AnimNode_RotationMultiplier
    {
    //Children Prop Count (Fields): 5
    public:

        struct FBoneReference TargetBone; // 0xc8
        struct FBoneReference SourceBone; // 0xd8
        float Multiplier; // 0xe8
        enum class EBoneAxis RotationAxisToRefer; // 0xec
        bool bIsAdditive; // 0xed

    };

    struct FAnimNode_RotationOffsetBlendSpace : FAnimNode_BlendSpacePlayer //ScriptStruct AnimGraphRuntime.AnimNode_RotationOffsetBlendSpace
    {
    //Children Prop Count (Fields): 9
    public:

        struct FPoseLink BasePose; // 0xe0
        int32_t LODThreshold; // 0xf0
        float Alpha; // 0xf4
        struct FInputScaleBias AlphaScaleBias; // 0xf8
        struct FInputAlphaBoolBlend AlphaBoolBlend; // 0x100
        struct FName AlphaCurveName; // 0x148
        struct FInputScaleBiasClamp AlphaScaleBiasClamp; // 0x150
        enum class EAnimAlphaInputType AlphaInputType; // 0x184
        bool bAlphaBoolEnabled; // 0x185

    };

    struct FAnimNode_ScaleChainLength : FAnimNode_Base //ScriptStruct AnimGraphRuntime.AnimNode_ScaleChainLength
    {
    //Children Prop Count (Fields): 8
    public:

        struct FPoseLink InputPose; // 0x10
        float DefaultChainLength; // 0x20
        struct FBoneReference ChainStartBone; // 0x24
        struct FBoneReference ChainEndBone; // 0x34
        struct FVector TargetLocation; // 0x44
        float Alpha; // 0x50
        struct FInputScaleBias AlphaScaleBias; // 0x58
        enum class EScaleChainInitialLength ChainInitialLength; // 0x60

    };

    struct FAnimNode_SequenceEvaluator : FAnimNode_AssetPlayerBase //ScriptStruct AnimGraphRuntime.AnimNode_SequenceEvaluator
    {
    //Children Prop Count (Fields): 6
    public:

        class UAnimSequenceBase* Sequence; // 0x30
        float ExplicitTime; // 0x38
        bool bShouldLoop; // 0x3c
        bool bTeleportToExplicitTime; // 0x3d
        enum class ESequenceEvalReinit ReinitializationBehavior; // 0x3e
        float StartPosition; // 0x40

    };

    struct FAnimNode_Slot : FAnimNode_Base //ScriptStruct AnimGraphRuntime.AnimNode_Slot
    {
    //Children Prop Count (Fields): 3
    public:

        struct FPoseLink Source; // 0x10
        struct FName SlotName; // 0x20
        bool bAlwaysUpdateSourcePose; // 0x28

    };

    struct FAnimNode_SplineIK : FAnimNode_SkeletalControlBase //ScriptStruct AnimGraphRuntime.AnimNode_SplineIK
    {
    //Children Prop Count (Fields): 12
    public:

        struct FBoneReference StartBone; // 0xc8
        struct FBoneReference EndBone; // 0xd8
        enum class ESplineBoneAxis BoneAxis; // 0xe8
        bool bAutoCalculateSpline; // 0xe9
        int32_t PointCount; // 0xec
        struct TArray<struct FTransform> ControlPoints; // 0xf0
        float Roll; // 0x100
        float TwistStart; // 0x104
        float TwistEnd; // 0x108
        struct FAlphaBlend TwistBlend; // 0x110
        float Stretch; // 0x140
        float Offset; // 0x144

    };

    struct FSplineIKCachedBoneData //ScriptStruct AnimGraphRuntime.SplineIKCachedBoneData
    {
    //Children Prop Count (Fields): 2
    public:

        struct FBoneReference Bone; // 0x0
        int32_t RefSkeletonIndex; // 0x10

    };

    struct FAnimNode_SpringBone : FAnimNode_SkeletalControlBase //ScriptStruct AnimGraphRuntime.AnimNode_SpringBone
    {
    //Children Prop Count (Fields): 12
    public:

        struct FBoneReference SpringBone; // 0xc8
        float MaxDisplacement; // 0xd8
        float SpringStiffness; // 0xdc
        float SpringDamping; // 0xe0
        float ErrorResetThresh; // 0xe4
        char bLimitDisplacement; // 0x124
        char bTranslateX; // 0x124
        char bTranslateY; // 0x124
        char bTranslateZ; // 0x124
        char bRotateX; // 0x124
        char bRotateY; // 0x124
        char bRotateZ; // 0x124

    };

    struct FAnimNode_Root : FAnimNode_Base //ScriptStruct Engine.AnimNode_Root
    {
    //Children Prop Count (Fields): 3
    public:

        struct FPoseLink Result; // 0x10
        struct FName Name; // 0x20
        struct FName Group; // 0x28

    };

    struct FAnimNode_StateResult : FAnimNode_Root //ScriptStruct AnimGraphRuntime.AnimNode_StateResult
    {
    public:


    };

    struct FAnimNode_Trail : FAnimNode_SkeletalControlBase //ScriptStruct AnimGraphRuntime.AnimNode_Trail
    {
    //Children Prop Count (Fields): 20
    public:

        struct FBoneReference TrailBone; // 0x100
        int32_t ChainLength; // 0x110
        enum class EAxis ChainBoneAxis; // 0x114
        char bInvertChainBoneAxis; // 0x115
        char bLimitStretch; // 0x115
        char bLimitRotation; // 0x115
        char bUsePlanarLimit; // 0x115
        char bActorSpaceFakeVel; // 0x115
        char bReorientParentToChild; // 0x115
        float MaxDeltaTime; // 0x118
        float RelaxationSpeedScale; // 0x11c
        struct FRuntimeFloatCurve TrailRelaxationSpeed; // 0x120
        struct FInputScaleBiasClamp RelaxationSpeedScaleInputProcessor; // 0x1a8
        struct TArray<struct FRotationLimit> RotationLimits; // 0x1d8
        struct TArray<struct FVector> RotationOffsets; // 0x1e8
        struct TArray<struct FAnimPhysPlanarLimit> PlanarLimits; // 0x1f8
        float StretchLimit; // 0x208
        struct FVector FakeVelocity; // 0x20c
        struct FBoneReference BaseJoint; // 0x218
        float LastBoneRotationAnimAlphaBlend; // 0x228

    };

    struct FRotationLimit //ScriptStruct AnimGraphRuntime.RotationLimit
    {
    //Children Prop Count (Fields): 2
    public:

        struct FVector LimitMin; // 0x0
        struct FVector LimitMax; // 0xc

    };

    struct FAnimNode_TwistCorrectiveNode : FAnimNode_SkeletalControlBase //ScriptStruct AnimGraphRuntime.AnimNode_TwistCorrectiveNode
    {
    //Children Prop Count (Fields): 7
    public:

        struct FReferenceBoneFrame BaseFrame; // 0xc8
        struct FReferenceBoneFrame TwistFrame; // 0xe8
        struct FAxis TwistPlaneNormalAxis; // 0x108
        float RangeMax; // 0x118
        float RemappedMin; // 0x11c
        float RemappedMax; // 0x120
        struct FAnimCurveParam Curve; // 0x124

    };

    struct FAnimCurveParam //ScriptStruct Engine.AnimCurveParam
    {
    //Children Prop Count (Fields): 1
    public:

        struct FName Name; // 0x0

    };

    struct FReferenceBoneFrame //ScriptStruct AnimGraphRuntime.ReferenceBoneFrame
    {
    //Children Prop Count (Fields): 2
    public:

        struct FBoneReference Bone; // 0x0
        struct FAxis Axis; // 0x10

    };

    struct FAnimNode_TwoBoneIK : FAnimNode_SkeletalControlBase //ScriptStruct AnimGraphRuntime.AnimNode_TwoBoneIK
    {
    //Children Prop Count (Fields): 14
    public:

        struct FBoneReference IKBone; // 0xc8
        float StartStretchRatio; // 0xd8
        float MaxStretchScale; // 0xdc
        struct FVector EffectorLocation; // 0xe0
        struct FBoneSocketTarget EffectorTarget; // 0xf0
        struct FVector JointTargetLocation; // 0x150
        struct FBoneSocketTarget JointTarget; // 0x160
        struct FAxis TwistAxis; // 0x1c0
        enum class EBoneControlSpace EffectorLocationSpace; // 0x1d0
        enum class EBoneControlSpace JointTargetLocationSpace; // 0x1d1
        char bAllowStretching; // 0x1d2
        char bTakeRotationFromEffectorSpace; // 0x1d2
        char bMaintainEffectorRelRot; // 0x1d2
        char bAllowTwist; // 0x1d2

    };

    struct FAnimNode_TwoWayBlend : FAnimNode_Base //ScriptStruct AnimGraphRuntime.AnimNode_TwoWayBlend
    {
    //Children Prop Count (Fields): 10
    public:

        struct FPoseLink A; // 0x10
        struct FPoseLink B; // 0x20
        enum class EAnimAlphaInputType AlphaInputType; // 0x30
        char bAlphaBoolEnabled; // 0x31
        char bResetChildOnActivation; // 0x31
        float Alpha; // 0x34
        struct FInputScaleBias AlphaScaleBias; // 0x38
        struct FInputAlphaBoolBlend AlphaBoolBlend; // 0x40
        struct FName AlphaCurveName; // 0x88
        struct FInputScaleBiasClamp AlphaScaleBiasClamp; // 0x90

    };

    struct FAnimSequencerInstanceProxy : FAnimInstanceProxy //ScriptStruct AnimGraphRuntime.AnimSequencerInstanceProxy
    {
    public:


    };

    struct FPositionHistory //ScriptStruct AnimGraphRuntime.PositionHistory
    {
    //Children Prop Count (Fields): 2
    public:

        struct TArray<struct FVector> Positions; // 0x0
        float Range; // 0x10

    };

    struct FRBFEntry //ScriptStruct AnimGraphRuntime.RBFEntry
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<float> Values; // 0x0

    };

    struct FRBFTarget : FRBFEntry //ScriptStruct AnimGraphRuntime.RBFTarget
    {
    //Children Prop Count (Fields): 5
    public:

        float ScaleFactor; // 0x10
        bool bApplyCustomCurve; // 0x14
        struct FRichCurve CustomCurve; // 0x18
        enum class ERBFDistanceMethod DistanceMethod; // 0x98
        enum class ERBFFunctionType FunctionType; // 0x99

    };

    struct FMovieScene3DAttachSectionTemplate : FMovieSceneEvalTemplate //ScriptStruct MovieSceneTracks.MovieScene3DAttachSectionTemplate
    {
    //Children Prop Count (Fields): 9
    public:

        struct FMovieSceneObjectBindingID AttachBindingID; // 0x20
        struct FName AttachSocketName; // 0x38
        struct FName AttachComponentName; // 0x40
        enum class EAttachmentRule AttachmentLocationRule; // 0x48
        enum class EAttachmentRule AttachmentRotationRule; // 0x49
        enum class EAttachmentRule AttachmentScaleRule; // 0x4a
        enum class EDetachmentRule DetachmentLocationRule; // 0x4b
        enum class EDetachmentRule DetachmentRotationRule; // 0x4c
        enum class EDetachmentRule DetachmentScaleRule; // 0x4d

    };

    struct FMovieScene3DPathSectionTemplate : FMovieSceneEvalTemplate //ScriptStruct MovieSceneTracks.MovieScene3DPathSectionTemplate
    {
    //Children Prop Count (Fields): 7
    public:

        struct FMovieSceneObjectBindingID PathBindingID; // 0x20
